[
    {
        "title": "Trump Orders Nuclear Weapons Trials After Russia Tests",
        "author": "Derek Wallbank and Alastair Gale",
        "published_time_utc": "2025-10-30T09:02:06.000Z",
        "article_link": "https://finance.yahoo.com/news/trump-orders-nuclear-weapons-trials-012124257.html",
        "full_content": "(Bloomberg) --President Donald Trump said the US would match its rivals in testing nuclear weapons after Russia in recent days announced trials of a nuclear-powered underwater drone and nuclear-capable cruise missile.\nMost Read from Bloomberg\nThe Quest for a Cheaper E-Bike\nNew York City’s Transit Chief Is Trying to Keep the Trains Running\nDallas Debuts $2.1 Billion Rail Line Linking Suburbs to Airport\nNYC’s Metro-North Extension to Penn Station Delayed Three Years\nAmtrak to Study Limited Metro-North Service Into Penn Station\n“Because of other countries’ testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis,” Trump said in a social media post shortly before meeting China’s leader in South Korea on Thursday. “That process will begin immediately.”\nTrump appeared to be reacting to Russia’s accelerated testing of so-called nuclear-capable super weapons in recent weeks. On Wednesday, Russia said it tested an atomic-powered torpedo drone capable of carrying nuclear weapons days after its military hailed a trial of a long-distance cruise missile.\nThe White House didn’t immediately respond to a request for clarification over whether Trump was ordering tests of nuclear-powered weapons and those that can carry nuclear warheads, rather than nuclear detonations.\nIn remarks later on a flight back to the US from South Korea, Trump provided no further clarity but said an announcement would be made about tests. “We don’t do testing. We’ve halted it years, many years ago, but with others doing testing, I think it’s appropriate that we do also,” he said.\nThe US’s last nuclear explosive test was in 1992, though it continues to test delivery systems — including intercontinental ballistic missiles, submarines and bombers — with mock weapons. Russia is the only other nation with a nuclear arsenal on par with the US. Its last known nuclear detonation was in 1990.\nTrump’s social media post came hours before a meeting with Chinese President Xi Jinping. Trump has previously expressed interest in brokering a nuclear treaty with China to reduce nuclear stockpiles, though the Chinese have resisted the US president’s pitch to join nonproliferation talks.\nNeither side appeared to have brought up nuclear weapons during the Thursday gathering, according to public statements they have made about the exchange.\nIn 2019, the US withdrew from a landmark nuclear disarmament treaty with Russia because it said Moscow had violated the treaty with the production of missiles banned under the agreement. Trump said at the time that the treaty was problematic because it didn’t include China, a rising nuclear weapons power.\nWhile China has a much smaller arsenal of nuclear warheads than the US and Russia, it is rapidly increasing its inventory, according to US government assessments. China last tested a nuclear bomb in 1996, but it continues to tests nuclear-capable missiles, including hypersonic missiles that are hard for missile defense systems to destroy.\nThe US, Russia and China have all signed an international treaty banning nuclear weapons tests. At a regular press briefing on Thursday, Guo Jiakun, a spokesman for the Chinese Foreign Ministry, said that Beijing “hopes that the US will earnestly abide by its obligations under the comprehensive nuclear test ban treaty and its commitment to a moratorium on nuclear testing.”\nTrump’s latest remarks on nuclear weapons come as efforts to broker ceasefire talks with Ukraine have faltered. Earlier this week, Trump said the cruise missile test championed by Vladimir Putin was “not appropriate” and that the Russian president should focus on ending the war with Ukraine.\nOn Monday, Trump brushed off security concerns over Russia’s tests by noting the US had a nuclear submarine “right off” its shores.\n“We test missiles all the time,” he added.\n(Updates with additional comments from Trump and Chinese spokesman.)\nMost Read from Bloomberg Businessweek\nThe Popular 3D-Printed Gun Globalizing the Second Amendment\nOnitsuka Tiger Sneakers Are Winning Gen Z’s Heart\nHow to Solve the US Farmworker Shortage, According to Congress\nAllow Zohran Mamdani to Reintroduce Himself\nOld Drugs Usually Go Way Down in Price. Here’s Why This One Skyrocketed\n©2025 Bloomberg L.P.",
        "tags": [],
        "article_link_hash": "f91854bdf8d314d1decaaf039386809e31de257108c5760f3b05effb350719f4"
    },
    {
        "title": "5 Things to Know Before the Stock Market Opens",
        "author": "Terry Lane",
        "published_time_utc": "2025-10-30T12:34:15.000Z",
        "article_link": "https://finance.yahoo.com/news/5-things-know-stock-market-123415464.html",
        "full_content": "Michael Nagle / Bloomberg / Getty Images\nStock futures are losing ground amid a barrage of earnings reports from major companies, as investors assess the latest developments in trade talks and Federal Reserve Chair Jerome Powell's warning that more rate cuts aren't a certainty; President Donald Trump said his meeting with Chinese leader Xi Jinping resulted in a rare earths mineral agreement and a reduction in certain tariffs on China; shares of Meta (META) and Microsoft (MSFT) are losing ground after the Magnificent Seven members reported results late yesterday, while Alphabet (GOOG) shares are surging after the Google parent reported more than $100 billion in quarterly sales; Apple (AAPL) and Amazon (AMZN) are due to release their quarterly reports after the closing bell; and Eli Lilly (LLY) shares are rising after the company reported strong sales of weight loss drug Zepbound and diabetes treatment Mounjaro. Here's what you need to know today.\nStock futures are lower as investors digest a flurry of corporate earnings reports and evaluate the results of trade talks between the U.S. and China. The major indexes hit record highs yesterday butgave back early gainsafter Fed Chair Jerome Powell said that another interest rate cut at the upcoming December meeting was “not a foregone conclusion—far from it.\" The comments came after the Fedtrimmed its benchmark ratefor the second time in as many months to support a labor market that has weakened. Futures tied to the Dow Jones Industrial Average were down 0.4% recently, while those linked to the benchmark S&P 500 and the tech-focused Nasdaq slipped 0.2%. The yield on the 10-year Treasury note, which affects borrowing costs on a wide array of consumer and business loans, was at 4.10%, up from 4.06% at yesterday's close and at its highest level in three weeks. Bitcoin was at $109,800, down from an overnight high of around $111,600. Gold futures fell slightly from yesterday's close to $3,985 an ounce, and are well off the record high of near $4,400 set early last week.\nPresident Trump reportedly said that “a lot of decisions were made” in his meeting with Chinese leader Xi on Thursday, potentially signaling a thaw in trade relations between the two nations. Trump said that an agreement onrare earth mineralswas reached after China restricted exports of the key product for high-tech manufacturing. The agreement will need to be renewed every year. Trump also said thatU.S. tariffs targeting China’s fentanyl productionwere reduced to 10% from 20%, taking overall U.S. tariffs on Chinese products down to 47%. More negotiations could be coming as Trump said he will visit China in April, with Xi making a visit to the U.S. sometime after that. The agreements are expected to add some certainty to U.S. trade policy after tariff announcements roiled markets earlier this year.\nShares of Microsoft (MSFT) and Meta (META) are lower in premarket trading after theMagnificent Sevenmembers delivered their highly anticipated quarterly results, while Alphabet (GOOG) stock soared after the Google-parent hit a new revenue milestone. Alphabet’s earnings topped Wall Street expectations as quarterly revenuestopped $100 billion for the first time, with each of its major business segments reporting sales growth of at least 10%. Microsoft also posted better-than-expected earnings asquarterly revenue jumped 18% year-over-year, led by 28% growth in cloud sales, though the stock fell amid concerns about the company's capital spending plan. Facebook parent Meta alsoreported strong revenue growth, but a one-time $16 billion tax charge helped sink its earnings well below estimates.  Alphabet shares were up about 8% ahead of the opening bell, while Meta tumbled 9% and Microsoft declined 2%..\nMore Magnificent Seven company earnings are on tap today, with Apple (AAPL) and Amazon (AMZN) set to release results after the closing bell. Apple shares hit record highs recently, boosting its market capitalization above $4 trillion (only Nvidia and Microsoft have higher market values), following a report that showedsolid sales of newly released iPhone 17 models.  Apple’sstock has fallen after recent earnings reportson investor worries over its progress on AI products. Meanwhile, Amazon has been the laggard among “Mag 7” stocks this year, and options pricing suggests that traders expect a big move for theonline retailer’s share priceafter the earnings report is released today. Apple shares were up 0.5% in recent premarket trading, while Amazon stock fell more than 1%.\nEli Lilly (LLY) shares are rising after the drugmaker reported better-than-expected earnings on strong demand for its weight loss drug Zepbound and diabetes treatment Mounjaro. Lilly reported third-quarter revenue of $17.6 billion, a jump of 54% over the prior year and ahead of analyst estimates of $16.1 billion as tracked by Visible Alpha. The company’s adjustedearnings per shareof $7.02 beat the consensus estimate of $5.91. Eli Lilly reported strong sales growth of key drugs, with worldwide Mounjaro revenue doubling to $6.52 billion, while U.S. sales of Zepbound nearly tripled to $3.57 billion. Eli Lilly shares were up 4% in recent premarket trading.\nRead the original article onInvestopedia",
        "tags": [
            "AAPL",
            "AMZN",
            "GOOGL",
            "LLY",
            "MSFT"
        ],
        "article_link_hash": "beefd9de272fa139e2f94992b7afa8eae9efac4a044e8984449afa00c4865ad4"
    },
    {
        "title": "Trump leaves meeting with China promising a tariff lowering and some near-term stability in the relationship",
        "author": "Ben Werschkul",
        "published_time_utc": "2025-10-30T11:07:18.000Z",
        "article_link": "https://finance.yahoo.com/news/trump-leaves-meeting-with-china-promising-a-tariff-lowering-and-some-near-term-stability-in-the-relationship-110718771.html",
        "full_content": "President Trump announced Thursday that the US would halve its fentanyl-related tariffs on Chinese goods as part of a reset in relations that includes China stepping back from its promise to restrict rare earth mineral exports for a year.\nOther parts of the limited agreement Trump outlined after a summit with Chinese President Xi Jinping in South Korea include increased purchases of US soybeans, more actions from China on the issue of fentanyl, thesuspension of some shipping fees,and a visit by Trump to China now penciled in for next April.\nTrump promised that additional details would be forthcoming and told reporters on Thursday that it had been a highly productive meeting, adding that a formal deal would be signed \"pretty soon.\"\nThe terms outlined are likely to provide markets with a measure of stability in the relationship between the world's two largest economies, at least into next year.\n\"The deescalation takes the immediate threat of large tariff hikes off the table, removing a key downside risk to the near-term outlook,\" Capital Economicsnoted in an analysisThursday, adding that underlying issues remain unresolved and, as such, \"both sides will continue to pursue wider decoupling efforts.\"\nThe summit in Busan was the first face-to-face meeting between the two leaders of Trump's second term and lasted a little under two hours.\nA clear headline for markets was the tariff reduction, with Trump announcing that he would cut the current 20% tariff on China imposed over fentanyl to 10% \"effective immediately.\"\nThe US has imposed a wide array of tariffs on China, from those 20% fentanyl-specific duties to 34% \"reciprocal\" tariffs to other sector-specific duties. The Peterson Institute for International Economicsestimates thatthe average US tariffs on Chinese exports stood at 57.6% before the meeting.\nTrump said the changes mean the new overall rate is about 47%.\nAlso key was the issue of rare earth minerals. By some estimates, China controls 90% of the world market for processing these precious metals that are crucial to modern electronics.\nChina rattled global markets recently by announcing plans to restrict their exports. As part of Thursday’s agreement, \"they're going to keep those flowing\" for at least a year, said Trump trade representative Jamieson Greer.\nChina’s Commerce Ministry on Thursday confirmed some of the terms, such as the lowering of fentanyl tariffs. Chinese state mediaoffered a few additional detailsand struck an optimistic tone, saying the meeting would allow the two sides to build a \"solid foundation for bilateral ties.\"\nNot apparently agreed to in the talks was the closely watched market issue of semiconductors. Trump promised only that China and Nvidia (NVDA) would later talk among themselves about the chipmaker's future access to the country.\n\"They're going to be discussing that with Nvidia to see whether or not they can do it,\" Trump said of China, describing his role as that of the \"referee\" but downplaying the chances of more advanced Blackwell chips being available anytime soon, saying \"we’re not talking about the Blackwell.\"\nAlso not finalized is TikTok. China’s Commerce Ministry said work to finalize the deal to spin off the app's US business and keep it available for Americans will continue.\nThere appeared to be little progress on China's relationship with Russia and its role in the war in Ukraine. Trump said he and Xi agreed to \"work together\" on the issue but added \"there's not a lot more we can do\" given China's long history of purchasing Russian oil.\nAlso, according to Trump, \"Taiwan never came up.\"\nOther issues saw more immediate attention, with Agriculture Secretary Brooke Rollinsconfirming even before the meetingthat China had renewed purchases of \"multiple ships of American soybeans.\"\nThat was a top item on Trump's agenda after China recently stopped purchases altogether, hurting the bottom lines of US soybean farmers to the point that it was a situation described by some as a \"Farmageddon.\"\nOn social media, Trumpteased what he saidcould be new energy purchases from China, saying \"a very large scale transaction may take place\" around purchasing oil and gas from Alaska.\n\"Progress in US-China trade talks today marks an undeniably positive step,\" noted Louise Loo, the head of Asia Economics at Oxford Economics, and \"sets the stage for deeper, more predictable engagement heading into 2026.\"\nBut she was quick to note that \"the détente is fragile given the high risk of policy missteps and mutual misreadings.\"\nThat larger takeaway from the gathering with China — which capped off an Asian swing that took President Trump from Malaysia to Japan to South Korea and also saw the president threaten minutes before meeting with Xito resume US nuclear testing for the first time in decades— was some stability in the relationship.\n\"We have a deal,\" Trump declared Thursday before offering a reminder that \"every year we'll renegotiate the deal.\"\nBen Werschkul is a Washington correspondent for Yahoo Finance.\nClick here for political news related to business and money policies that will shape tomorrow's stock prices\nRead the latest financial and business news from Yahoo Finance",
        "tags": [
            "NVDA"
        ],
        "article_link_hash": "52829444b896c4fc3b4fac06f92ad1bcfb51eaa49c0a9ba7d8f17ec5f05e339c"
    },
    {
        "title": "Eli Lilly raises full-year forecast, as weight-loss drugs demand drives third-quarter beat",
        "author": "Reuters",
        "published_time_utc": "2025-10-30T10:57:12.000Z",
        "article_link": "https://finance.yahoo.com/news/eli-lilly-raises-full-forecast-105712092.html",
        "full_content": "(Reuters) -Eli Lilly (LLY) raised its full-year profit and revenue forecast on Thursday as strong appetite for its widely popular weight-loss and diabetes drugs Zepbound and Mounjaro helped it beat third-quarter earnings estimates.\nThe company shares jumped 6% in premarket trading. Lilly competes with Novo Nordisk for the top spot in the weight-loss drug market, which is poised to reach $150 billion by the end of the decade.\nInvestors have been keenly awaiting latest results from the drugmaker amid sky-high expectations for its GLP-1 portfolio and growing concern over potential U.S. price negotiations.\nSince taking office in January, President Donald Trump has been striving to narrow the gap between U.S. and foreign drug prices. Under its \"most favored nation\" policy, the U.S. government will require drugmakers to charge patients in the country no more than in other wealthy nations.\nLilly's shares have gained over 6% this year due to the ever-growing popularity of its diabetes and weight loss treatments.\nThe company said it expects to earn $23.00 to $23.70 per share on an adjusted basis this year, compared with its previous forecast for a profit of $21.75 to $23.00 per share.\nAnalysts were expecting a profit of $22.18 per share for 2025.\nFor the quarter, the company earned $7.02 per share on an adjusted basis, compared with analysts' average estimate of $5.69, according to data compiled by LSEG.\n(Reporting by Mrinalika Roy in Bengaluru; Editing by Saumyadeb Chakrabarty)",
        "tags": [
            "B.CO",
            "LLY",
            "NOVO"
        ],
        "article_link_hash": "dd7499c9e044c2e92e523999cdd5bde064c0a3a7992ebfce9b2a70452246cb65"
    },
    {
        "title": "US and China agree one-year trade truce after Donald Trump-Xi Jinping talks",
        "author": "Demetri Sevastopulo and Joe Leahy",
        "published_time_utc": "2025-10-30T12:12:30.000Z",
        "article_link": "https://finance.yahoo.com/news/us-china-agree-1-trade-081150955.html",
        "full_content": "Donald Trump and Xi Jinping have agreed to postpone export controls on rare earths and chips as part of a broad one-year trade deal reached",
        "tags": [],
        "article_link_hash": "32afbf52cf6c3aa4a8ffc65e73d4f78481fd32eedf050829e961e28bd3a4d084"
    },
    {
        "title": "JPMorgan Tokenizes Private-Equity Fund on Its Own Blockchain",
        "author": "Vicky Ge Huang",
        "published_time_utc": "2025-10-30T12:00:00.000Z",
        "article_link": "https://finance.yahoo.com/news/jpmorgan-tokenizes-private-equity-fund-120000771.html",
        "full_content": "JPMorgan Chase wants to make investing in alternative assets easier by offering them through digital tokens.\nThe banking giant said Thursday that it tokenized a private-equity fund on its blockchain platform, an offering that is available to the wealthy clients served by its private bank.\nJerry Jones Says He Has Unlocked a $100 Billion Gas Bounty in This Drilling Inferno\nBinance Boosted Trump Family’s Crypto Company Ahead of Pardon for Its Billionaire Founder\nFed Divisions Reveal New Caution Over Continued Cuts\nFiserv Erases $30 Billion in Market Value After New CEO Pulls Guidance\nGoogle Revenue Soars to Record as AI Boom Lifts Cloud Business\nThe move comes ahead of JPMorgan’s broader rollout next year of its fund tokenization platform, Kinexys Fund Flow.\nTokenization lets the bank offer clients a digital representation of the ownership of an asset that lives on a blockchain ledger.\nDespite their past wariness of crypto, banks have long espoused the potential of the blockchain technology that underpins digital currencies to streamline their businesses. President Trump’s signing this summer ofthe Genius Act, which created a regulatory framework for tokenized dollars known as stablecoins, has fueled a wave of efforts to tokenize everything from individual stocks to funds and real assets.\nIn July, Goldman Sachs and Bank of New York Mellon said they are partnering tolaunch digital tokensthat confer ownership of money-market funds managed by many of the biggest investment firms, including BlackRock and Fidelity Investments, as well as their own asset-management arms.\nJPMorgan’s Kinexys Fund Flow platform collects data from fund managers, distributors and administrators, creates smart contracts representing fund ownership, and facilitates the near-instant exchanging of cash and assets on the blockchain.\n“For the alternative investments industry, it’s just a matter of time that a blockchain-based solution is going to be adopted,” said Anton Pil, head of global alternative investment solutions for JPMorgan’s asset management arm. “It’s more about simplifying the ecosystem of alternatives and making it, frankly, a little easier to access for most investors.”\nFor example, a tokenized fund lets all parties share a single, real-time view of who owns what and who has paid up on their investment promises. That helps reduce the surprise that can come with “capital calls,” or the requests that private fund managers often make on short notice for investors to provide a portion of the capital they previously committed.\nThe tokenization of private funds could eventually expand investor access to the more complex, expensive and often-opaque investment vehicles that have long been in the domain of the elite.\nJPMorgan expects to tokenize additional alternative investment strategies, including private credit, real estate, and hedge funds, in the future. The bank is also exploring the possibility of allowing clients to use fund tokens as collateral for borrowing or constructing a portfolio of tokenized assets.\nBanks still face regulatory restrictions when it comes to blockchains, and mainly use private platforms that allow selected users in a closed ecosystem.\nWrite to Vicky Ge Huang atvicky.huang@wsj.com\nFuture Fed Rate Cuts ‘Far’ From Certain After Divided Meeting\nVerizon’s New CEO Promises Big Changes After Another Drop in Phone Subscribers\nWhy UPS Is Increasingly Turning to Gig Drivers for Deliveries\nMeta Shares Fall on Accelerating AI Spending Despite Record Revenue\nInternet Pioneer AOL to Be Acquired by Italian Tech Company Bending Spoons",
        "tags": [
            "JPM"
        ],
        "article_link_hash": "32066db02e3f9128417a51ffd6e96d141dea7ff32ba5eae26cc4b52a622afc9a"
    },
    {
        "title": "Earnings live: Meta stock tumbles, Microsoft slides, and Alphabet jumps as Big Tech earnings pour in",
        "author": "Yahoo Finance",
        "published_time_utc": "2025-10-30T12:37:25.000Z",
        "article_link": "https://finance.yahoo.com/news/live/earnings-live-meta-stock-tumbles-microsoft-slides-and-alphabet-jumps-as-big-tech-earnings-pour-in-121919945.html",
        "full_content": "Markets are in the midst of thebusiest weekfor third quarter earnings, with results from several Big Tech companies highlighting the calendar.\nSo far, the earnings season is off to a positive start. As of Oct. 24, 29% of S&P 500 companies have reported results, according toFactSet data, and analysts are expecting a 9.2% jump in earnings per share during the third quarter. If that figure holds, it would mark the ninth straight quarter of positive earnings growth but a deceleration from the 12% earnings growth reported in Q2 of this year.\nExpectations were slightly lower coming into the quarter, as analysts expected S&P 500 companies to report a 7.9% jump in earnings per share during the third quarter.\nThis week, five of the \"Magnificent Seven\" tech companies —Microsoft(MSFT),Alphabet(GOOG),Meta(META),Apple(AAPL), andAmazon(AMZN) — representing about a quarter of the S&P 500, report results.\nOther notable companies reporting updates this week includeBoeing(BA), Visa (V),Starbucks(SBUX), UnitedHealth Group (UNH), Verizon (VZ), Mastercard (MA),Chipotle(CMG), Merck & Co. (MRK), Shell (SHEL), Exxon Mobil (XOM), Chevron (CVX), Coinbase (COIN), Caterpillar (CAT), ServiceNow (NOW), Anheuser-Busch InBev (BUD), and Eli Lilly (LLY).\nHere are the latest updates from corporate America.\nYahoo Finance'sDaniel Howleyreports:\nRead more here.\nYahoo Finance'sDaniel Howleyreports:\nRead more here.\nYahoo Finance'sLaura Brattonreports:\nRead more here.\nHershey (HSY) reported an earnings beat and guidance raise on Thursday, but the stock fell around 1% in premarket trading.\nEarnings per share of $1.36 came in above expectations for $1.30 per share, according to S&P Global Market Intelligence. Revenue of $3.18 billion was above the $3.11 billion expected.\nThe company said it expects $160 million to $170 million in tariff costs this year. The company is also grappling withsoaring cocoa prices.\nHere's a look at net sales in each of Hershey's business segments:\nHershey sees full-year net sales growth of around 3%, up from its previous forecast of 2% growth. Year over year, Hershey expects earnings per share to decrease 36% to 37% in 2025.\nListen to the earnings call live here.\nRoblox (RBLX) raised its annual bookings forecast for the third time this year, driven by strong in-game spending on titles such as \"Steal a Brainrot\", which has helped it surpass 150 million daily active users.\nShares in Roblox fell 3% in premarket trading on Thursday.\nReuters reports:\nRead more here.\nMerck (MRK) stock fell over 2% in premarket trading as the company's earnings beat was not enough to reassure investors, as the company braces for the expiration of key patents.\nThe drugmaker reported earnings per share of $2.58 a share, topping Wall Street analysts' estimates of $2.35 per share. Revenue of $17.2 billion also beat estimates for $16.9 billion.\nSales of Merck's blockbuster cancer immunotherapy drug Keytruda rose 10% to $8.14 billion, and sales of its hypertension drug Winrevair grew 141% to $360 million. However, Gardasil sales declined 24% to $1.7 billion.\nThe company also said it received FDA approval for a version of Keytruda that patients can inject under the skin, as Merck barrels toward the 2028 expiration of its Keytruda patent.\nMerck now expects full-year sales to be between $64.5 billion and $65 billion, a narrower range than the $64.3 billion and $65.3 billion the company previously forecast. Earnings per share are expected to be between $8.93 and $8.98 for 2025, which is raised slightly.\nComcast (CMCSA) managed to slow subscriber defections in its third quarter. The media company was helped by an internet price-lock guarantee and bundled plans.\nShares in Comcast rose by more than 1% before the bell on Thursday.\nBloomberg News reports:\nRead more here.\nEli Lilly (LLY) stock rose 6% on Thursday before the bell after raising its full-year profit and revenue forecast as strong appetite for its widely popular weight-loss and diabetes drugs Zepbound and Mounjaro helped it beat third-quarter earnings estimates.\nReuters reports:\nRead more here.\nReuters reports:\nRead more here.\nStellantis (STLA) reported a 13% year-on-year increase in revenue for its third quarter earnings on Thursday. The automaker's shares fell % before the bell.\nReuters reports:\nRead more here.\nI know you are probably still digesting all things Fed, but I encourage you to read Chipotle's (CMG) earnings call transcript before the market opens on Thursday.\nAlarming as it pertains to the health of the consumer. CEO Scott Boatwright talks about falling sales in October because of consumer pressure.\nKey comment from him:\n\"We're seeing that significant pullback from that cohort under $100,000 annually. Also, that age group 25 to 34, which we over-index to, is about 25% of our total sales, has pulled back meaningfully. Based on our data, both purchased and in-house data, it shows that we are gaining market share, but that cohort, so meaning we're not losing them to the competition, we're losing them to grocery and food at home. That consumer is under pressure. It is one of our core consumer cohorts, and they feel the pinch, and we feel the pullback from them as well.\"\nBloomberg reports:\nRead more here.\nYahoo Finance'sBrooke DiPalmareports:\nRead more here.\nServiceNow (NOW) stock jumped about 4% after hours following the company's earnings report, which beat estimates on the top and bottom lines. The cloud-based software company also raised its outlook for annual subscription revenue.\nReuters reports:\nRead more here.\nFrom Reuters:\nRead more here.\nStarbucks (SBUX) stock popped as much as 3% in extended trading after the coffee company returned to global same-store sales growth.\nYahoo Finance's Brooke DiPalma reports:\nRead more here.\nCarvana (CVNA) said sales surged 55% in the third quarter, with profits jumping in tandem as the online car retailer touted the advantages of its “vertically integrated” business model.\nCarvana reported Q3 revenue of $5.65 billion, up 55% versus a year ago and surpassing the $5.11 billion estimated, per Bloomberg consensus. It posted earnings per share of $1.03, missing estimates of $1.32, but adjusted EBITDA came in at a record $637 million, topping the $598.2 million expected and representing a 48% increase compared to last year.\nCarvana also reported that it sold a record 155,941 vehicles in the quarter, up 44% year over year. The stock slipped in after-hours trading.\n“In Q3, Carvana once again drove industry-leading growth and profitability while crossing over $20 billion revenue run rate scale for the first time,\" Carvana founder and CEO Ernie Garcia said in a statement. “We continue to focus on unlocking the structural advantages of our vertically integrated model that strengthen our business and separate our customer offering.”\nCarvana, which buys, reconditions, sells, and delivers vehicles fully online, says it is the most profitable car dealer, with industry-leading margins.\nCritics and short sellers believe the Carvana model is flawed and may be hiding some distress.\n“Given the news in the subprime auto space of defaults, bankruptcies, rising delinquencies, the fact that Carvana seems to be sailing through it with nary a scratch stretches credulity,” short seller Jim Chanos said in an interview with Bloomberg Television this week. Chanos cited “transparency” issues with Carvana’s loan service Bridgecrest.\nCarvana is projecting sales of over 150,000 units in Q4, with full-year adjusted EBITDA in a range of $2 billion to $2.2 billion, which is slightly below estimates of $2.21 billion.\nIn another upcoming earnings report, Alphabet (GOOG,GOOGL) will reveal more details about how the AI boom is shaping the Google parent's business. Yahoo Finance'sLaura Brattonbreaks down what analysts will be watching for:\nRead more here.\nYahoo Finance'sDaniel Howleyalso previews what to watch when Meta (META) reports earnings:\nRead more here.\nMicrosoft is set to report first quarter results, offering Wall Street its latest look at the company's AI and cloud growth. Yahoo Finance'sDaniel Howleypreviews what to expect when Microsoft reports after the bell on Wednesday:\nRead more here.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance",
        "tags": [
            "ABI.BR",
            "GOOG",
            "GOOGL",
            "META",
            "MSFT"
        ],
        "article_link_hash": "1fa07bf780600b90af7fc3d428f6241095afe7f43e3bc0c498059d8281304daf"
    },
    {
        "title": "Powell challenges the market's idea of a Fed on autopilot",
        "author": "Hamza Shaban",
        "published_time_utc": "2025-10-30T10:00:51.000Z",
        "article_link": "https://finance.yahoo.com/news/powell-challenges-the-markets-idea-of-a-fed-on-autopilot-100051894.html",
        "full_content": "This is The Takeaway from today's Morning Brief, which you cansign upto receive in your inbox every morning along with:\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nFed Chair Jerome Powell reminded us that next meeting's decision is made... next meeting.\nAftermoving to lower rates on Wednesdayby a quarter point, the head of the central bank took care to say the next cut might not come as soon as the market expects it to.\n\"A further reduction in the policy rate at the December meeting is not a foregone conclusion,\" Powell said at the press conference, adding \"far from it\" for good measure.\nThe statementprompted stock charts to plungeinto the red and Treasury yields to spike before ending the day where they began.\n\"Not a foregone conclusion\" sounds scary when you areexpecting a cut. And the market's first reaction was to pull back, perceiving a gap between Wall Street expectations and the Fed's likely course in six weeks' time.\nRead more:How the Fed rate decision affects your bank accounts, loans, credit cards, and investments\nPowell went so far as to say that this particular warning was different. He noted that he always says the central bank makes data-dependent decisions at the time of its policy meeting, and not before. But \"I'm saying something in addition here,\" he said, emphasizing the uncertainty of the Fed's path ahead given upside risks to inflation, downside risks to the labor market, a tool that can't solve both at the same time, and very little data to work with.\nIn prior projections in September, policymakers signaled the Fed would ease in both October and December. And in the absence of data amid the government shutdown, markets had come to an understanding that a data blackout would mean hewing to the autopilot's course charted by the dot plot.\nPowell's special \"something in addition here\" seemed to poke a hole in that idea.\nBut how can the Fed remain data dependent without the best data? It can be done, Powell said, as he and his colleagues glean insight from other sources. But the context of the shutdown may influence the Fed's next decision.\n\"What do you do when you are driving in the fog? You slow down,\" Powell said. \"I don't know how that is going to play into things. The data may come back. But there's a possibility that it would make sense to be more cautious about moving.\" (Critically, slowing down does not mean easing the throttle back on rates — it is a tricky metaphor.)\nAs the trading day came to a close and the losses pared back, cooler heads prevailed and investors appeared to take Powell's remarks in stride. A cautious note, or even an explicit warning, isn't a \"no\" either.\nWhile Powell tried to frame the day's decision — which came with two dissents in opposite directions — as a reflection of a healthy consensus on the Fed, he made clear that his colleagues disagree on what to do next.\n\"The strongly differing views were really about the future, what does that look like,\" he said, as attention turns to December.\nTraders are still pricing in the likelihood of another cut, even as Powell sowed doubt. He doesn't know what's going to happen, and the clashing opinions of his colleagues, blanketed with a data fog, won't make the choice any easier.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on X@hshaban.\nClick here for the latest economic news and indicators to help inform your investing decisions\nRead the latest financial and business news from Yahoo Finance",
        "tags": [],
        "article_link_hash": "655e605be47a9acf5e81933011eaccf7239194840320540c36bb5176f8e381a6"
    },
    {
        "title": "German auto industry plans temporary chip information platform to ease supply risks",
        "author": "Reuters",
        "published_time_utc": "2025-10-30T12:18:36.000Z",
        "article_link": "https://finance.yahoo.com/news/german-auto-industry-plans-temporary-121836818.html",
        "full_content": "BERLIN (Reuters) -Germany's automotive industry association VDA plans to set up a temporary information platform via a neutral third party to help manufacturers and suppliers avoid the negative consequences of a possible chip shortage, it said on Thursday.\nThe platform will enable companies to anonymously offer available Nexperia semiconductor capacities, with negotiations handled outside the exchange, and has received clearance from the German antitrust authority, VDA said.\n(Reporting by Kirsti KnolleEditing by Madeline Chambers)",
        "tags": [],
        "article_link_hash": "ee4fd5abeed331f439f2b59bc7283995b6c1b4e69259059fc60b46ded117b8e8"
    },
    {
        "title": "Government shutdown live: New signs point to talks 'pretty soon' as economic pain mounts",
        "author": "Yahoo Finance",
        "published_time_utc": "2025-10-30T12:07:45.000Z",
        "article_link": "https://finance.yahoo.com/news/live/government-shutdown-live-new-signs-point-to-talks-pretty-soon-as-economic-pain-mounts-100414433.html",
        "full_content": "The government shutdown is less than a week from breaking the record as the longest in US history as new signs emerge on Capitol Hill that negotiations could finally be in the offing.\nBut for Americans struggling with the shutdown's effects, these tentative steps are expected to take days to play out.\nYet Senate Majority Leader John Thune offered a marked shift this week when he noted new energy for work on bipartisan government appropriations and even suggested he would be meeting with Democrats \"pretty soon\" to talk about ending the shutdown completely.\nBut for now, the Senate is scheduled to conclude its formal business Thursday with lawmakers likely to head home for another weekend of shutdown.\nIn focus before lawmakers return are Trump administration plans to not fund the Supplemental Nutrition Assistance Program (SNAP) — also known as food stamps — starting this weekend.\nThose benefits are received by roughly one in eight Americans, with the economic and human costs ofa cutoff likely to mount quickly. More than two-dozen statesalso unveiled a lawsuitto try and block this suspension of benefits.\nAlso this week, air traffic controllers became the latest group of federal workers to go without pay. They missedtheir first full paycheck on Tuesdayas flight interruptions continue to spread.\nActive duty members of the military, who have paychecks are due at the end of the month, appear set for a reprieve after Vice President JD Vance said the Trump administration will likely find money to make this payment.\nDemocrats, meanwhile, are focused on another deadline this coming weekend when they hope the political pressure on Republicans will increase.\nSaturday is the beginning of an open enrollment period for healthcare programs run by Affordable Care Act exchanges. Premium increases there — with Democrats looking to extend enhanced government subsidies for those plans — are at the heart of the impasse.\nRead more:How the government shutdown impacts your money: student loans, Social Security, investments, and more\nHere are the latest updates as the impacts of the government shutdown unfold.\nPresident Trump is heading back to the US after his Asia trip andmeeting with Chinese President Xi Jinping. He's set to arrive back in Washington just as real talks to end the shutdown finally appear to be possible.\nA series of signals in recent days have suggested new openness to bipartisan talks after a month of shutdown. But it may take days to play out as the economic pain continues.\nBurgess Everett of Semaforreports on the shifting state of play on Capitol Hill:\nRead more here.\nObamacare exchange consumers in the 30 states got a first look this week at what they'll pay in 2026 when new rates were posted at healthcare.gov.\nIt could increase the pressure on an agreement to end the shutdown, with premiums set to soar.\nCNN has more:\nRead more here.\nThe ongoing federal shutdown has already cost the US economy between $7 billion and $14 billion, according to a new report from the nonpartisan Congressional Budget Office (CBO).\nThat could subtract up to 2% from gross domestic product in the fourth quarter.\nReuters reports:\nRead more here\nAt a press conference on Wednesday, Federal Reserve Chair Powell fielded questions from reporters about how the government shutdown is affecting the central bank's decision making.\nThe Fed cut interest rates by 25 basis points at its October meeting,as expected, even as the shutdown has deprived central bank policymakers of some of the gold-standard government data that they typically rely on.\n\"This is a temporary state of affairs,\" Powell said (watch the full press conference below). \"We're going to collect every scrap of data we can find, evaluate it, and think carefully about it. And that's our jobs. That's what we're going to do.\"\nPowell explained that the Fed will continue to look at other sources of information, such as the Fed's Beige Book and private data. He noted that the Fed may not have a \"very granular understanding of the economy while this data is not available\" but that it would pick up on \"material developments\" in the economy.\nStill, Powell acknowledged that the lack of data could make the Fed more cautious in its December meeting. \"If you ask me, could it affect the December meeting?\" Powell said. \"I'm not saying it's going to, but yeah, you could imagine that.\"\n\"If you're driving in the fog, you slow down,\" he added.\nFood stamp funding is set to lapse within days due to the shutdown with struggling Americans bracing to go without government assistance during a period of higher grocery prices.\nEmma Ockermancovers the economy and labor for Yahoo Finance and finds that the economic and human costs of a food cutoff could add up quickly.\nRead more here.\nVice President JD Vance was on Capitol Hill on Tuesday and told reporters that it's his expectation that the Trump administration will find the money to pay U.S. military members at the end of the week but without specifying how.\nThe Associated Press reports\nRead more here.\nA coalition of 25 mostly Democratic-led states have filed a lawsuit to stop the Trump administration from its plan to suspend food aid benefits next month.\nReuters reports\nRead more here\nAs the US government shutdown drags on, President Trump's administration is trying to cancel federal funding that was already approved, on top of the billions it has canceled or threatened to cancel, since he took office.\nBut states, cities, and nonprofits have pushed back against the attempted cuts with more than 150 lawsuits, the Associated Press reports. For the most part, these cases have been successful in court so far.\nRead more here.\nThe US Department of Transportation said nearly half of the 8,600 flight delays at US airports on Sunday were due to a spike in air traffic controller absences, brought on by the government shutdown, Reuters reports. And nearly 3,000 flights were delayed on Monday with the shutdown in its 27th day.\nAir traffic controllers and Transportation Security Administration (TSA) officers are required to continue working unpaid during the shutdown. Many will miss their first full paycheck this week. Normally, air traffic controller absences only account for about 5% of flight delays, the DOT said.\nRead more here.\nThe meeting between President Trump and his Chinese counterpart, President Xi Jinping, this week could offer farmers some relief — and Trump a lifeline — as afarm aid bill remains stalled in Congress.\nAccording to Henrietta Treyz, managing partner and director of economic policy at Veda Partners, the US delegation is seeking confirmation that China will resume purchases of American soybeans, which would help struggling farmers caught between US trade policies and foreign countermeasures.\n“If China buys soybeans, then the president is under a little bit less pressure to reach a deal with Democrats that could compel them to give some funding for a bailout package domestically,” Treyztold Yahoo Finance.\nLast week, the Trump administration announced that the Agriculture Department would reopen approximately 2,100 core county offices to release more than $3 billion in aid to US farmers, despite the ongoing government shutdown. According to the AP, a White House official said the administration is using funds from a USDA agency that addresses agricultural prices. The release of these funds comes after farm aid was frozen for three weeks.\n\"This is the critical piece,\" Treyz said about agriculture and the US-China talks. \"China has quite a bit of room to make purchases ... [and] that dynamic has a read-through to the government shutdown.\"\nAhead of the busy holiday travel season, U.S. Transportation Secretary Sean Duffy said Sunday that more flight delays and cancellations are likely as the government shutdown, now more than two weeks old, drags on with no end in sight, Bloomberg reports:\nRead more here.\nThe U.S. Department of Agriculture said Friday it will not use contingency funds to help pay Supplemental Nutrition Assistance Program, or SNAP benefits, even though the government shutdown means the program will lapse in a few days' time, according to a department memo, Reuters reports.\nRead more here\nAfter the USDA said Friday it would not use a contingency fund to bolster the Supplemental Nutrition Assistance Program (SNAP), some states are looking at alternate funding scenarios. SNAP benefits will lapse in November if the U.S. government remains shut down, and Reuters reports that food banks across the country will struggle to absorb the expected uptick in people seeking food.\nRead more here.\nFlights were delayed Thursday at New York's LaGuardia Airport, New Jersey's Newark airport, and Washington’s Reagan National Airport.\nThe cause, as in previous delays seen earlier this week, was air traffic controller staffing shortages exacerbated by the government shutdown.\nThe Associated Press reports:\nRead more here\nThe White House said Friday that the release of October inflation data due next month is likely to be canceled due to the US government shutdown, posting \"there will likely NOT be an inflation release next month for the first time in history.\"\nThe post went on to again blame Democrats for the stoppageand added that \"surveyors cannot deploy to the field — depriving us of critical data ... the economic consequences could be devastating.\"\nThe announcement came as September's inflation datawas belatedly released and came in lower than expectedbut held stubbornly at around 3% in September.\nAnother closely watched government data release is the monthly jobs report. September's jobs data was compiled but the shutdown commenced before it could be released.\nDemocratic Sen. Elizabeth Warren of Massachusetts added a challenge Friday for Trump to \"release the already prepared September jobs numbers before the Fed meets next week to decide on interest rates,\" saying the president is \"hiding\" that data.\nA White House official also didn't immediately respond to a request for comment on whether October's jobs report was in jeopardy because of the shutdown.\nTransportation Secretary Sean Duffy said Thursday morning that traffic controllers \"are angry\" about the shutdown and that additional flight delays could be in the offing as flyer safety becomes a growing concern.\n\"I can't guarantee you that your flight is going to be on time, I can't guarantee that your flight isn't going to be cancelled,” Duffy said Thursday during an appearance on Capitol Hill alongside House Speaker Mike Johnson.\nThe secretary added that shutdown-related disruptions are \"moving throughout the national airspace,\" and that as he and his team see safety issues, \"we will delay flights.\"\nThe new comments come as shutdown-related travel delays are already piling up. Staffing shortages among air traffic controllers led to delays over this past weekend and the Federal Aviation Administrationconfirmed new airport troubles on Tuesday.\nThursday’s event also featured Sam Graves, a Missouri congressman and chair of the House Transportation Committee. The lawmaker said that for now \"our skies are safe,\" but Johnson added that the longer the shutdown continues, \"the safety of the American people is thrown into further jeopardy.\"\nDuffy also expressed renewed worry Thursday that the shutdown could cause long-term problems, saying that current air traffic control trainees are thinking about leaving the field given shutdown uncertainty.\nThe secretary added that, giventhe already stressed air travel system, if the shutdown continues, these problems could \"ricochet in the months and the years to come.\"\nThelatest daily statement from the US Treasury Departmentfinds that America's gross national debt has topped $38 trillion. It's the fastest accumulation of an additional trillion dollars in debt since the COVID-19 pandemic.\nThe gross national debt hit $37 trillion just in August of this year.\nCBS News reportshow the ongoing shutdown could make things worse.\nRead more here.\nHilton (HLT) CEO Christopher Nassetta said on Wednesday that the government shutdown is likely to impact hotels as federal workers halt travel plans.\n\"We have factored for that into the forecast in the fourth quarter,\" Nassetta said on the company's earnings call, adding, \"It is affecting the numbers.\"\nThe shutdown comes at a time when the hotel industry is already facing headwinds from government policies. In the third quarter, Hilton reported that occupancy levels were subdued due in part to softer international travel to the US and declines in government-related travel spending.\nPolicies that may be dampening government travel spending include cost-cutting efforts in the US, such as those by the Department of Government Efficiency (DOGE), which have also frozen or curtailed travel at several agencies. In August, China alsotightened its restrictionson travel by public employees.\nThe Federal Aviation Administration says air traffic controller staffing issues have caused new headaches this week for some travelersafter a round of delays was seen over the weekend.\nThese federal workers are currently being asked to continue reporting to work during the shutdown, even as their paychecks have ceased. Controllers got a partial paycheck earlier this month and are set to see the pay they're due to receive next week fully delayed until the shutdown ends.\nReuters reports\nRead more here\nThe first three weeks of this government shutdown have positioned air traffic controllers — a group that often rode out previous stoppages with minimal fanfare — as a key economic crimp point so far.\nThis comes after years of challenges in control towers.\nJust this past weekend, tracking site FlightAware clocked over 5,000 US delayson both Saturday and Sunday. The FAA said staffing shortages were a major culprit.\nRead more here.",
        "tags": [],
        "article_link_hash": "9d3e45d6ec7f33d05779683959468511a5e58c4aa90eda1b42f71226bf27c2f4"
    },
    {
        "title": "Aptiv lifts annual profit forecast on electrical, software system demand from automakers",
        "author": "Reuters",
        "published_time_utc": "2025-10-30T12:01:30.000Z",
        "article_link": "https://finance.yahoo.com/news/aptiv-lifts-annual-profit-forecast-120130962.html",
        "full_content": "(Reuters) -Aptiv raised its full-year profit forecast on Thursday, banking on sustained demand for its electrical and software systems from the global auto industry.\nSteady demand for Aptiv's advanced driver-assistance systems and infotainment units helped it offset a hit from Trump's broad range of tariffs and weak demand for electric vehicles.\nPeer BorgWarner topped analysts' expectations for third-quarter profit, aided by strong demand for its turbochargers and powertrains.\nAptiv now expects annual adjusted net income per share of between $7.55 and $7.85, up from its prior range of between $7.30 and $7.60.\nIts overall quarterly net sales rose about 7.4% to $5.21 billion, topping estimates of $5.09 billion, according to data compiled by LSEG.\nOn an adjusted basis, it earned a profit per share of $2.17 for the quarter through September, compared with $1.83 a year earlier.\n(Reporting by Nathan Gomes in Bengaluru; Editing by Anil D'Silva)",
        "tags": [
            "APTV"
        ],
        "article_link_hash": "7b78b33921001f97d31688f33320893434aab49fdfe2112db4957d96ef846a98"
    },
    {
        "title": "Mastercard beats profit estimates as transaction volumes hold strong",
        "author": "Reuters",
        "published_time_utc": "2025-10-30T12:06:38.000Z",
        "article_link": "https://finance.yahoo.com/news/mastercard-quarterly-profit-rises-transaction-120638416.html",
        "full_content": "(Reuters) -Mastercard beat Wall Street expectations for third-quarter profit on Thursday, as sustained consumer spending boosted its payment volumes.\nConsumer spending has proven resilient, while labor market cracks and sticky inflation continue to fuel concerns over U.S. President Donald Trump's trade and immigration policies.\nMastercard's earnings round off the earnings season for card companies, which are closely tracked by Wall Street to gauge consumer health.\nDue to their expansive share of global everyday transactions, card networks run by Mastercard and Visa are widely perceived as shielded from a potential payments slowdown.\nRival Visa also beat quarterly profit expectations earlier this week, while American Express' focus on wealthy customers helped it rake in record revenue during the third quarter.\nThe company reported adjusted profit of $3.96 billion, or $4.38 per share, for the quarter ended September 30. Analysts, on average, were expecting a profit of $4.32 per share, according to data compiled by LSEG.\nMastercard's net revenue rose 17% to $8.6 billion in the quarter from a year earlier.\nA bottleneck of Federal data due to the U.S. government shutdown has added uncertainty to the consumer outlook at a time when private data suggests plummeting consumer sentiment and a widening rift between lower-income and affluent consumers.\nMastercard's value-added services and solutions business, which now makes up more than a third of the company's business, fetched 25% higher revenue in the quarter.\nThe company has diversified its revenue streams to leverage the burgeoning demand for threat intelligence and fraud reduction via value-added services.\nCross-border volume, which tracks spending on cards outside the country of their issue, jumped 15% on a local currency basis.\nShares of the Purchase, New York-based card network giant fell marginally before the bell.\n(Reporting by Ateev Bhandari in Bengaluru; Editing by Anil D'Silva and Shinjini Ganguli)",
        "tags": [
            "MA"
        ],
        "article_link_hash": "b9989d72052aee3b4e68c470fe0bda30bf8d93eb362b18667d5dbd825af18534"
    },
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq futures struggle after Trump-Xi truce with Big Tech earnings ahead",
        "author": "Rian Howlett",
        "published_time_utc": "2025-10-30T12:45:37.000Z",
        "article_link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-struggle-after-trump-xi-truce-with-big-tech-earnings-ahead-224956363.html",
        "full_content": "US stock futures stalled on Thursday as Wall Street eyed the US-China tradetruce struckby Presidents Trump and Xi,cooling oddsof another interest-rate cut, and the next tranche of Big Tech earnings.\nDow Jones Industrial Average(YM=F)futures slipped 0.3%. Contracts on the broad benchmark S&P 500(ES=F)and the tech-heavy Nasdaq 100(NQ=F)wavered around the flat line.\nStocks have lost steam after Fed Chair Jerome Powellstressedthat a December rate cut is \"not a foregone conclusion — far from it.\" His comments, which came after the central bank lowered its benchmark rate by a quarter percentage point, highlight division among policymakers.\nTheTrump-Xi meetingovernightfailedto provide a boost, even as it delivered effectively a one-year trade truce. The US will halve fentanyl-related tariffs on China in return for a 12-monthpausein Beijing's curbs on rare earth supplies, while China has pledged to startbuying American soybeansagain.\nMeanwhile, investors braced for quarterly results from tech megacaps Apple (AAPL) and Amazon (AMZN) after the bell, following mixed earnings reports from their \"Magnificent Seven\" counterparts Alphabet (GOOG), Meta (META), and Microsoft (MSFT) late Wednesday.\nAlphabet shares jumped over 7%after the Google parent reported stronger-than-expected quarterly results. ButMeta sank almost 8%andMicrosoft slipped nearly 3%as investors parsed the companies' outlooks.\nYahoo Finance's Hamza Shaban reports:\nAftermoving to lower rates on Wednesdayby a quarter point, the head of the central bank took care to say the next cut might not come as soon as the market expects it to.\n\"A further reduction in the policy rate at the December meeting is not a foregone conclusion,\" [Fed Chair Jerome] Powell said at the press conference, adding \"far from it\" for good measure.\n\"Not a foregone conclusion\" sounds scary when you areexpecting a cut. And the market's first reaction was to pull back, perceiving a gap between Wall Street expectations and the Fed's likely course in six weeks' time.\nPowell went so far as to say that this particular warning was different. He noted that he always says the central bank makes data-dependent decisions at the time of its policy meeting, and not before.\nBut he said, \"I'm saying something in addition here,\" emphasizing the uncertainty of the Fed's path ahead given upside risks to inflation, downside risks to the labor market, a tool that can't solve both at the same time, and very little data to work with. ...\n\"What do you do when you are driving in the fog? You slow down,\" Powell said. \"I don't know how that is going to play into things. The data may come back. But there's a possibility that it would make sense to be more cautious about moving.\"\nRead more here.\nMetsera (MTSR) stock surged over 20% in premarket after Novo Nordisk (NVO,NOVO-B.CO) offered to buy the obesity-focused biotech for at least $6.5 billion.\nNovo's unsolicited offer of $56.50 a share aims to trump Pfizer's (PFE) agreed takeover of Metsera, aimed at cementing its place in the weight-loss market.\nThe Danish maker of Wegovy and Ozempicsaidit could hike the buying price by another $21.25 a share, if Metsera meets certain milestones.\nShares of Novo fell about 3% in New York before the bell, while Pfizer stock was little changed.\nBloomberg reported:\nRead more here.\nEconomic data:Initial jobless claims (week ended October 25); Continuing claims (week ended October 18); Personal consumption (third quarter); GDP annualized (third quarter)\nEarnings calendar:Apple (AAPL),Amazon(AMZN),Eli Lilly(LLY), Mastercard (MA),Merck & Co.(MRK), Shell (SHEL), Gilead Sciences (GILD), S&P Global (SPGI), Stryker Corporation (SYK), TotalEnergies (TTE), Anheuser-Busch InBev (BUD),Comcast(CMCSA), Southern Company (SO), Intercontinental Exchange (ICE),Roblox(RBLX), Bristol Myers Squibb (BMY), Coinbase Global (COIN), Strategy (MSTR), The Cigna Group (CI), Cloudflare (NET), Motorola (MSI), Cheniere Energy (LNG), Reddit (RDDT), The Hershey Company (HSY),Estée Lauder(EL), Restaurant Brands International (QSR), Blue Owl Capital (OWL), Fox Corporation (FOX), The Carlyle Group (CG), Zillow (Z), GoDaddy (GDDY)\nHere are some of the biggest stories you may have missed overnight and early this morning:\nWhat the Trump-Xi deal means for stability and markets\nUS and China declare 1-year trade truce after Trump-Xi talks\nTrump: Nvidia chip talks with Xi didn't cover Blackwell\nPowell challenges the market's idea of a Fed on autopilot\nEarnings: Meta, Microsoft slide as Alphabet rises\nOpenAI preps for juggernaut IPO at up to $1 trillion valuation\nNovo bids $6.5B for Metsera, gatecrashing Pfizer's deal\nTrump orders nuclear weapons trials after Russia tests\nEli Lilly (LLY) stock rose 5% on Thursday before the bell after raising its full-year profit and revenue forecast as strong appetite for its widely popular weight-loss and diabetes drugs Zepbound and Mounjaro helped it beat third-quarter earnings estimates.\nReuters reports:\nRead more here.\nGoogle parent Alphabet (GOOG,GOOGL)stock rose 7% in premarket trading on Thursday after reporting third quarter revenue and earnings on Wednesday thatsurpassedWall Street's expectations following aslewofAI dealsinvolving its cloud segment.\nEstee Lauder (EL)stock rose 5% before the bell on Thursday afterbeatingWall Street estimates for first-quarter sales in a sign that CEO Stephane de La Faverie's turnaround push was beginning to take hold, sending its shares up about 5% in premarket trading.\nHanwha Ocean Co. (042660.KS)stock rose 6% on Thursday after the US and Chinaagreed to endits tit-for-tat port fees on on vessels linked to the other for one year.\nThe slide in Chipotle (CMG) shares is accelerating in premarket, after the burrito chain on Wednesday cut its guidance on full-year sales once again. Traffic to its outlets is falling as customers grapple with the cost of living.\nYahoo Finance'sBrooke DiPalmareports:\nRead more here.\nMicrosoft (MSFT) stock is getting hit premarket after it reported slightly lower than expected Azure sales.\nThe results for its Azure cloud platform were still strong. Analysts at Citi made a good point in a note this morning, calling out Datadog (DDOG), JFrog (FROG), MongoDB (MDB), and Elastic (ESTC):\n\"We believe the solid Azure results bode well for other consumption-based companies set to report in coming weeks/months (DDOG, FROG, SNOW, MDB, ESTC).\"\nPresident Donald Trump addressed reporters, discussing the main points of interest from the long-awaited 90-minute trade talk between him and Chinese President Xi Jinping.\nReuters reports:\nRead more here.\nStellantis (STLA,STLAM.MI) reported a 13% year-on-year increase in revenue in its third quarter earnings on Thursday. The automaker's US-listed shares fell over 4% before the bell.\nReuters reports:\nRead more here.\nReuters reports\nRead more here.",
        "tags": [
            "ES",
            "GSPC",
            "IXIC",
            "NQ",
            "YM"
        ],
        "article_link_hash": "e681b5c1db1c77fa17ce54a6910edcd22aca13fe7a199645241699019e100201"
    },
    {
        "title": "Novo and Pfizer Square Off Over Metsera in Obesity-Drug Tussle",
        "author": "Josh Sisco, Ryan Gould, Aaron Kirchfeld and Dinesh Nair",
        "published_time_utc": "2025-10-30T12:11:41.000Z",
        "article_link": "https://finance.yahoo.com/news/novo-nordisk-offers-6-5-103104241.html",
        "full_content": "(Bloomberg) --Novo Nordisk A/S made an unsolicited bid for US drugmaker Metsera Inc., sparking a heated battle with Pfizer Inc. to get their hands on a weight-loss drug that both want in order to regain lost ground in the booming market.\nNovo offered to buy the company, Metsera Inc., for at least $6.5 billion, seeking to trump an earlier agreed deal with Pfizer. Metsera called the new offer superior to the previous one from Pfizer, which it had accepted last month.\nMost Read from Bloomberg\nThe Quest for a Cheaper E-Bike\nNew York City’s Transit Chief Is Trying to Keep the Trains Running\nDallas Debuts $2.1 Billion Rail Line Linking Suburbs to Airport\nNYC’s Metro-North Extension to Penn Station Delayed Three Years\nAmtrak to Study Limited Metro-North Service Into Penn Station\nPfizer countered that Novo’s attempt to derail the deal is “reckless” and an attempt to abuse its dominant market position. The move is an effort “to suppress competition in violation of law by taking over an emerging American challenger,” Pfizer said in a statement.\nThe tussle follows setbacks for both Novo and Pfizer in an obesity market that’s expected to reach $100 billion by 2030, where Eli Lilly & Co. has stolen a march on both companies. That has prompted large drugmakers to snap up smaller companies like Metsera, which is developing a handful of experimental weight-loss drugs, including a shot that could be taken less often than Novo Nordisk’s Wegovy.\nNovo Shakeup\nThe jockeying follows a shakeup at the top of Novo, where new Chief Executive Officer Maziar Mike Doustdar has announced thousands of job cuts, struck a $5 billion deal for liver disease drugmaker Akero Therapeutics Inc. and said the company needs to execute better on everything it does. The company has also replaced its chairman.\n“Novo Nordisk is flexing its muscles,” Per Hansen, an investment economist at Nordnet AB, said by email. “They’re going all in on expanding their pipeline. The consequence is that they’re committing a significant portion of their financial leeway.”\nIf the Danish company reaches a deal for Metsera, it would be a blow for Pfizer’s efforts to rebuild in the aftermath of the pandemic. Demand for Pfizer’s Covid vaccine has fallen sharply, and some of the company’s key drugs are also nearing the end of their patent life. The US pharmaceutical group did have its own obesity pill in development, but it flopped after one patient in a clinical trial developed signs of liver injury.\nBloomberg News reported earlier that Novo Nordisk had come back with a sweetened offer for Metsera by improving the value and structure of its proposal. Novo offered to acquire Metsera for $56.50 per share in cash upfront, it said in a statement Thursday. The purchase price may increase to as much as $77.75 per share if certain targets are met. This is 11% higher than Pfizer’s maximum value bid of $70 per share.\nFour Days\nMetsera said Pfizer now has four days in which it has the right to negotiate changes to the original proposal. If Metsera then decides Novo’s offer remains better, it would have the right to terminate the Pfizer agreement, according to a statement.\nShares of Novo Nordisk fell as much as 3.4% in Copenhagen trading.\nNovo Nordisk’s offer is structured unusually, with a cash consideration to be paid at signing in exchange for non-voting preferred stock representing 50% of Metsera’s share capital. The contingent value rights for the future milestone payments would be issued upon closing of the deal in exchange for the remaining stock.\nShares of Metsera have nearly tripled this year to $52.21, giving the company a market value of about $5.5 billion at Wednesday’s close. The stock jumped as much as 21% in pre-market New York trading Thursday, while Pfizer was little changed.\n--With assistance from Vinicy Chan, Ashleigh Furlong, Sara Sjolin, Deirdre Hipwell, Sanne Wass, Madison Muller, David Carnevali and Lisa Pham.\n(Updates with Metsera comment in third paragraph)\nMost Read from Bloomberg Businessweek\nThe Popular 3D-Printed Gun Globalizing the Second Amendment\nOnitsuka Tiger Sneakers Are Winning Gen Z’s Heart\nHow to Solve the US Farmworker Shortage, According to Congress\nAllow Zohran Mamdani to Reintroduce Himself\nOld Drugs Usually Go Way Down in Price. Here’s Why This One Skyrocketed\n©2025 Bloomberg L.P.",
        "tags": [
            "B.CO",
            "MTSR",
            "NOVO",
            "PFE"
        ],
        "article_link_hash": "4962cf90915e7ff55b70bb8ea0edb6882d1a685e9166b60397ef52d6716e419d"
    },
    {
        "title": "Trump Says Nvidia Chip Talks With Xi Didn’t Cover Blackwell",
        "author": "Mackenzie Hawkins",
        "published_time_utc": "2025-10-30T07:44:46.000Z",
        "article_link": "https://finance.yahoo.com/news/trump-says-nvidia-chip-talks-074446871.html",
        "full_content": "(Bloomberg) --US President Donald Trump said he didn’t discuss approving sales of Nvidia Corp.’s Blackwell chips to China with his counterpart Xi Jinping, dampening speculation that Washington will allow exports of the powerful AI accelerators to the world’s largest semiconductor market.\nTrump said he and Xi talked about Nvidia’s access to China in general and that the chipmaker would continue conversations with Beijing, which has discouraged domestic firms from using less-advanced Nvidia processors that Washington already approved for sale. “We did discuss chips,” Trump told reporters aboard Air Force One. “They’re going to be talking to Nvidia and others about taking chips.”\nMost Read from Bloomberg\nThe Quest for a Cheaper E-Bike\nNew York City’s Transit Chief Is Trying to Keep the Trains Running\nDallas Debuts $2.1 Billion Rail Line Linking Suburbs to Airport\nNYC’s Metro-North Extension to Penn Station Delayed Three Years\nAmtrak to Study Limited Metro-North Service Into Penn Station\nAsked specifically whether the US would authorize exports of downgraded Blackwell accelerators, a possibility Trump first suggested months ago, the US president said “we’re not talking about the Blackwell.”\nTrump’s comments came just a day after he said he’d discuss Nvidia’s Blackwell lineup with Xi, as part of broader talks aimed at a sweeping trade deal between the world’s two largest economies. Those earlier remarks triggered hope among investors — and fear among many China hawks — that Washington would green-light sales of better American AI chips than China’s ever been able to access. That helped drive a rally that made Nvidia the first company to hit a $5 trillion value.\nChina is the biggest market for semiconductors, and Nvidia’s products are the industrial standard for training and running large-language models like OpenAI’s ChatGPT. The Blackwell family of chips is Nvidia’s top offering, with capabilities that far exceed those of processors the US effectively banned from sale to China in 2022. Policymakers under Trump and his predecessor have several times escalated those controls, imposed over concerns that advanced AI could lend Beijing a military edge.\nNvidia Chief Executive Officer Jensen Huang has lobbied aggressively against the US restrictions, which he says will only aid the rise of Chinese chip champions like Huawei Technologies Co. Shipping Blackwell chips to China would have marked a major win for the tech chief, a significant concession to Beijing, and a dramatic departure from the Trump administration’s own stated approach to tech competition with the Asian country.\nHuang’s already notched several wins under the Trump administration, for exports to China and elsewhere. Over the summer, American authorities issued licenses for shipments of Nvidia’s H20 processors, deliberately downgraded hardware that Trump’s team had restricted from sale to the Asian country just months prior.\nBut Beijing, which has repeatedly asked in trade talks for the US to abandon its export controls, has strongly discouraged companies and agencies from using those accelerators. Chinese authorities, who’ve long pushed domestic firms to use homegrown AI hardware, cited security concerns with Nvidia accelerators that the chipmaker has tried to assuage.\n“The president has licensed us to ship to China, but China has blocked us from being able to ship to China,” Huang told reporters this week at a company event in Washington. “They’ve made it very clear that they don’t want Nvidia to be there right now.”\nTrump’s Thursday comments signal an effort to clear that blockade, which has captured not just H20 chips but also another Nvidia semiconductor that can be used for AI applications. “I said that’s really between you and Nvidia,” Trump said Thursday, referring to his conversation with Xi on the sidelines of the Asia Pacific Economic Cooperation summit in South Korea. “But we’re sort of the arbitrator or the referee.”\nThe rules of the road, though, are still unclear. Weeks after Trump officials said they’d issue the H20 permits, the president said the US will also be taking a 15% cut from Nvidia’s resulting revenue — an unprecedented arrangement for which officials have yet to establish a legal framework.\nIt’s also unclear how many H20 chips the US administration has approved, or plans to approve, for sale — a question with significant bearing on the economic opportunity for Nvidia, which wrote down billions of dollars in revenue after the initial H20 curbs and no longer includes China sales in its financial forecasts.\nTrump’s discussions with Xi, he said, concerned “a lot of the chips. And that’s good for us.”\nNvidia argues that exports to China would boost the American tech ecosystem at Huawei’s expense, limiting the Chinese tech giant’s access to revenue and know-how that would help it compete on the global stage. While that line of reasoning has taken hold with some US officials like White House AI czar David Sacks, many others worry that adding to the Asian country’s overall computing capabilities poses a significant national security threat.\nThe future for Blackwell chips, meanwhile, remains to be seen. Trump said in August he’d be open to letting Nvidia sell a Blackwell chip that’s “enhanced in a negative way,” which he described at the time as taking “30% to 50% off of it.” Nvidia has not released any technical specifications for such a semiconductor, and Huang said this week that the chipmaker has not requested export permits for Blackwell processors.\n(Updates with full comments from second paragraph.)\nMost Read from Bloomberg Businessweek\nThe Popular 3D-Printed Gun Globalizing the Second Amendment\nOnitsuka Tiger Sneakers Are Winning Gen Z’s Heart\nHow to Solve the US Farmworker Shortage, According to Congress\nAllow Zohran Mamdani to Reintroduce Himself\nOld Drugs Usually Go Way Down in Price. Here’s Why This One Skyrocketed\n©2025 Bloomberg L.P.",
        "tags": [
            "NVDA",
            "OPAI",
            "PVT"
        ],
        "article_link_hash": "e7c685c36b2f4139268869a98bd4e76225bfdacbfaa49d02c65b7c92e8abd33f"
    },
    {
        "title": "Trump tariffs live updates: US, China declare truce as Trump says he had 'amazing meeting' with Xi",
        "author": "Yahoo Finance",
        "published_time_utc": "2025-10-30T11:46:25.000Z",
        "article_link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-us-china-declare-truce-as-trump-says-he-had-amazing-meeting-with-xi-162418649.html",
        "full_content": "President Trump and Chinese leader Xi Jinping finished a keenly watched 90-minute meeting to formalize a trade and tariff truce after months of chaos and confusion, putting on ice a trade war between the world's two largest economies.\nAs anticipated, the vast majority of the discussions focussed on Trump's sky-high tariffs on China alongside China's imposition of export controls on rare-earth metals.\nThe US and China agreed to a one-yeartrucein a bid to reduce escalating trade tensions, with both sides pausing tit-for-tat port fees on vessels linked to the other for 12 months. Xi also said China wouldstop exportrestrictions on rare earths materials for one year.\nIn a 15-minute Q&A, Trump addressed reporters prior to boarding Air Force One and leaving South Korea, calling the summit an \"amazing meeting.\" Here are the main points raised:\nThe US tariff on goods related to the production of fentanyl will drop from 20% to 10% with a promise China would work \"very hard to stop the flow.\"\nTrump said overall tariffs on China will now be cut to 47% from 57%.\nTrump declared any concerns over rare earths to be \"settled.\"\nThe US will mediate talks between Beijing and Nvidia's (NVDA) CEO Jensen Huang over China's use of restricted chips.\nTrump said China wouldpurchasemore US energy as part of a wider trade truce, and hinted at an unspecified transaction involving Alaskan oil and gas.\nChina will resume buying \"tremendous amounts\" of US soybeans \"starting immediately,\" Trump said.\nDespite questions about the truce's ultimate durability, the moment represents a milestone for the US and China after Trump amped up trade threats against China almost immediately upon returning to office, rattling markets and unnerving investors.\nRead more:What Trump's tariffs mean for the economy and your wallet\nTrump said the US and South Korea had reached a deal after months of negotiating on a framework agreement. Also, Trump and Japan's first female leader, Sanae Takaichi,signeddeals relating to trade and rare earths.\nA spat over an ad featuring the late Ronald Reagan has grown into an international incident, with Trump threatening to raise tariffs on Canada by an additional 10%. Trump said he is stopping all negotiations with Canada.\nThe US Senate passed a bill that aims to end Trump's 50% tariffs on Brazil, in a rare rebuke of the president from several members of his own party.\nThe US and India are making progress on a trade deal which could see tariffs on New Delhicutto 15%-16% from their current 50% level,accordingto a report.\nIn early November, the US Supreme Court is set to hear a challenge to Trump's most sweeping tariffs — the \"reciprocal\" country-by-country duties that you can see in the graphic above. A ruling against the tariffs — which would be in line with lower-court decisions — could have significantramifications for Trump's tariff strategy.\nThe highly-anticipated meeting between President Trump and Xi Jinping, which was wrapped up in around 90 minutes, covered various topics in the hopes of preventing any further trade tensions between the world's largest economies.\nHere is a list of some of the issues discussed, the outcomes, and what it could mean for both sides:\nFentanyl tariffs: The US tariff on goods related to the production of fentanyl will drop from 20% to 10% with a promise that China would work \"very hard to stop the flow.\" This brought overall tariffs on China down to 47% from 57%.\nRare earths:Chinapausedplans for a dramatic expansion of its rare-earth export controls, offering relief to global buyers after a tumultuous year and handing major economies more time to counter Beijing’s grip on the industry.\nPort fees:The US and China haveagreed to suspendtit-for-tat shipping levies on vessels linked to each other for one year, according to Beijing, de-escalating a dispute that has become a sticking point in their wider trade war.\nSoybeans:Trump said China will purchase “tremendous” amounts of American soybeans. He did not provide further details.\nNvidia (NVDA) and Blackwell chips:Trump said hedidn’t discussapproving sales of Nvidia's Blackwell chips to China, dampening speculation that Washington will allow exports of the powerful AI accelerators to the world’s largest semiconductor market. “We did discuss chips,” Trump told reporters aboard Air Force One. “They’re going to be talking to Nvidia and others about taking chips.”\nRead more here.\nBloomberg News:\nRead more here.\nPresident Trump said that he did not get to discuss Nvidia's (NVDA) Blackwell AI chips during his high-stakes meeting with China's President Xi Jinping on Thursday, adding to speculation as to whether Washington will allow exports of the powerful AI accelerators to the world's largest semiconductor market.\nTrump said he and Xi discussed the general access of Nvidia to China and that the chipmaker would continue to have talks with Beijing, which has discouraged its domestic firms from using less-advanced Nvidia processors that Washington already approved for sale.\nBloomberg News reports:\nRead more here.\nPresident Trump addressed reporters on his way out of South Korea, discussing the main points of interest from the long-awaited 90-minute trade talk between Trump and Chinese President Xi Jinping.\nReuters reports:\nRead more here.\nBloomberg reports:\nRead more here.\nPresident Trump's tariffs are set to raise operating costs and harm supply chains for the oil and gas industry, according to a report published by Deloitte on Wednesday.\nReuters reports:\nRead more here.\nThe ongoing federal shutdown has already cost the US economy between $7 billion and $14 billion, according to a new report from the nonpartisan Congressional Budget Office (CBO).\nReuters reports\nRead more here\nCOFCO, a Chinese state-owned food company, bought three US soybean cargoes, according to people familiar with the matter. These will be the first purchases from this year's harvest and ahead of the summit between President Trump and Xi Jinping.\nReuters reports:\nRead more here.\nBank of Canada (BoC) governor Tiff Macklem stated on Wednesday that the impacts of US tariffs are becoming more evident and have weakened the Canadian economy.\n\"The US trade conflict has diminished Canada’s economic prospects,\" Macklem said in the opening statement of the central bank's policy announcement.\nThe slightly more hawkish tone from the BoC came after the central bank cut interest rates by 25 basis points. Macklem also stated that the \"structural damage caused by tariffs\" is limiting the ability of monetary policy to boost demand while maintaining low inflation.\n\"Canadian businesses and households are feeling the consequences of increased US protectionism,\" Macklem continued. \"It is difficult, and ongoing uncertainty is compounding the difficulty. For many months, we have been stressing that monetary policy cannot undo the damage caused by tariffs. Increased trade friction with the United States means our economy will work less efficiently, with higher costs and less income. Monetary policy can help the economy adjust as long as inflation is well-controlled, but it cannot restore the economy to its pre-tariff path.\"\nRead more here.\nMining and construction machinery maker Caterpillar (CAT) expects to see a greater impact from tariffs this year than it previously forecast.\nIn the company's third quarter earnings presentation, Caterpillar noted a full-year net impact from tariffs of between $1.6 billion and $1.75 billion. Previously, the company guided for a tariff hit of $1.3 billion to $1.5 billion.\nCEO Joseph Creed said the company is evaluating long-term options to manage the tariffs. But the constant shifting of duties is making it difficult to determine where to allocate investments, he explained.\n\"If we're going to make longer-term adjustments to really offset tariffs in that way, it will require investments to do that, and that will take time,\" Creed said on the company's earnings call. \"Because we'll have to certify components, we have to buy tooling, we have to validate them, and test them.\"\n\"For us to make those types of decisions, we really need to have a greater level of predictability and stability in the situation,\" he continued. \"It's just right now, if we do something that requires investment, I don't want to have to spend that money and then turn around and spend money to reverse it. So we're trying to take a measured approach.\"\nFrom Bloomberg:\nRead more here.\nThe FT reports:\nRead more here.\nMarkets have been boosted this week by the Trump administration's comments on what they describe as a framework for a trade deal with China. However, Beijing has not said much in response, and very little is known about what President Xi Jinping may want in return.\nYahoo Finance's Washington CorrespondentBen Werschkullooks at the upcoming meeting between Trump and Xi and what may be at stake for both sides.\nRead more here.\nPresident Trump told reporters on Wednesday that he hopes to lower tariffs imposed on Chinese goods over the fentanyl crisis and wants to speak to China's President Xi Jinping about Nvidia's (NVDA) flagship Blackwell AI chip, as the leaders prepare to meet on Thursday for a high-stakes summit.\nTrump made the remarks while en route to South Korea for the final leg of his tour of Asia.\nOnce in Gyeongju, South Korea, Trump held a meeting and said that he expects to finalize a \"great deal.\"\n\"We're going to be, I hope, making a deal. I think we're going to have a deal. I think it will be a good deal for both,\" the president said.\nBloomberg News reports:\nRead more here.\nOntario Premier Doug Ford, who was behind the controversial ad that featured former President Ronald Reagan criticizing tariffs, has come out to add context around the ad's focus. He also went on to call it a success despite any difficulties it may have added to trade talks between the US and Canada\nBloomberg reports:\nRead more here.\nThe stage is set for the summit between President Trump and China's Xi Jinping this week, and both Washington and Beijing have lined up a series of diplomatic wins to help both leaders shine. Some of this has pleased investors, but deeper conflicts remain unresolved.\nBloomberg News reports:\nRead more here.\nIndian Prime Minister Narendra Modi reportedly opted out of attending a regional leaders' summit to avoid being questioned about relations with Pakistan. Sources close to the matter claim that he was specifically keeping his distance from President Donald Trump.\nBloomberg reports:\nRead more here.\nPresident Trump's tour of Asia has been a lucrative one and helped him secure trade deals with some major trading partners. The White House has called them \"historic\", despite some question marks remaining over the validity of the agreements.\nBut the pacts have granted Trump some wins, with many thinking he may have gained an advantage over his allies.\nBloomberg News reports:\nRead more here.\nPresident Trump did not hold back on his praise for Japan's first female leader, Sanae Takaichi, as the two leaders signed a trade deal and other agreements. Trump promised Takaichi that the US would be there to help should Tokyo need anything.\nTrump met with Takaichi as part of his tour of Asia and ahead of his meeting with China's President Xi Jinping on Thursday.\nThe meeting between Washington and Tokyo focused on trade but also diplomacy as the two sides seek to reaffirm ties and rebuild relations, which went sour after Trump announced his \"Liberation Day\" tariffs back in April.\nBloomberg News reports:\nRead more here.\nPresident Trump met with Japan's first female leader, Sanae Takaichi, on Tuesday as part of his Asia tour. The US president reaffirmed ties with his country's longstanding partner, signing deals on trade and rare earths.\nTrump praised Prime Minister Takaichi, saying, \"We are an ally at the strongest level.\"\nAccording to Trump's spokeswoman, Karoline Leavitt, Takaichi applauded Trump's push to resolve global conflicts and promised to nominate the US leader for the Nobel Peace Prize.\nJapan and the US released a series of projects around energy, artificial intelligence and critical minerals, with Japan eyeing investments of up to $400 billion.\nReuters reports:\nRead more here.",
        "tags": [
            "NVDA"
        ],
        "article_link_hash": "c48cbc1f3cde4e5fca8465217d3e6d46a24a802f2224a39832c1311d0c84cfdc"
    }
]