{
    "title": "Tech analyst Dan Ives flags 10 stocks to own, insists there's no AI bubble",
    "url": "https://finance.yahoo.com/news/tech-analyst-dan-ives-flags-10-stocks-to-own-insists-theres-no-ai-bubble-180237596.html",
    "date": "2025-11-27T06:32:55.000Z",
    "author": "Francisco Velasquez",
    "source": "finance.yahoo.com",
    "content_snippet": "AI stocks aren't in a bubble — they're just getting started.\nThat's the message from Wedbush analyst Dan Ives, who argues that investors are misreading one of the most significant technology build-out...",
    "full_content": "AI stocks aren't in a bubble — they're just getting started.\nThat's the message from Wedbush analyst Dan Ives, who argues that investors are misreading one of the most significant technology build-outs since the dawn of the internet.\n\"[It's] still very early in this AI revolution,\" Ives told Yahoo Finance'sOpening Bid. \"Only 3% of companies in the US have gone down the AI path. Globally, it's less than 1%.\"\nIn other words, the hype may be loud, but adoption isn't anywhere close to late-cycle froth.\nThat forms the premise of Ives' new report, which argues that enterprise spending, government demand, and chip shortages — not speculation — are driving valuations.\nIves has covered tech since the dot-com era and said comparisons to 1999 miss the facts. Back then, the average tech stock traded at 30 times revenue with little more than slide decks and unproven business models.\nToday, the largest players are generating hundreds of billions of dollars in cash, with real infrastructure and customers. Demand for Nvidia (NVDA) chips far exceeds supply, he noted.\nTo Ives, that imbalance isn't a sign of mania — it's proof the industry hasn't come close to meeting demand. Nvidia currently supplies companies like Amazon (AMZN), Google (GOOGL,GOOG), and Microsoft (MSFT) — all top contenders in the AI arms race.\nIves' top picks are companies he believes are structurally indispensable to the AI economy. They span across chips, hyperscalers, consumer devices, cybersecurity, and autonomous technology.\nMicrosoft: Most likely to profit as businesses adopt AI tools.\nPalantir(PLTR): The go-to software for governments and corporations seeking AI.\nNvidia: The chipmaker powering nearly every major AI project.\nAdvanced Micro Devices(AMD): Nvidia's biggest challenger, set to grab more market share as demand explodes.\nTesla(TSLA): Its future growth hinges on robotaxis and autonomous AI.\nApple(AAPL): Whatever consumer AI becomes, Apple's devices and ecosystem will deliver it.\nMeta(META): Early bets on AI are starting to pay off as the company figures out how to monetize the tech.\nAlphabet: Its Gemini model and internal chips put the company at the front of the AI race alongside Nvidia.\nCrowdStrike(CRWD): AI-powered cybersecurity that businesses increasingly can't live without.\nPalo Alto Networks(PANW): Uses AI to tie security products together — a formula that drives growth.\nNotably absent: Amazon, Salesforce (CRM), IBM (IBM), and Intel (INTC).\nThese are not bearish calls. Ives still included them in his broader \"AI 30\" universe, meaning he sees upside in their future. But they lack what he considers true category-defining leverage in AI innovation. Their positioning is supportive, not foundational.\nIves expects AI-driven capital expenditures to hit between $550 billion and $600 billion by 2026, with additional waves of spending coming from governments and enterprise buyers. Less than 5% of US companies have deployed AI in a meaningful way, he said.\nIf anything, Ives said investors are still underestimating what comes next.\n\"It was 9 p.m. It's now 10:30 p.m. in the AI party that goes to 4 a.m., and the bears watch the party through the windows from the outside,\" Ives said.\nFrancisco Velasquezis a Reporter at Yahoo Finance. Follow him onLinkedIn,X, andInstagram. Story tips? Email him at francisco.velasquez@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "AMD",
        "CRWD",
        "MSFT",
        "NVDA",
        "PCT:1",
        "PCT:3",
        "PCT:5",
        "PLTR"
    ]
}