{
    "title": "Global Stocks Hold Steady After Four-Day Rally: Markets Wrap",
    "url": "https://finance.yahoo.com/news/stocks-near-erasing-november-losses-065543367.html",
    "date": "2025-11-27T13:02:36.000Z",
    "author": "Andre Janse van Vuuren and Sagarika Jaisinghani",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --A gauge of global equities held firm after four days of gains, following a recovery fueled by bets that the Federal Reserve will cut interest rates faster than previously thought.\nThe MS...",
    "full_content": "(Bloomberg) --A gauge of global equities held firm after four days of gains, following a recovery fueled by bets that the Federal Reserve will cut interest rates faster than previously thought.\nThe MSCI All Country World Index was little changed after trimming its drop for November to 0.4% in the prior sessions. The gauge had been down nearly 4% for the month just over a week ago. European and Asian benchmarks posted modest moves, with US markets closed for Thanksgiving. S&P 500 futures were steady.\nMost Read from Bloomberg\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nDespite Star Architect’s Alleged Misconduct, New Harlem and Princeton Museums Shine\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nIn another sign that risk appetite is returning, Bitcoin traded above $91,000 for the first time in a week. Gold fluctuated and the dollar paused a two-day retreat.\nThe moves in stocks tracked firming expectations for Fed easing, with money markets pricing in roughly an 80% chance of a quarter-point cut next month and leaning toward three more by the end of 2026. A little more than a week ago, traders were projecting three cuts in total. It also signals fresh optimism after worries over stretched tech valuations hammered equities earlier in the month.\n“We’re building up for a classic year-end rally,” said Daniel Murray, chief executive officer of EFG Asset Management Switzerland. “Our main scenario is one where actually the macro environment continues to hold up well into 2026, the corporate earnings outlook looks pretty decent and you get the added tailwind of the lagged effect of rate cuts.”\nAmong the more notable movers on Thursday, Japanese and South Korean equities outperformed their regional peers, with tech shares leading gains in both markets. In Europe, Germany’s DAX index rose 0.3% as Puma SE jumped 13% on takeover interest from multiple bidders.\nUK gilts gave back some of Wednesday’s rally that followed the Autumn budget. Chancellor of the Exchequer Rachel Reeves carved out a larger fiscal buffer, which buoyed sentiment, even though the tax-raising steps required cast a shadow over the outlook for economic growth. The pound and FTSE 100 were little changed.\n“All told, we think the UK government did what it needed to do to keep UK bond markets on side,” wrote Bill Diviney, head of macro research at ABN AMRO. “While there is naturally some risk to this more backloaded fiscal consolidation round, it comes on top of an already considerable effort.”\nOil prices edged higher as investors assessed the next steps in US-led diplomatic efforts to end the war in Ukraine. Platinum touched its highest level in more than a month, supported by optimism over fresh demand after a Chinese exchange launched a new futures contract.\nWhat Bloomberg Strategists Say...\n“Upcoming commentary from the BOE will likely set markets up for a cut next month or at least not stand in the way of it. Thereafter, given the credibility hit the BOE faced in taming rising inflation, it’s likely to stay cautious until data warrants a more neutral policy stance. Some rate-cut bets for 2026 may fade, which could cap upside in gilts.”\n— Adam Linton, macro strategist. For full analysis, click here.\nCorporate News:\nChina Vanke Co. was rejected by at least two big local banks as it tried to secure a short-term loan to quell the default fears that have fueled a plunge in its bonds this week, according to people familiar with the matter.\nChinese sports apparel company Anta Sports Products Ltd. is among firms exploring a potential takeover of Puma SE, according to people familiar with the matter.\nJPMorgan Chase plans to build a new three-million square feet tower in London that would serve as its principal UK headquarters and could contribute about $13 billion to the local economy over six years, it said in a statement.\nA gauge of risk on Oracle Corp.’s debt reached a three-year high in November, and things are only going to get worse in 2026 unless the database giant is able to assuage investor anxiety about a massive AI spending spree, according to Morgan Stanley.\nSoftBank Group Corp.’s credit-default swaps climbed to the highest level since April, as investors turned cautious on the tech behemoth’s debt-fueled growth at a time of intensifying global competition.\nSome of the main moves in markets:\nStocks\nThe Stoxx Europe 600 was little changed as of 11:33 a.m. London time\nS&P 500 futures were little changed\nNasdaq 100 futures were little changed\nFutures on the Dow Jones Industrial Average were little changed\nThe MSCI Asia Pacific Index rose 0.2%\nThe MSCI Emerging Markets Index was little changed\nCurrencies\nThe Bloomberg Dollar Spot Index was little changed\nThe euro fell 0.1% to $1.1582\nThe Japanese yen rose 0.1% to 156.28 per dollar\nThe offshore yuan fell 0.2% to 7.0811 per dollar\nThe British pound fell 0.1% to $1.3226\nCryptocurrencies\nBitcoin rose 1.4% to $91,422.68\nEther rose 0.2% to $3,028.26\nBonds\nThe yield on 10-year Treasuries was little changed at 3.99%\nGermany’s 10-year yield advanced one basis point to 2.68%\nBritain’s 10-year yield advanced five basis points to 4.47%\nCommodities\nBrent crude rose 0.2% to $63.25 a barrel\nSpot gold was little changed\nThis story was produced with the assistance of Bloomberg Automation.\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "ACR:Fed",
        "ACR:S&P",
        "BTC",
        "DX",
        "ES",
        "F",
        "GC",
        "GSPC",
        "NYB",
        "PCT:0.1",
        "PCT:0.2",
        "PCT:0.3",
        "PCT:0.4",
        "PCT:1.4",
        "PCT:13",
        "PCT:2.68",
        "PCT:3.99",
        "PCT:4",
        "PCT:4.47",
        "PCT:80",
        "USD",
        "USD:$3,028.26",
        "USD:$63.25",
        "USD:$91,422.68",
        "Y"
    ]
}