{
    "title": "Gold Extends Gains on US Fiscal Concerns, Rate-Cut Expectations",
    "url": "https://finance.yahoo.com/news/gold-extends-gains-us-fiscal-032826658.html",
    "date": "2025-11-11T11:55:02.000Z",
    "author": "Yihui Xie",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Gold extended gains, after its biggest daily jump since May, following a deal to end the US government shutdown.\nBullion rose to around $4,140 an ounce, having surged 2.9% in the previou...",
    "full_content": "(Bloomberg) --Gold extended gains, after its biggest daily jump since May, following a deal to end the US government shutdown.\nBullion rose to around $4,140 an ounce, having surged 2.9% in the previous session. A bipartisan agreement supported by President Donald Trump could end the shutdown as soon as Wednesday. The development should give traders more clarity on how quickly the Federal Reserve will move to lower interest rates.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nA restart would see the release of long-delayed economic data, providing a crucial temperature check for the US economy. The figures are expected to show a worsening outlook, a potential catalyst for looser monetary policy that could give tailwind to gold, which doesn’t pay interest. Copper futures on the London Metal Exchange also ticked higher.\nBullion’s haven appeal was also reinforced by the economic risk inherent in US plans to pay a so-called tariff dividend. Trump’s suggestion on Sunday that citizens could be mailed a check for “at least $2,000 a person” marks a throwback to Covid-era stimulus checks, which critics said contributed to the 2021 to 2022 inflation surge. Higher inflation and currency debasement can be seen as a positive for gold, which becomes a better store of value.\n“Markets could be digesting President Trump’s post referring to $2K stimulus checks,” Daniel Ghali, a strategist at TD Securities, said in a note. While observing that US Treasury Security Scott Bessent had downplayed this theme, he added: “Many are clearly eager to pull the trigger in gold markets.”\nDespite its pullback from a record high above $4,380 an ounce last month, gold remains on track for its best annual performance since 1979. Its ferocious rally — the metal has gained more than 55% this year — is based on several factors, including elevated central-bank buying and greater inflows to exchange-traded funds.\nGeopolitical risk and the so-called debasement trade, whereby investors pull away from sovereign debt and currencies to protect themselves from runaway budget deficits, have also underpinned the rally. Many banks remain positive on the outlook for the metal: Goldman Sachs Group Inc., for example, expects it to reach $4,900 by the final quarter of 2026.\n“The medium-term drivers that underpin gold’s constructive bias remain intact,” said Christopher Wong, a strategist at Oversea-Chinese Banking Corp. He added the US Federal Reserve was expected to continue easing policy into 2026, with interest rates likely to trend lower.\nOne note of caution is the lack of consensus among Fed governors on the next course of action. While Federal Reserve Bank of San Francisco President Mary Daly warned against keeping rates too high for too long, her counterpart for St. Louis, Alberto Musalem, underscored the need to approach additional cuts with caution, as he expects the economy to rebound in the first quarter of 2026.\nGold was up 0.6% at $4,139.46 an ounce as of 10:41 a.m. London time. The Bloomberg Dollar Spot Index was up 0.1%. Silver, platinum and palladium all gained.\n--With assistance from Jack Ryan.\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\nThe UAE Is Winning the Race to Sequence an Entire Country’s DNA\n©2025 Bloomberg L.P.",
    "tags": [
        "ACR:Fed",
        "F",
        "GC",
        "HG",
        "PCT:0.1",
        "PCT:0.6",
        "PCT:2.9",
        "PCT:55",
        "USD:$4,139.46"
    ]
}