{
    "title": "Black Friday arrives with solid momentum despite tariffs and economic uncertainty",
    "url": "https://finance.yahoo.com/news/black-friday-arrives-solid-momentum-054556629.html",
    "date": "2025-11-27T05:45:56.000Z",
    "author": "ANNE D'INNOCENZIO",
    "source": "finance.yahoo.com",
    "content_snippet": "NEW YORK (AP) —Black Fridaymay no longer be the retail bacchanalia of years past, when the promise of one-time bargains caused people to leave Thanksgiving tables for malls where some customers got in...",
    "full_content": "NEW YORK (AP) —Black Fridaymay no longer be the retail bacchanalia of years past, when the promise of one-time bargains caused people to leave Thanksgiving tables for malls where some customers got into fistfights over toys or TVs. But the event still has enough enthusiasts to make it the biggest shopping day in the U.S.\nFor that reason, the day retains its crown as the official start of the holiday shopping season. This year's kickoff comes as companies navigate an uncertain economic environment and wrestle with the volatility ofPresident Donald Trump's wide-rangingtariffson imported goods.\nMany have absorbed some of the costs and pulled back onhiringinstead of raising prices for customers.Consumer confidencein the U.S. economy fell this month to the lowest since April — whenTrump announced his tariffs— in the aftermath of thegovernment shutdown,weak hiringand stubborn inflation, according to a report The Conference Board issued Tuesday.\nShoppers nonetheless have remained resilient and willing to spend, at least judging by the solid quarterly sales reports fromWalmart,Best Buyand other retailers. But many retail executives also say customers are focusing on deals and have been selective in what they're buying.\nAron Boxer, 50, from Greenwich, Connecticut, said he delayed buying a car this year amid worries about tariffs. He said he'll be looking for deals on toys on Cyber Monday but is also willing to wait to the end for the best discount.\n“The tariffs definitely are not behind me, and I am concerned about it,\" the founder of an educational services company and a life coaching service said. “I did consider buying earlier this year, but I feel like some people made some pretty bad business decisions anticipating tariffs to have a bigger impact than they did.”\nStill, analysts and mall executives cited solid momentum heading into Black Friday week.\n“We're seeing a very positive start to the holiday season,\" said Jill Renslow, chief business development and marketing officer at the Mall of America in Bloomington, Minnesota, which plans to give gift cards and other giveaways to the first 250 customers who show up at 7 a.m. on Friday. “The last few Saturdays in November have been very strong.”\nMall traffic heading into Black Friday surpassed the numbers from pre-pandemic 2019, Renslow said.\nA forecast from the National Retail Federation, the nation's largest retail trade group, predicted a healthy increase in holiday sales. The group estimated that shoppers would collectively spend between $1.01 trillion and $1.02 trillion in November and December, or 3.7% to 4.2% more than last year.\nRetailers rung up $976 billion in holiday sales last year, or a 4.3% increase from 2023, the group said.\nMastercard SpendingPulse, which tracks spending across all payment methods including cash, predicted a 3.6% increase in holiday sales from Nov. 1 through Dec. 24. That compares with a 4.1% increase last year.\n“Clearly, there’s uncertainty,\" Mastercard Chief Economist Michelle Meyer said. “Clearly, consumers feel on edge. But at the moment, it doesn’t seem like it’s changing how they are showing up for this season.”\nOnline sales have been strong so far. From Nov. 1 to Sunday, consumers spent $79.7 billion, according to Adobe Analytics. That represented a gain of 7.5% from a year earlier and was bigger than Adobe's 5.3% growth forecast for the season.\nTariffs have played a role in stores' merchandising and pricing strategies. Many retailers accelerated shipments of some holiday merchandise before the tariffs took effect while also absorbing some of the extra import costs. But stores still have passed on some of the expense for items like toys, which are largely sourced in China.\nMarket research firm Circana's retail tracking service examined various subcategories of general merchandise and found 40% of all general merchandise sold in September saw a price increase of at least 5% compared with the first four months of the year.\nToys, baby products, housewares, and team sports equipment were among the hardest hit. For example, 83% of toys sold in September saw an increase of at least 5%, Circana said.\nThat number was up from 32% in June and will go even higher in coming months, according to Marshal Cohen, the firm’s chief industry advisor.\nSome executives have noticed retailers advertising tamer holiday discounts. Mall of America’s Renslow said deals didn't show up at the mall as early as she anticipated. But she estimated store tenants had ramped up this week with discounts in the range of 30% to 50%. She thinks they'll likely go deeper for the weekend.\nStephen Lebovitz, CEO ofCBL Properties, which operates 85 shopping properties, also noted unimpressive holiday discounting.\n“I think one of the benefits of the tariffs or the silver lining is that the inventory levels for the retailers are leaner, and they've tried to allow themselves to keep pricing power,” he said.",
    "tags": [
        "ACR:CEO",
        "PCT:3.6",
        "PCT:3.7",
        "PCT:30",
        "PCT:32",
        "PCT:4.1",
        "PCT:4.2",
        "PCT:4.3",
        "PCT:40",
        "PCT:5",
        "PCT:5.3",
        "PCT:50",
        "PCT:7.5",
        "PCT:83",
        "USD:$1.01",
        "USD:$1.02"
    ]
}