{
    "title": "Here’s What Boosted TAT Technologies (TATT) in Q3",
    "url": "https://finance.yahoo.com/news/boosted-tat-technologies-tatt-q3-140229187.html",
    "date": "2025-11-27T14:02:29.000Z",
    "author": "Soumya Eswaran",
    "source": "finance.yahoo.com",
    "content_snippet": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & S...",
    "full_content": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & Stripes achieved a net return of +9.8%. In comparison, its long/short equity hedge fund peer group, as indicated by the HFRX Equity Hedge (Total) Index (the “HFRX”), reported a total return of +3.8%. Additionally, the long-only small-cap Russell 2000 Index (the “Russell”) had a total return of +12.4%. Year to date, the fund returned +8.6% compared to a total return of +13.6% for the HFRI and +10.4% for the Russell. The Composite’s long book delivered strong performance in both the third quarter and year-to-date 2025. The short book detracted from performance both in the third quarter and year-to-date in 2025. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its third-quarter 2025 investor letter, Prosper Stars & Stripes highlighted stocks such as TAT Technologies Ltd. (NASDAQ:TATT). TAT Technologies Ltd. (NASDAQ:TATT) provides solutions and services to the commercial and military aerospace and ground defense industries. The one-month return of TAT Technologies Ltd. (NASDAQ:TATT) was -11.81%, and its shares gained 73.27% of their value over the last 52 weeks. On November 26, 2025, TAT Technologies Ltd. (NASDAQ:TATT) stock closed at $38.24 per share, with a market capitalization of $495.232 million.\nProsper Stars & Stripes stated the following regarding TAT Technologies Ltd. (NASDAQ:TATT) in its third quarter 2025 investor letter:\n\"TAT Technologies Ltd.(NASDAQ:TATT) was the top contributor in the long book during the third quarter of 2025. As an underfollowed aerospace Original Equipment Manufacturer (“OEM”) and Maintenance, Repair, and Operations (“MRO”) service provider, TATT operates in four niche categories: thermal solutions (~41% of revenues), auxiliary power units (~27%), landing gear (~5%) and leasing & trading (~14%). We believe the landing gear segment is entering into a major MRO cycle, and TATT already has two strategic agreements in place with Embraer for their E170 and E175 aircraft and Gulfstream for their G400 and G500 business jets. We believe the most important growth segment is the auxiliary power units (“APUs”), particularly for the B737 and A320 family of aircraft and the B777. According to the company, these “platforms” have a Total Addressable Market (“TAM”) of approximately $2.5 billion, and TAT Technologies has less than 1% share today with a goal of reaching 5 to 10% share. The company’s position in the industry is supported by a license agreement with Honeywell, the OEM for the power units. Although there are a couple non-licensed APU MRO providers, TATT becomes Honeywell’s approved provider of aftermarket service and support. Recent results support our multi-year thesis on the name with Q2 2025 revenues increasing 18% year-on-year, and the backlog increasing $85m to reach $524m or roughly 3x current yearly sales. Gross margins have sequentially improved for four straight quarters and EBITDA margins reached 14% in Q2. We believe the market underestimates TATT’s multi-year growth potential. We think our $39m of FY27 EBITDA is a conservate estimate. At a reasonable 15x multiple, fair value is in the low $50s per share and we expect TATT to leverage its platform for further business wins and acquisitions that will add more value to the stock as it develops.\"\nTAT Technologies Ltd. (NASDAQ:TATT) is not on our list of30 Most Popular Stocks Among Hedge Funds. As per our database, 15 hedge fund portfolios held TAT Technologies Ltd. (NASDAQ:TATT) at the end of the second quarter, which was 9 in the previous quarter. In Q3 2025, TAT Technologies Ltd.’s (NASDAQ:TATT)revenueincreased by 14% to $46.2 million. While we acknowledge the potential of TAT Technologies Ltd. (NASDAQ:TATT) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on thebest short-term AI stock.\nInanother article, we covered TAT Technologies Ltd. (NASDAQ:TATT) and shared Prosper Stars & Stripes' views on the company in the previous quarter. In addition, please check out ourhedge fund investor letters Q3 2025page for more investor letters from hedge funds and other leading investors.\nREAD NEXT:The Best and Worst Dow Stocks for the Next 12 Monthsand10 Unstoppable Stocks That Could Double Your Money.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:EBITDA",
        "ACR:Q2",
        "ACR:Q3",
        "PCT:+10.4",
        "PCT:+12.4",
        "PCT:+13.6",
        "PCT:+3.8",
        "PCT:+8.6",
        "PCT:+9.8",
        "PCT:-11.81",
        "PCT:1",
        "PCT:10",
        "PCT:14",
        "PCT:18",
        "PCT:27",
        "PCT:41",
        "PCT:5",
        "PCT:73.27",
        "TATT",
        "USD:$38.24"
    ]
}