{
    "title": "High Coffee Prices Are Here to Stay for Longer Despite US Tariff Cuts",
    "url": "https://finance.yahoo.com/news/high-coffee-prices-stay-longer-090703105.html",
    "date": "2025-11-27T09:07:03.000Z",
    "author": "Mumbi Gitau",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) — Coffee lovers hoping for quick relief from historically high prices may have to wait longer as the expected pullback from a reduction in US tariffs has yet to materialize, according to I...",
    "full_content": "(Bloomberg) — Coffee lovers hoping for quick relief from historically high prices may have to wait longer as the expected pullback from a reduction in US tariffs has yet to materialize, according to Italian roaster Illycaffe SpA.\nMost Read from Bloomberg\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nDespite Star Architect’s Alleged Misconduct, New Harlem and Princeton Museums Shine\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nThe company, known for the high-end espresso sold in silver-and-red cans, plans to raise prices again in January after two increases this year, Chief Executive Officer Cristina Scocchia said in an interview.\nThe cost of Arabica coffee beans surged to a record last month when US tariffs on top exporter Brazil coincided with lackluster harvests across the globe. Prices have eased slightly since US President Donald Trump expanded tariff breaks for Brazilian coffee, but still remain at historically high levels.\n“There is a limit to how much a company can absorb a level of green coffee price, which is so unhealthily high,” Scocchia said, referring to the surge in unroasted bean costs. “We’ll increase the price in all the countries and in all the channels.”\nIllycaffe’s moves are likely to be matched by other roasters, because consumer prices are still catching up with the commodity costs. Any hikes in prices of coffee on grocery store shelves tend to lag by “many months” or at times even a year, according to Carlos Mera, head of agricultural commodity market research at Rabobank. He’s expecting to see more price gains in the coming months.\nIllycaffe predicts prices for unroasted beans will stabilize between $2.80 to $3 a pound within the second half of 2026, which is still above the average of the past five years.\n“We were hoping for a much more dramatic drop,” Scocchia said in a telephone interview. The coffee industry is facing a “very, very difficult” situation due to the persistently high prices of unroasted beans, which she attributed more to speculation than actual supply issues.\nThe company maintained its sourcing strategy from Brazil during the period when US tariffs were in place, as it has unique blends that require the country’s coffee. It’s now planning to enter production partnerships in the US, which accounts for 20% of its turnover.\nIllycaffe has tried to limit the impact on consumers by absorbing a significant portion of the cost increase within its margins, helping boost its sales volumes. Despite the high prices, coffee demand has remained resilient, with the company expecting the market to continue to grow at a single-digit rate.\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "PCT:20",
        "USD:$2.80"
    ]
}