{
    "title": "Alibaba Releases AI Glasses in Rare Consumer Gadget Foray",
    "url": "https://finance.yahoo.com/news/alibaba-releases-ai-glasses-rare-075710034.html",
    "date": "2025-11-27T07:57:10.000Z",
    "author": "Luz Ding and Vlad Savov",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Alibaba Group Holding Ltd. began sales of its first smart glasses powered by its Qwen AI models, marking a rare foray into consumer hardware.\nThe new Quark S1 glasses include built-in tr...",
    "full_content": "(Bloomberg) --Alibaba Group Holding Ltd. began sales of its first smart glasses powered by its Qwen AI models, marking a rare foray into consumer hardware.\nThe new Quark S1 glasses include built-in translucent displays that superimpose contextual information on the user’s view of surroundings. Equipped with cameras, bone conduction microphones and swappable batteries rated to last 24 hours, this new product aims to offer the Chinese market something along the lines of Meta Platforms Inc.’s Ray-Ban smart glasses.\nMost Read from Bloomberg\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nDespite Star Architect’s Alleged Misconduct, New Harlem and Princeton Museums Shine\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nIt marks an extension of Alibaba’s ambitious reorganization into an AI-first business. The company made a big splash with its Qwen app release last week, consolidating its various consumer AI services into a single, upgraded program that quickly attracted more than 10 million users. Chief Executive Officer Eddie Wu this week said the company has seen “exceptional user retention” with the new release. Alibaba has also integrated the Qwen suite into its Quark desktop browser and is now broadening its reach with the Quark wearables lineup.\nAlongside the S1, which starts at 3,799 yuan ($537), Alibaba will offer a 1,899-yuan Quark G1 model that eschews the micro-OLED displays. Both are powered by Qualcomm Inc.’s Snapdragon AR1 platform, a chip designed specifically for augmented-reality glasses that includes neural processing units for AI tasks.\nThe S1 is available to buy immediately from Alibaba’s Tmall, JD.com, ByteDance Ltd.’s Douyin and more than 600 stores across 82 cities in China. International versions will come next year, with some available via platforms like AliExpress, according to a spokesperson from Alibaba’s Quark unit.\nSmart glasses, particularly ones touting artificial intelligence capabilities like transcription, have proliferated in China over the past year. Many so far have come from startups like Even Realities, which aim at augmenting conventional glasses rather than reinventing them. Market tracker IDC saw 1.6 million shipments of smart glasses in China in the year to September, with Xiaomi Corp. claiming roughly a third. That figure rises past 2 million units once glasses with built-in displays are included.\n“Alibaba’s entry will undoubtedly bring new dynamics to the competitive landscape of China’s smart eyewear market,” said IDC research director Sophie Pan.\nMore recently, Meta’s $799 Ray-Ban Display pair showed a more ambitious approach to the category, with integrated screens and a separate wrist band for gesture controls. Meta’s most advanced model is bulkier, heavier and pricier than usual, but it has drawn the contours of a promising path for development.\nAlibaba integrates many of its ecosystem strengths with the new Quark hardware, including the Taobao marketplace, travel-booking platform Fliggy and payments via Alipay. The company also partners with Hangzhou neighbor NetEase Inc. and Shenzhen’s Tencent Holdings Ltd. by providing their music services, NetEase Cloud Music and QQ Music.\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "BABA",
        "BABAF",
        "META",
        "NTES",
        "QCOM"
    ]
}