{
    "title": "Why gold prices could soar another 20% next year, according to top Wall Street forecasters",
    "url": "https://finance.yahoo.com/news/why-gold-prices-could-soar-231852666.html",
    "date": "2025-11-27T12:49:28.000Z",
    "author": "Jennifer Sor",
    "source": "finance.yahoo.com",
    "content_snippet": "Gold pricescould surge as much as 20% in the coming year, top forecasters say.\nWall Street sees tailwinds likecentral bank buyingand Fed rate cuts boosting bullion's value.\nSustained demand from priva...",
    "full_content": "Gold pricescould surge as much as 20% in the coming year, top forecasters say.\nWall Street sees tailwinds likecentral bank buyingand Fed rate cuts boosting bullion's value.\nSustained demand from private investors also adds to gold's bull case.\nGold's(GC=F) hot streak that boosted the metal to records could push on through 2026.\nThat's according to forecasters on Wall Street, many of whom are expecting the precious metal to continue itsrecord-setting rallyand climb as much as 20% in 2026.\nAnother double-digit increase forgoldwould be a tall order, considering thatbullionhas seen one of its best runs in decades this year. The metal traded around $4,187 an ounce on Wednesday, up 57% year-to-date.\nThat gain has been fueled by a cocktail of bullish forces, like increased central bank buying, stubborninflation, and investor concern about the strength of the US economy andtariffs.\nHere's what market pros think is coming for thesafe-havenin the next year.\nBofA analysts predictgoldwill push as high as $5,000 next year, implying a 19% increase from current levels.\nThe underlying bullish factors driving up the price of gold are expected to persist next year, the bank said in a recent note, referring to tailwinds like growingdeficit spendingin the US and President Donald Trump's \"unorthodox macro policies.\"\n\"Gold prices stopped pushing higher only once the underlying drivers changed,\" the bank said of its analysis of goldbull marketsdating back to 1970. \"For now, many of these remain in place, so we see support for gold.\"\nDespitegold's recent price correction, the precious metal remains \"underinvested\" for the long term, the analysts added.\nDaan Struyven, the cohead of global commodities research at Goldman Sachs, said he believed gold could hit $4,900 by the end of next year, implying a 17% increase from its current levels.\nThat's largely because of two factors that have supportedgold's rallythis year are expected to persist, he said, speaking to Bloomberg on Wednesday.\nIncreased central bank buying.Central bank reserve managers were spooked when they saw Russia's foreign reserves frozen after the nation invaded Ukraine in 2022.\"They need to diversify into gold, which is the only true safe asset once you hold in your domestic vaults,\" he said.\nCentral banks cutting rates.The Fed is expected tocut interest ratesby around 75 basis points in the next year, a factor that's expected to spur investment in non-yielding assets, like gold, Struyven said. That'll be supported by other central banks around the world, which are also expected to loosen monetary policy next year, he added. Rate cuts will fuel calls for higher inflation, with investors likely to pile into the metal as a hedge against fiat currency debasement.\nPrivate investors are also expected to give gold a boost, he said, pointing to trends like thedebasement trade,which says dollar-based assets will depreciate in value amid a decline in the dollar and other fiat currencies.\n\"I think the key intuition for the size of this price upside from private sector diversification is that the gold market is relatively small,\" he said, noting that the market forgold ETFswas around 70 times smaller than the market for US Treasurys. \"It's another reason why gold is our favorite long commodity recommendation.\"\nGold could rise as high as $4,950 in 2026, according to Deutsche Bank, implying as much as 18% upside. The bank's base case is for gold to end the year at around $4,450 an ounce.\nDespite gold's recent correction, investor flows look as though they've stabilized, and the precious metal has flashed a few technical signals that a \"positioning correction has completed,\" Michael Hsueh, a research analyst at the bank, wrote in a recent report.\nDemand from central banks and ETF investors also looks like it could remain strong, he added.\n\"These factors argue for an upgrade to our 2026 forecast,\" Hsueh wrote, though he noted there were downside risks to the precious metal if thestock marketwere to face a deeper correction, if the Fed lowers interest rates less than expected next year, or ifgeopolitical conflictstarts to smooth over.\n\"In the bigger picture, reserve managers could slow their pace of buying, and dramatic increases in real gold prices are often followed by significant corrections,\" he added.\nHSBC's forecast is less bullish but still upbeat. The bank said it sees gold prices trading in the range of $3,600-$4,400 an ounce in 2026. At the upper end, that implies 5% upside for gold.\n\"The likelihood that seismic and possibly permanent shifts in the geopolitical landscape, combined with more virulent forms of nationalism, including economic nationalism, in the form of tariffs, geopolitical risk, financial market turbulence, and questions overFed independenceand monetary policy look likely to persist,\" James Steel, the chief precious metals analyst at HSBC Securities, wrote in a client note last month.\nThe rally could start to lag in the second half of the year, he speculated, citing factors like a larger supply of gold, potentially reduced physical demand, and central banks easing purchases beyond the $4,000 threshold.\nRead the original article onBusiness Insider",
    "tags": [
        "ACR:Fed",
        "F",
        "GC",
        "PCT:17",
        "PCT:18",
        "PCT:19",
        "PCT:20",
        "PCT:5",
        "PCT:57"
    ]
}