{
    "title": "Oil steadies as investors await peace talk direction",
    "url": "https://finance.yahoo.com/news/oil-steadies-investors-await-peace-131712229.html",
    "date": "2025-11-27T13:17:12.000Z",
    "author": "By Ahmad Ghaddar",
    "source": "finance.yahoo.com",
    "content_snippet": "By Ahmad Ghaddar\nLONDON (Reuters) -Oil prices steadied on Thursday as market participants weighed talks to end the war in Ukraine against the impact of ​Western sanctions against Russian supply, thoug...",
    "full_content": "By Ahmad Ghaddar\nLONDON (Reuters) -Oil prices steadied on Thursday as market participants weighed talks to end the war in Ukraine against the impact of ​Western sanctions against Russian supply, though trading was set to remain thin due ‌to the U.S. Thanksgiving holiday.\nBrent crude futures rose 5 cents or 0.1% to stand at $63.‌18 a barrel at 1303 GMT, while U.S. West Texas Intermediate crude futures gained 16 cents or 0.3% to $58.81 a barrel.\nU.S. envoy Steve Witkoff is set to travel to Moscow next week with other senior U.S. officials for talks with ⁠Russian leaders on a possible plan ‌to end the nearly four-year-old war in Ukraine, the deadliest in Europe since World War Two.\nStill, Russia will make no big ‍concessions on a peace plan, a senior Russian diplomat said on Wednesday, after a leaked recording of a call involving Witkoff showed he had advised Moscow on how to pitch to U.S. ​President Donald Trump.\n\"Geopolitical volatility continues and hopes of a potential ceasefire between Russia and ‌Ukraine have neutralized the supply concerns arising from new US sanctions on key Russian producers,\" Barclays said in a note.\nMeanwhile, the Organization of the Petroleum Exporting Countries and allies are likely to leave output levels unchanged at a meeting on Sunday, three OPEC+ sources told Reuters on Tuesday. Some members of the group, which pumps about half the world's ⁠oil, have been raising production since April to ​gain market share.\nLimiting crude price declines were rising expectations for ​a U.S. Federal Reserve interest rate cut in December. A lower rate typically stimulates economic growth and bolsters demand for oil.\n\"We are ‍now approaching the year-end ⁠with thinner liquidity without any new drivers unless the Fed surprises the markets with a hawkish guidance on the 10 December FOMC meeting,\" said OANDA senior market analyst ⁠Kelvin Wong.\n\"WTI crude is likely to be range-bound between US$56.80 and US$60.40 till year-‌end,\" he added.\n(Additinoal reporting by Yuka Obayashi and Trixie Yap;‌ Editing by Christopher Cushing and Louise Heavens)",
    "tags": [
        "ACR:Fed",
        "CL",
        "F",
        "PCT:0.1",
        "PCT:0.3",
        "USD:$56.80",
        "USD:$58.81",
        "USD:$60.40"
    ]
}