{
    "title": "iQIYI (IQ) Tumbes as Analyst Warns of Chinese Stocks Volatility",
    "url": "https://finance.yahoo.com/news/iqiyi-iq-tumbes-analyst-warns-142308083.html",
    "date": "2025-11-27T14:23:08.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. iQIYI Inc. (NASDAQ:IQ) is one of the worst-performing stocks on Wednesday.\niQIYI snapped a two-day rally on Wednesday, shedding 3....",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. iQIYI Inc. (NASDAQ:IQ) is one of the worst-performing stocks on Wednesday.\niQIYI snapped a two-day rally on Wednesday, shedding 3.15 percent to finish at $2.15 apiece as investors unloaded portfolios following caution from an investment firm that Chinese stocks would continue to face volatility over the next few months.\nIn a market note, BCA Research underscored the global selloffs in Chinese stocks in November, which dented even the heavy gainers in the Chinese technology sector.\nAccording to the research firm, cautious sentiment lingered over the massive spending on artificial intelligence, intensifying pressure on Chinese stocks.\n“Chinese equities are less overbought after the recent pullback, but remain vulnerable to global risk-off sentiment and a softer world economy,” the research said.\nAdditionally, the Chinese economy sharply weakened in the fourth quarter of the year amid the noticeable slowdown in exports.\nIn other recent news, iQIYI Inc. (NASDAQ:IQ) swung to an attributable net loss of 248.9 million yuan in the third quarter of the year from an attributable net income of 229.4 million yuan in the same period last year.\nThis followed a 121.8 million operating loss during the period, reversing a 238.9 million operating income.\nRevenues also fell by 8 percent to 6.68 billion yuan from 7.24 billion yuan year-on-year.\nWhile we acknowledge the potential of IQ as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "IQ",
        "USD:$2.15"
    ]
}