{
    "title": "Bonk Teams Up With Bitcoin Capital to Launch ETP in Europe",
    "url": "https://finance.yahoo.com/news/bonk-teams-bitcoin-capital-launch-143904592.html",
    "date": "2025-11-27T14:39:04.000Z",
    "author": "Vismaya V",
    "source": "finance.yahoo.com",
    "content_snippet": "Solana-based meme coinBonk(BONK) has begun trading on Switzerland's third-largest stock exchange, through a newly launched exchange traded product, adding another regulated crypto offering to Europe's...",
    "full_content": "Solana-based meme coinBonk(BONK) has begun trading on Switzerland's third-largest stock exchange, through a newly launched exchange traded product, adding another regulated crypto offering to Europe's expanding digital asset market.\nSwiss-based crypto ETP issuer Bitcoin Capital issued the BONK ETP on SIX Swiss Exchange, allowing investors to gain exposure to the token through traditional brokerage accounts, according to an announcement shared withDecrypt.\nAs a subsidiary of Swiss asset-management boutique FiCAS AG, Bitcoin Capital launched the world's first actively managedBitcoinETP in 2020.\nSwitzerland's regulatory framework and market infrastructure for admitting crypto ETPs made it the “preferred venue for the launching a BONK ETP,” Marcel Niederberger, Chief Executive Officer at Bitcoin Capital & FiCAS toldDecrypt.\n\"Europe, and specifically the SIX Swiss Exchange offers a highly developed regulatory environment with consistent supervisory practices,\" he said.\nNew BONK Treasury Targets Up to $115 Million in Solana Meme Coin by Year-End\n“The product will reach both institutional and retail investors through established broker platforms,” Niederberger said, noting that regulated ETP access tends to boost investor confidence and liquidity, with most inflows across Bitcoin Capital’s existing products still coming from institutional desks.\nHe anticipates “continued expansion of regulated products referencing BONK” next year, as maturing European infrastructure and rising appetite for thematic digital assets open the door to “additional ETPs and structured notes.”\nBONK sits near $0.0599, up 3.5% on the day, ranking as the seventh-largestmeme coinby market value per CoinGecko data.\nThe Bonk listing follows a surge of meme coin products entering regulated markets mainly in the United States, dominated byDogecoin(DOGE), the largest meme coin by market cap.\nIn September, the Rex-Osprey Dogecoin ETF became the first U.S. fundto hold DOGE, while asset managerGrayscale launchedits spot GDOG product last week, generating approximately $1.4 million in first-day trading volume.\nGrayscale Dogecoin, XRP ETFs Add to Flurry of Altcoin Fund Debuts\nREX Shares also filed for a BONK ETF in January, alongside other meme coin products.\nMeanwhile, 21Sharesunveiled a 2x leveraged Dogecoin ETFon the Nasdaq last week, while Bitwise's Dogecoin ETF, BWOW,received approvalfrom NYSE Arca on Tuesday for listing and registration.",
    "tags": [
        "BONK",
        "BTC",
        "PCT:3.5",
        "USD"
    ]
}