{
    "title": "Amazon Sues to Stop Perplexity From Using AI Tool to Buy Stuff",
    "url": "https://finance.yahoo.com/news/amazon-demands-perplexity-stop-ai-185535636.html",
    "date": "2025-11-05T05:27:52.000Z",
    "author": "Shirin Ghaffary and Matt Day",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Amazon.com Inc. is suing Perplexity AI Inc. to try and stop the startup from helping users buy items on the world’s largest online marketplace, setting up a showdown that may have implic...",
    "full_content": "(Bloomberg) --Amazon.com Inc. is suing Perplexity AI Inc. to try and stop the startup from helping users buy items on the world’s largest online marketplace, setting up a showdown that may have implications for the reach of so-called agentic artificial intelligence.\nThe US online retailer filed a lawsuit Tuesday demanding Perplexity stop allowing its AI browser agent, Comet, to make purchases online for users. The e-commerce giant is accusing Perplexity of committing computer fraud by failing to disclose when Comet is shopping on a real person’s behalf, in violation of Amazon’s terms of service, according to the complaint in San Francisco federal court.\nMost Read from Bloomberg\nTrump’s 90,000-Square-Foot Ballroom Plan Puzzles the Experts\nCan Anyone Save Gary, Indiana?\nBoston’s South Station Gets a Towering Makeover\nIn Vancouver, A Court Ruling on Indigenous Land Triggers Real Estate Angst\nColorado Ski Haven Asks Voters If It Can Borrow More for Housing\nAmazon is introducing a dispute after sending a cease-and-desist letter to the startup Friday, accusing the smaller company of degrading the Amazon shopping experience and introduced privacy vulnerabilities, people familiar with the matter have said. The lawsuit may help set precedents on how far agentic AI can go in helping people figure out and automatically perform real-world tasks, rather than just creating online content.\nA Perplexity spokesperson said the lawsuit “just proves Amazon is a bully.” In an earlier blog post, the startup said the larger company was targeting a competitor with a rival AI agent shopping product and argued that users should be able to choose their preferred agent to make purchases on Amazon. “It’s a bully tactic to scare disruptive companies like Perplexity out of making life better for people,” the startup wrote.\nThe clash between Amazon and Perplexity offers an early glimpse into a looming debate over how to handle the proliferation of so-called AI agents that field more complex tasks online for users, including shopping.\nLike OpenAI and Alphabet Inc.’s Google, Perplexity has pushed to rethink the traditional web browser around AI, with the goal of having it streamline more actions for users, such as drafting emails and conducting research.\n“Amazon’s request is straightforward: Perplexity must be transparent when deploying its artificial intelligence,” the US retailer said in its filing. “No different than any other intruder, Perplexity is not allowed to go where it has been expressly told it cannot; that Perplexity’s trespass involves code rather than a lockpick makes it no less unlawful.”\nAmazon is also developing its own AI agents, including some capable of shopping. In April, it introduced a feature – still in public testing – called Buy For Me, which is designed to let shoppers buy from brand sites within the Amazon shopping app. Another AI assistant, called Rufus, can browse Amazon’s site, recommend products to shoppers and put them in a cart. But much of the experimentation in how agents might interact with the web has been carried out by startups like Perplexity, now valued at $20 billion.\n“Amazon’s a company that we’ve actually taken a lot of inspiration from,” Perplexity Chief Executive Officer Aravind Srinivas said in an interview. “But I don’t think it’s customer-centric to force people to use only their assistant, which may not even be the best shopping assistant.”\nThe Amazon retail site’s conditions of use prohibit “any use of data mining, robots, or similar data gathering and extraction tools.” In November 2024, Amazon asked Perplexity to stop deploying AI agents capable of purchasing products on the site until the two companies came to an agreement on the practice, the people familiar with the matter said. The startup complied.\nBut by this August, Perplexity started using its new Comet browser agent, which had logged into their users’ Amazon accounts, the letter said. This time, Perplexity identified the agents as a Google Chrome browser user, Amazon said in the letter. When Perplexity refused to stop its bots, Amazon sought to block them, but Perplexity released a new version of Comet to get around the security measure.\n“It’s fairly straightforward that third-party applications that offer to make purchases on behalf of customers from other businesses should operate openly and respect service provider decisions whether or not to participate,” Lara Hendrickson, an Amazon spokesperson, said in an emailed statement. She added that other companies, including food delivery services and online travel agencies, operate in the same way.\n“Agentic third-party applications such as Perplexity’s Comet have the same obligations, and we’ve repeatedly requested that Perplexity remove Amazon from the Comet experience, particularly in light of the significantly degraded shopping and customer service experience it provides,” she said.\nIn response to Amazon’s cease-and-desist letter that Perplexity was disguising its agents, Srinivas said he sees no need to distinguish a user from an agent that someone deputizes on their behalf. Srinivas argued that agents should have “all the same rights and responsibilities” as a real human user. “It’s not Amazon’s job to survey that,” he said.\nOver the past 18 months, Perplexity has been accused by publishers of using their content in AI news summaries without permission and of buying data that had been illegally scraped from Reddit’s discussion sites. Perplexity previously said it “will always fight vigorously for users’ rights to freely and fairly access public knowledge.”\nSrinivas said Perplexity’s Comet browser is not training or scraping any information from Amazon with its Comet agent, only taking actions required to make purchases at a user’s bidding. Perplexity, in the blog post responding to the cease-and-desist letter, also accused Amazon of trying to “eliminate user rights” in order to sell more ads.\nShopping agents may one day pose a significant threat to Amazon’s lucrative advertising business, which makes most of its money by selling prominent placement on its web store in response to shoppers’ product search queries. If bots shop for customers, the advertising placement potentially loses its value.\nAmazon CEO Andy Jassy said on an earnings call last week that the customer experience for AI shopping agents was “not good,” citing a lack of personalization and user-specific shopping history, and bungled delivery estimates and pricing.\n“But I do think we will find ways to partner,” he said, adding that Amazon was having “conversations” with builders of third-party agents.\nPerplexity is a customer of Amazon’s cloud unit. Srinivas said his company has made “hundreds of millions” in commitments to Amazon Web Services. AWS also brought Srinivas on stage during its annual trade show in 2023, and has repeatedly touted the startup as one of the AI outfits that built their businesses in part on Amazon’s digital infrastructure.\nAmazon founder Jeff Bezos has also invested in Perplexity.\nThe case is Amazon.com Services LLC v. Perplexity AI Inc., 3:25-cv-09514, US District Court, Northern District of California (San Francisco).\n--With assistance from Spencer Soper, Peter Blumberg and Edwin Chan.\nMost Read from Bloomberg Businessweek\nA Wave of US Layoffs Flash Early Warning Sign for Job Market\nMen’s Groups (Not ‘Boys Clubs’) Quietly Emerge in Big Business\nPortugal Has Plenty of Tourists. Now It Wants Data Centers\nNew York’s Golden Handcuffs: Why the City Has a Special Hold on the Rich\nAllow Zohran Mamdani to Reintroduce Himself\n©2025 Bloomberg L.P.",
    "tags": [
        "AMZN",
        "PEAI",
        "PVT"
    ]
}