{
    "title": "How AI startups should be thinking about product-market fit",
    "url": "https://finance.yahoo.com/news/ai-startups-thinking-product-market-171500132.html",
    "date": "2025-11-11T17:15:00.000Z",
    "author": "Tim De Chant",
    "source": "finance.yahoo.com",
    "content_snippet": "For all their pitches promising something new, AI startups share many of the same questions as startups in years past: How do they know when they’ve achieved the holy grail of product-market fit?\nProd...",
    "full_content": "For all their pitches promising something new, AI startups share many of the same questions as startups in years past: How do they know when they’ve achieved the holy grail of product-market fit?\nProduct-market fit has been studied extensively over the years; entire books have been written about how to master the art. But as with so many things, AI is upending established practices.\n“Honestly, it just could not be more different from all the playbooks that we’ve all been taught in tech in the past,”Ann Bordetsky, a partner atNew Enterprise Associates, told a standing room-only crowd atTechCrunch Disruptin San Francisco. “It’s a completely different ball game.”\nTop of the list is the pace of change in the AI world. “The technology itself isn’t static,” she said.\nEven still, there are ways that founders and operators can evaluate whether they have product-market fit.\nOne of the best things to watch,Murali Joshi, a partner atIconiq, told the audience, is “durability of spend.” AI is still early in the adoption curve at many companies, and so much of their spend is focused on experimentation rather than integration.\n“Increasingly, we’re seeing people really shift away from just experimental AI budgets to core office of the CXO budgets,” Joshi said. “Digging into that is super critical to ensure that this is a tool, a solution, a platform that’s here to stay, versus something that they’re just testing and trying out.”\nJoshi also suggested startups consider classic metrics: daily, weekly, and monthly active users. “How frequently are your customers engaging with the tool and the product that they’re paying for?”\nBordetsky agreed, adding that qualitative data can help provide nuance to some of the quantitative metrics which might suggest, but not confirm, whether customers are likely to stick with a product.\n“If you talk to customers or users, even in qualitative interviews, which we do tend to do a lot early on, that comes through very clearly,” she said.\nInterviewing people in the executive suite can be helpful, too, Joshi said. “Where does this sit in the tech stack?” he suggests asking them. He said that startups should think about how they can make themselves “more sticky as a product in terms of the core workflows.”\nLastly, it’s important for AI startups to think about product-market fit as a continuum, Bordetsky said. Product-market fit is not sort of one point in time,” she said. “It’s learning to think about how you maybe start with a little bit of product market fit in your space, but then really strengthen that over time.”",
    "tags": []
}