{
    "title": "Workday (WDAY) Ends 3-Day Run on Weak Outlook",
    "url": "https://finance.yahoo.com/news/workday-wday-ends-3-day-142214385.html",
    "date": "2025-11-27T14:22:14.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Workday Inc. (NASDAQ:WDAY) is one of the worst-performing stocks on Wednesday.\nWorkday snapped a three-day winning streak on Wedne...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Workday Inc. (NASDAQ:WDAY) is one of the worst-performing stocks on Wednesday.\nWorkday snapped a three-day winning streak on Wednesday, shedding 7.85 percent to end at $215.34 apiece as investor sentiment was dampened by a weak outlook for the full fiscal year of 2026.\nIn an updated report, Workday Inc. (NASDAQ:WDAY) said it targets subscription revenues to grow by 14.4 percent to $8.828 billion in the fiscal year ending January 2026, which is relatively flat from its previous outlook of $8.815 billion.\nOutlook for non-GAAP operating margin was also maintained at 29 percent.\nCopyright:baranq / 123RF Stock Photo\nIn the third quarter of the fiscal period, Workday Inc. (NASDAQ:WDAY) grew its net income by 30.6 percent to $252 million from $193 million in the same period last year. Revenues jumped by 12.6 percent to $2.432 billion from $2.160 billion year-on-year, on the back of a 14.6 percent jump in subscription revenues at $2.244 billion.\nFor the nine-month period, net income jumped by 26.8 percent to $548 million from $432 million, while revenues climbed by 12.6 percent to $7.02 billion from $6.235 billion.\n“Workday delivered another solid quarter, fueled by the strength and diversity of our business and the momentum we’re seeing across our AI portfolio,” Workday Inc. (NASDAQ:WDAY) CEO Carl Eschenbach said.\nWhile we acknowledge the potential of WDAY as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:CEO",
        "USD:$215.34",
        "USD:$7.02",
        "WDAY"
    ]
}