{
    "title": "The bowl crisis indicator flashes red",
    "url": "https://finance.yahoo.com/news/the-bowl-crisis-indicator-flashes-red-110015164.html",
    "date": "2025-11-11T11:00:15.000Z",
    "author": "Hamza Shaban",
    "source": "finance.yahoo.com",
    "content_snippet": "This is The Takeaway from today's Morning Brief, which you cansign upto receive in your inbox every morning along with:\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nYou d...",
    "full_content": "This is The Takeaway from today's Morning Brief, which you cansign upto receive in your inbox every morning along with:\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nYou don't need to watch more than a few Chipotle \"hack\" videos to know something is off. The bowls are half full — figuratively speaking.\nThis earnings season has delivered a strong signal that times are tough for many food service companies. But a major reason behind their flagging operations helps clarify a key storyline in the economy left open-ended amid the government shutdown.Young people are feeling greater financial pressure, squeezed by housing costs,a frozen jobs market, and slower wage growth.\nChipotle, the fast-casual go-to whose stock is down about 50% for the year, was the first of several chains to attribute its slowing salesto cash-strapped consumers. As pricing pressures continue to weigh on wallets, eating out, even at more affordable price points, has become something of a weekly luxury, replacing what used to be a workday routine.\nIf tech companies with a global reach can serve as a barometer of financial health, the onset of what could be described as a burrito malaise is an indicator offresh price sensitivity.\nSweetgreen (SG), following suit, reported that same-store sales declined 9.5% from a year ago. That same figure registered a 5.6% gain in 2024.\nExecutives at both companies noted that their customer bases skew younger, increasing their exposure to dips as 25-to-35-year-olds forego lunchtime bowls for cheaper alternatives.\nBut perceptions of value matter just as much as people's capacity to spend.\nFor every Cava (CAVA) seeing fewer customer visits compared to bustling storefronts last year, there's a Shake Shack (SHAK) enjoying same-store sales growth.\nCoffee chains are furthercomplicating the trend. Dutch Bros (BROS) and Starbucks (SBUX) pointed to younger customers as points of strength during earnings. That may not negate the idea of increasingly value-conscious consumers so much as highlight where people are willing to spend their money.\nSimilar to the dynamics between discount and retail stores, customer behavior may also be blurring as higher earners \"trade\" down andlower earners change shopping habits. McDonald's (MCD), for example, said it has seen strong growth among higher-income consumers, whereas fast-casual chains highlighted that their customers are more often eating at home.\nJust a few months ago, the rise of peoplerelying on buy now, pay later services for foodwas taken as a new warning sign. How troubling, it appeared, that customers were financing their lunches. That people are now simply pulling back from eating out may seem more prudent.\nBut it's another way of saying more of the economy is increasingly out of reach, and the K-shaped economy of winners and losers is starting to fray corporate bottom lines.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on X@hshaban.\nClick here for all of the latest retail stock news and events to better inform your investing strategy",
    "tags": [
        "BROS",
        "CAVA",
        "CMG",
        "MCD",
        "PCT:5.6",
        "PCT:50",
        "PCT:9.5",
        "SG"
    ]
}