{
    "title": "Bitcoin Traders Are Still Rattled After $340 Billion Wipeout",
    "url": "https://finance.yahoo.com/news/bitcoin-recovery-falters-buyer-fatigue-135425949.html",
    "date": "2025-11-11T14:40:18.000Z",
    "author": "Sidhartha Shukla",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Bitcoin is struggling to stage a meaningful recovery after last month’s stumble, with signs of fatigue continuing to mount across crypto markets.\nThe token briefly topped $107,000 on Mon...",
    "full_content": "(Bloomberg) --Bitcoin is struggling to stage a meaningful recovery after last month’s stumble, with signs of fatigue continuing to mount across crypto markets.\nThe token briefly topped $107,000 on Monday before slipping back below $105,000, underscoring fragile sentiment after a broad selloff that erased billions in market value. The downturn was partly fueled by large holders taking profits near this year’s highs and lingering unease following the early-October liquidations.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nMomentum has yet to return. Open interest in Bitcoin perpetual futures sits around $68 billion, well below the $94 billion peak seen last month, while funding rates — a measure of leveraged positioning — remain flat.\nFlows into exchange-traded funds also show little enthusiasm. US-listed Bitcoin ETFs drew just $1 million in net inflows on Monday, even as stocks and credit rallied after Washington moved to end the government shutdown.\nFrom a technical perspective, Bitcoin remains pinned below its 200-day moving average, now near $110,000 — a threshold analysts see as key for any sustained upside move. Bitcoin has lost about $340 billion in market value since a surprise tariff announcement by Donald Trump triggered record liquidations on Oct. 10.\nDespite posting gains for the year, Bitcoin has lagged behind both gold and technology stocks, leaving it vulnerable to rotation by momentum-driven investors. Crypto assets did rise modestly alongside other risk assets following signs of progress in Washington, but the broader tone remains cautious.\nHere’s what market participants have to say about the choppy trading.\nGeorge Mandres, senior trader at XBTO Trading: It feels like a dead cat bounce. Equities trade risk-on, with expectations that the US government reopening can add more fuel to the rally. In crypto, the sentiment is different for now as the narrative around OG whales (early Bitcoin) buyers, selling a significant amount of coins has received a lot of mind-share. This supply, combined with the pressure on premium on digital asset treasury firms and the lack of new money coming to the space, as proxied by ETF inflows is affecting risk sentiment.\nTony Sycamore, analyst, IG Australia: I think the most notable features over the past 24 hours is that Bitcoin has tracked the rally in risk assets higher after that correlation broke down last month. We would need to see this correlation hold in place for more than a session to say that the recent period of dislocation is over. But positive signs nonetheless. The other point is, technically - I could argue the correction from the $126,272 high is complete at the recent $98,898 low and that the uptrend has resumed. A sustained move above the 200-day moving average at around $110,000 would greatly increase conviction in this view.\nAlex Kuptsikevich, chief market analyst, FxPro: The crypto market capitalization fell by 1.1%, cooling off after an impressive surge in the first half of Monday. The 50-day moving average near $3.62 trillion acted as technical resistance, and the market’s climb stalled at $3.6 trillion. Despite Monday’s impressive surge, the market may be forming a new, lower local maximum, continuing the downward trend that began just over a month ago. The market is clearly not ready to switch to a mode of frenzied optimism, continuing to take profits after growth impulses have been realised. The reduction in support from corporate buyers is having an impact.\nRachael Lucas, analyst at BTC Markets: The recent lift in crypto prices looks like a classic short-covering rally, layered with a dash of institutional FOMO. Bitcoin bounced off key support at the 50-week SMA around $103,000 after testing lows near $98,900 and is now eyeing resistance at $110,400. If it breaks above that, we could see a run toward $115,600 to $118,000.\nOn the downside, $103,000 remains a critical structural level. A break below that could open the door to $86,000, with deeper support at US$82,000 aligning with the 100-week SMA. Any slip below those zones could reignite selling pressure.\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nHow an $11 Billion Beauty Company Built a Suburban Empire\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\n©2025 Bloomberg L.P.",
    "tags": [
        "BTC",
        "PCT:1.1",
        "USD",
        "USD:$3.62"
    ]
}