{
    "title": "Microsoft CEO Satya Nadella Admits 'I Don't Have Warm Shells To Plug Into' — While OpenAI CEO Sam Altman Warns Cheap Energy Could Upend AI",
    "url": "https://finance.yahoo.com/news/microsoft-ceo-satya-nadella-admits-143026640.html",
    "date": "2025-11-27T14:30:26.000Z",
    "author": "Casey B. Renner",
    "source": "finance.yahoo.com",
    "content_snippet": "Artificial intelligencemay have hit an unexpected snag — there aren't enough powered data centers to keep up with the machines driving it. And now, Microsoft(NASDAQ:MSFT) has AI chips sitting idle bec...",
    "full_content": "Artificial intelligencemay have hit an unexpected snag — there aren't enough powered data centers to keep up with the machines driving it. And now, Microsoft(NASDAQ:MSFT) has AI chips sitting idle because there's nowhere to plug them in.\nOn the \"BG2Pod,\" a technology and investing podcast hosted byBrad GerstnerandBill Gurleyand featuring OpenAI CEOSam Altman, Microsoft CEOSatya Nadellasaidthe shortage of power has become the industry's biggest constraint.\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon —Invest at $0.86/Share\n7 Million Gamers Already Trust Gameflip With Their Digital Assets —Now You Can Own a Stake in the Platform\n\"The biggest issue we are now having is not a compute glut, but it's power,\" Nadella said. \"It’s not a supply issue of chips. It’s actually the fact that I don’t have warm shells to plug into.\" The remarks referred to data centers that are incomplete or lack sufficient energy and cooling capacity.\nMicrosoft has slowed or paused some early-stage data center projects to address those constraints. Microsoft Cloud Operations and Innovation PresidentNoelle Walshsaidin an April LinkedIn post that the company is \"slowing or pausing some early-stage projects\" as part of the \"largest and most ambitious infrastructure scaling project\" in its history.\nAlphabet Inc.'s (NASDAQ:GOOG, GOOGL)) Google has signed demand-response agreements with U.S. utilities to temporarily reduce data center power use during grid events and reschedule nonurgent computing to off-peak times,accordingto a company's blog post last month.\nAmazon.com Inc.(NASDAQ:AMZN) has alsooutlinedefforts to improve data center efficiency and support grid reliability as AI usage grows.\nTrending: Bill Gates Says Climate Change ‘Needs to Be Solved' —This Award-Winning Building Material Is Tackling It Head-On\n\"If a very cheap form of energy comes online soon at mass scale, a lot of people are going to be extremely burned with existing contracts they've signed,\" Altman said on the podcast, explaining that shifts in global energy costs could pose significant risks for companies locked into long-term agreements.\nHe added that lower computing costs tend to drive demand higher, which can strain infrastructure that is already near capacity.Altmansaid the pace of AI's growth will depend on stable energy access, warning that sudden market changes could affect ongoing operations.\nSee Also: Missed Tesla?EnergyXIs Tackling the Next $200 Billion Opportunity — Lithium\nMicrosoftownsabout 27% of OpenAI and holds exclusive Azure cloud rights to OpenAI's models through 2030. Both companies depend on reliable electricity to operate data centers and expand capacity.\nIn response to rising demand, energy producers includingConstellation Energy Corporation(NASDAQ:CEG),Vistra Corp.(NYSE:VST) andBrookfield Renewable Partners(NYSE:BEP) have signed major power deals with large technology firms, including 24/7 carbon-free energy arrangements.\nLooking ahead, the International Energy Agencyprojectsglobal data center electricity consumption will roughly double to around 945 terawatt-hours by 2030, representing just under 3% of global electricity demand.\nRead Next: Wall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors —Without the Crowdfunding Middlemen\nImage: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools.Click now to access unique insightsthat can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis articleMicrosoft CEO Satya Nadella Admits &#39;I Don&#39;t Have Warm Shells To Plug Into&#39; — While OpenAI CEO Sam Altman Warns Cheap Energy Could Upend AIoriginally appeared onBenzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
    "tags": [
        "ACR:CEO",
        "AMZN",
        "GOOG",
        "META",
        "MSFT",
        "OPAI",
        "PCT:27",
        "PCT:3",
        "PVT",
        "USD:$0.86"
    ]
}