{
    "title": "Nvidia's bumpy November",
    "url": "https://finance.yahoo.com/news/nvidias-bumpy-november-093001210.html",
    "date": "2025-11-27T14:14:58.000Z",
    "author": "Brent D. Griffiths",
    "source": "finance.yahoo.com",
    "content_snippet": "Nvidialooked poised to have a great month on the heels of hitting an all-time high and another blockbuster earnings.\nInstead, the AI chipmaker has faced ongoing concerns about a possible AI bubble and...",
    "full_content": "Nvidialooked poised to have a great month on the heels of hitting an all-time high and another blockbuster earnings.\nInstead, the AI chipmaker has faced ongoing concerns about a possible AI bubble and increased competition from Google.\nNews of a potential big Google chip deal sent Nvidia shares tumbling further, though they've regained some of the losses.\nNvidia's (NVDA) sterling armor was dented this month.\nAfter years of meteoric success, the chipmaker and its CEOJensen Huanghave increasingly found themselves playing defense — an unusual position for the company.\nNvidia headed into the month with its stock price at an all-time high, bolstered by increasing AI spending from some of its major Big Tech customers likeMeta, Microsoft, andGoogle.\nHuang was hot off ofNvidia's GTC conferencein Washington, where he dismissed any concerns of an AI bubble and sounded jubilant.\nBut over the course of the month, which saw Nvidia shed 11% of its value, the chipmaker has gone from smashing earnings and alleviating Wall Street's AI bubble fears to becoming the poster boy of what some analysts view as a company on an unsustainable path.\nNvidia has also had to fend off short-sellers and the growing threat of Google, picking up some bruises along the way.\nBig names, including SoftBank and Peter Thiel, cashed out on the Wall Street darling that had became the world's first $4 trillion market cap company mere months ago.SoftBank announced it fully exited its Nvidia position, selling $5.8 billion in shares to bet on OpenAI. And while its CFO stressed it had \"nothing to do with Nvidia itself,\" the move didn't exactly dispel the ongoing AI bubble talk.\nNvidia defiantly pushed back on any investor skittishness when it released itsthird-quarter earningson November 19, surpassing analysts' already lofty expectations — no small feat — at a time when concerns about the AI bubble were once again creeping up.\n\"There's been a lot of talk about an AI bubble,\" Huang told analysts on a call following the results. \"From our vantage point, we see something very different.\"\nBut while shares rallied in after-hours trading following the results,markets did a U-turnthe following day as hand-wringing over ballooning tech valuations and spending continued.\nBehind closed doors, Huang privately told employees in remarks first reported by Business Insider that\"the market did not appreciate\"Nvidia's \"incredible\" quarter.\nFacing sky-high expectations and the position of being a bellwether for the AI industry, Huang described the chipmaker as being in a somewhat no-win situation.\n\"If we delivered a bad quarter, it is evidence there's an AI bubble. If we delivered a great quarter, we are fueling the AI bubble,\" Huang said during an all-hands meeting.\nIt didn't take long for things to get a bit choppy for the chipmaker.\nShares of Nvidia fell afterThe Informationreported that Google (GOOGL) was engaged in talks with Meta to provide the social network billions worth of the tech giant's own advanced chips.\nWhile Nvidia's chips have long been the gold standard in the AI race, a hot commodity used by tech giants and startups to train and run LLMs and chatbots, the news suggested that the chipmaker's market share might be under threat. With Google now eyeing Nvidia's lunch, the market digested a possible future where Nvidia may no longer be the star attraction.\nNvidia's market losses following the news appeared to be Google's gain, with its parent company Alphabet now positioned to jointhe $4 trillion club that Nvidia started.\nAnd in a move thatraised some eyebrows, Nvidia released a mostly defiant statement that praised Google's success but said Nvidia's chips are\"a generation ahead of the industry.\"\nThe developments acted as fuel forMichael Burryof \"The Big Short\" fame, who has become increasingly vocal about voicing his doubts about Nvidia.\nBurry, who has a particularly dour view of the AI industry, spent much of the month questioning the longevity of Nvidia's chips, its stock dilution, and its circular, \"give-and-take deals\" in AI.\nThe investor recently leaned into online writing and labeled Nvidia as the Cisco of the AI bubble era in one of his first Substack posts.\n\"And once again there is a Cisco at the center of it all, with the picks and shovels for all and the expansive vision to go with it,\" Burry wrote. \"Its name is Nvidia.\"\nThe chipmaker didn't take the criticism lying down. In a note to Wall Street sell-side analysts, a copy of which was obtained by Business Insider,Nvidia took exception to Burry's claims, stating that he appeared to have \"incorrectly\" made some of his calculations.\nThe memo also pushed back against views that Nvidia is too entangled incircular financial arrangementswith some of its customers.\n\"First, Nvidia's strategic investments represent a small share of Nvidia's revenue and an even smaller share of approximately $1T raised each year across global private capital markets,\" the memo said, adding, \"The companies in Nvidia's strategic investment portfolio predominantly generate revenue from third-party customers, not from Nvidia.\"\nBurry called Nvidia's response\"disappointing\"and disclosed that he \"continues to own puts\" on Nvidia.\nWhile November undoubtedly turned up the heat on Nvidia, the chipmaker continues to be the world's most valuable company by market cap and its shares have slightly rebounded in recent days, closing up 1.37% on Wednesday.\nThe world's largest tech companies rely on Nvidia's chips and have committed to spend billions and billions on the latest generation. CEO Jensen Huang has said sales of its latest Blackwell chips have been \"off the charts.\"\nNvidia's CFO, Colette Kress, told analysts earlier this month that the company is on track to bring in \"half a trillion\" in AI chip orders during the combined 2025-2026 period — a number that she said \"will grow\" as more deals are struck.\nWhile Nvidia's bruising back half of the month is a reminder that even AI royalty can see its crown threatened, Huang had some words for the doubters during the company's earnings call.\n\"As a reminder, Nvidia is unlike any other accelerator,\" he said. \"We excel at every phase of AI, from pre-training and post-training to inference.\"\nRead the original article onBusiness Insider",
    "tags": [
        "ACR:CEO",
        "ACR:CFO",
        "GOOG",
        "META",
        "MSFT",
        "NVDA",
        "PCT:1.37",
        "PCT:11"
    ]
}