{
    "title": "China ends levies on US farm goods after fentanyl duties cut",
    "url": "https://finance.yahoo.com/news/china-ends-levies-us-farm-072811605.html",
    "date": "2025-11-05T07:28:11.000Z",
    "author": "Josh Xiao and Hallie Gu",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) — China will remove retaliatory tariffs that it imposed on a range of US agricultural products, after Washington halved its fentanyl-related levies on Chinese goods.\nThe country’s Ministry...",
    "full_content": "(Bloomberg) — China will remove retaliatory tariffs that it imposed on a range of US agricultural products, after Washington halved its fentanyl-related levies on Chinese goods.\nThe country’s Ministry of Finance confirmed in a notice on Wednesday that it will end all tariffs imposed March 4 on soybeans and other US agricultural products including corn, wheat, sorghum and chicken. The move was previously flagged in a White House fact sheet.\nMost Read from Bloomberg\nTrump’s 90,000-Square-Foot Ballroom Plan Puzzles the Experts\nCan Anyone Save Gary, Indiana?\nBoston’s South Station Gets a Towering Makeover\nIn Vancouver, A Court Ruling on Indigenous Land Triggers Real Estate Angst\nColorado Ski Haven Asks Voters If It Can Borrow More for Housing\nThe cancellation — to take effect Nov. 10 — comes hours after US President Donald Trump signed a pair of executive orders. They formalized slashing fentanyl-related levies on Chinese exports to 10% and bringing down the reciprocal US tariff rate from 34% to 10%.\nThe moves are part of a broader trade pact between Trump and Chinese leader Xi Jinping that’s set to last one year and has, at least temporarily, stabilized what had been a turbulent relationship. Before their summit in South Korea last week, the two leaders had been locked in a cycle of actions and retaliations on trade.\nThe detente has boosted optimism about a revival in agricultural trade between the two nations, helping to push up global grain prices. Chicago soybean futures rose as much as 1% in Asian hours on Wednesday.\nChinese buyers had shunned American soybeans as tensions between the two sides soured, taking more from South America instead. The Asian nation bought its first US cargoes this season just days before the summit in South Korea, and then made further purchases after the meeting. China bought more than $12 billion of American soybeans last year.\nHowever, US soybeans are still likely to face a 13% Chinese import duty even after the tariff reduction, according to traders.\nBeijing is also removing an additional 15% retaliatory levy on US wheat, according to the finance ministry notice. A major Chinese buyer is currently seeking a shipment of the grain from the US, which would be purchase by the Asian nation in more than a year.\n“The halting of certain tariffs between China and the US aligns with the fundamental interests of both countries and their people,” the ministry said in the notice. It “meets the expectations of the international community and will help push bilateral economic and trade relations to a higher level.”\nThe Chinese ministry confirmed in a separate notice on Wednesday that the 24% tariff on all US products will be suspended for a year, mirroring Trump’s executive order. The Chinese suspension will kick in at 1:01 p.m. in Beijing on Monday.\n(Updates to add chart showing China’s soybean stocks after sixth paragraph. A previous version of this story contained an error in Y-axis unit of first chart.)\nMost Read from Bloomberg Businessweek\nA Wave of US Layoffs Flash Early Warning Sign for Job Market\nMen’s Groups (Not ‘Boys Clubs’) Quietly Emerge in Big Business\nPortugal Has Plenty of Tourists. Now It Wants Data Centers\nNew York’s Golden Handcuffs: Why the City Has a Special Hold on the Rich\nAllow Zohran Mamdani to Reintroduce Himself\n©2025 Bloomberg L.P.",
    "tags": []
}