{
    "title": "Super Group (SGHC) Falls Hard as UK Govt Slaps Higher Gambling Duties",
    "url": "https://finance.yahoo.com/news/super-group-sghc-falls-hard-142230933.html",
    "date": "2025-11-27T14:22:30.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Super Group (SGHC) Limited (NYSE:SGHC) is one of the worst-performing stocks on Wednesday.\nSuper Group dropped its share prices by...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Super Group (SGHC) Limited (NYSE:SGHC) is one of the worst-performing stocks on Wednesday.\nSuper Group dropped its share prices by 6.74 percent on Wednesday to close at $10.93 apiece as investor sentiment was dampened by the United Kingdom’s decision to slap higher duties on gambling activities.\nEffective April 2026, the new rules would raise the taxes on remote gaming to 40 percent from 21 percent previously, while in April 2027, levies on online sports betting would increase to 25 percent from 15 percent previously.\nAccording to Super Group (SGHC) Limited (NYSE:SGHC), the taxes would result in a 6 percent negative impact on its 2026 adjusted EBITDA, but it expressed strong support for the rules.\n“Super Group supports the reasonable taxation of online gaming in the UK. We rely on the government to ensure that today’s very substantial increase should be paired with robust and strict enforcement against non-paying offshore operators,” said Super Group (SGHC) Limited (NYSE:SGHC) CEO Neal Menashe.\n“This is essential to protect the regulated sector’s investment in jobs, technology, and responsible gaming in the UK,” he added.\nAdditionally, Super Group (SGHC) Limited (NYSE:SGHC) Chief Finance Officer Alinda van Wyk noted that the company has already prepared mitigation measures to offset the tax impact.\n“Our strategy remains unchanged: sustainable growth and disciplined capital allocation. We don’t expect today’s news to alter our long-term trajectory nor our capital return priorities,” she added.\nWhile we acknowledge the potential of SGHC as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:CEO",
        "ACR:EBITDA",
        "SGHC",
        "SPG.JO",
        "USD:$10.93"
    ]
}