{
    "title": "Exclusive - China bans foreign AI chips from state-funded data centres, sources say",
    "url": "https://finance.yahoo.com/news/exclusive-china-bans-foreign-ai-080808297.html",
    "date": "2025-11-05T08:08:08.000Z",
    "author": "Reuters",
    "source": "finance.yahoo.com",
    "content_snippet": "(Reuters) - The Chinese government has issued guidance requiring new data centre projects that have received any state funds to only use domestically-madeartificial intelligencechips, two sources fami...",
    "full_content": "(Reuters) - The Chinese government has issued guidance requiring new data centre projects that have received any state funds to only use domestically-madeartificial intelligencechips, two sources familiar with the matter told Reuters.\nIn recent weeks, Chinese regulatory authorities have ordered such data centres that are less than 30% complete to remove all installed foreign chips,​ or cancel plans to purchase them, while projects in a more advanced stage will be decided on a case-by-case basis, the sources said.\nThe move could represent one of China's most ‌aggressive steps yet to eliminate foreign technology from its critical infrastructure amid a pause in trade hostilities between Washington and Beijing, and achieve its quest for AI chip self-sufficiency.\nChina's access to advanced AI chips, including those made byNvidia, has been a key point of ‌friction with the U.S., as the two wrestle for dominance in high-end computing power and AI.\nU.S. President Donald Trump said in an interview aired on Sunday following talks with Chinese President Xi Jinping last week that Washington will \"let them deal with Nvidia but not in terms of the most advanced\" chips.\nThe latest move by Beijing, however, would dash Nvidia's hopes of regaining Chinese market share, while giving local rivals, including Huawei, yet another opportunity to secure more chip sales.\nIt is unclear whether the guidance applies nationwide or only to certain provinces, sources said. The sources did not identify which Chinese regulatory bodies had issued the order. They declined to be named due ⁠to the sensitivity of the matter.\nBesides Nvidia, other foreign chipmakers that sell ‌data centre chips to China include AMD and Intel.\nThe Cyberspace Administration of China and the National Development and Reform Commission, two of Beijing's most powerful regulators, did not respond to requests for comment. Nvidia and AMD did not respond, while Intel declined to comment.\nNVIDIA THE BIGGEST CASUALTY\nAI data centre projects in China have drawn over $100 billion in ‍state funding since 2021, according to a Reuters review of government tenders. Most data centres in China have received some form of state funding to aid their construction, but it is not immediately clear how many projects are subject to the new guidance.\nSome projects have already been suspended before breaking ground as a result of the directive, including a facility in a northwestern province that had planned to deploy Nvidia chips, one of the sources said.\nThe project, being developed by a private technology company that ​received state funding, has been put on hold, the source said.\nBeijing has long been irked by Washington's export controls aimed at impeding China's tech progress and has taken a series of measures, including retaliatory moves,‌ to wean itself off U.S. technology.\nThe U.S. has justified its restrictions by alleging the Chinese military would use the chips to increase its capabilities.\nChina discouraged local tech giants from purchasing advanced Nvidia chips over security concerns this year, while showing off a new data centre powered solely by domestic AI chips.\nAnd in 2023, Beijing banned the use of Micron's products in its critical infrastructure, which paved the way for a decision this year by the largest U.S. memory chipmaker to exit the server chip market in China, Reuters reported last month.\nNvidia CEO Jensen Huang has repeatedly lobbied Trump and his cabinet to allow the sale of more AI chips to China, arguing that keeping its superpower rival's AI industry dependent on U.S. hardware was good for America's interests.\nIts current share of the Chinese AI chip market is zero, compared to 95% in 2022, according to ⁠the company.\nExcluding foreign chipmakers like Nvidia from big state projects would eliminate a significant portion of their China revenue, even as a ​deal is agreed to allow the resumption of advanced chip sales to China.\nThe new guidance on data centres covers Nvidia's H20 chips, ​the most advanced AI chip the U.S. firm is allowed to sell to China, but also more powerful processors such as the B200 and H200, the sources said.\nWhile the B200 and H200 are barred from being shipped to China by U.S. export controls, they remain widely available in China through grey-market channels.\nBOON AND RISKS FOR DOMESTIC FIRMS\nWith the ‍latest directive, the Chinese government is carving out even more ⁠market share for domestic chipmakers. China has a range of AI chip companies, from the most prominent, Huawei Technologies, to smaller players such as Shanghai-listed Cambricon and startups including MetaX, Moore Threads, and Enflame.\nProducts from these Chinese companies already rival some of Nvidia's offerings, but they have struggled to crack the market. Developers used to Nvidia's reliable software ecosystem have been reluctant to adopt ⁠domestic alternatives.\nWhile the move would help boost sales of domestically developed chips, it also risks widening the U.S.-China gap in AI computing power.\nU.S. tech giants likeMicrosoft, Meta, and OpenAI have spent or allocated hundreds of billions of dollars to ‌build data centres powered by Nvidia's most advanced chips.\nMeanwhile, leading Chinese chip manufacturers like SMIC are facing supply constraints due to U.S. sanctions on semiconductor manufacturing equipment that have ‌hit advanced chip production capacity.\n(Reporting by China Newsroom; Editing by Eduardo Baptista, Miyoung Kim and Sonali Paul)",
    "tags": [
        "NVDA"
    ]
}