{
    "title": "Democrats Score Biggest Wins Since Trump Returned as 2026 Looms",
    "url": "https://finance.yahoo.com/news/democrats-score-biggest-wins-since-033721355.html",
    "date": "2025-11-05T05:39:38.000Z",
    "author": "Gregory Korte",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Democrats registered their biggest political victories since their stinging loss to Donald Trump a year ago with a series of wins Tuesday night in Virginia, New Jersey, New York and Cali...",
    "full_content": "(Bloomberg) --Democrats registered their biggest political victories since their stinging loss to Donald Trump a year ago with a series of wins Tuesday night in Virginia, New Jersey, New York and California, as the party coalesced around a message of economic affordability and voters delivered a repudiation of the president.\nMikie Sherrill in New Jersey and Abigail Spanberger in Virginia both campaigned for governor on pocketbook issues — lowering costs, expanding child care and restoring stability after months of economic turbulence and a government shutdown that’s stretched past five weeks.\nMost Read from Bloomberg\nTrump’s 90,000-Square-Foot Ballroom Plan Puzzles the Experts\nCan Anyone Save Gary, Indiana?\nBoston’s South Station Gets a Towering Makeover\nIn Vancouver, A Court Ruling on Indigenous Land Triggers Real Estate Angst\nColorado Ski Haven Asks Voters If It Can Borrow More for Housing\nIn New York City, Zohran Mamdani, a progressive Democrat who ran an insurgent campaign for mayor, won Tuesday after emphasizing the same message on the cost of living — tackling housing costs and widening inequality in the nation’s financial capital.\nAnd in California, voters approved a ballot initiative that will redraw the state’s congressional district map to give Democrats the opportunity to win a handful of additional seats.\nAll four races were called soon after polls closed. Democrats also won competitive down-ballot races in Pennsylvania, where three Supreme Court justices won retention elections, and in Georgia, where two Democrats won seats on the state utility commission by campaigning on energy costs.\nTaken together, the victories exhibit a semblance of Democrats at least recapturing some of their swagger and reconnecting with voters after Trump swept all of the electoral swing states a year ago while making inroads in traditional Democratic bastions. The so-called off-year contests are part referendum, part barometer, part guidepost and possibly part springboard.\n“The story of the night is a repudiation of the president,” said Rahm Emanuel, the former Chicago mayor, White House chief of staff, and US ambassador to Japan. “Everywhere you’re going, Democrats are outperforming in that area.”\nEven Jay Jones, the Democratic candidate for Virginia attorney general, overcame a texting scandal in which years ago he threatened “two bullets to the head” of a political rival, to win his race.\n“There’s two key lessons for Republicans, listen carefully,” said Vivek Ramaswamy, a former biotech executive running for governor of Ohio next year, in a video.\n“Number one, our side needs to focus on affordability. Make the American dream affordable,” he said. “And number two, cut out the identity politics. It doesn’t suit Republicans. It’s not for us.”\nTrump suggested he deserved no blame for Republicans’ poor performance Tuesday. In a social media post, the president cited unnamed “pollsters” saying the losses came because he wasn’t on the ballot and voters were responding to the government shutdown.\nOne of the Democrats’ biggest wins came not for a single candidate but on a ballot issue: Proposition 50, which will redraw the state’s congressional maps to create five new Democratic-leaning districts. California Governor Gavin Newsom had staked his political future, including a possible White House run, on pushing back against Trump’s own gerrymandering crusade.\nThe initiative countered GOP-led mapmaking in Texas that could give Republicans several additional House seats. Newsom and his allies raised more than $120 million to back the measure, outspending opponents by roughly three to one, according to state filings.\nSpanberger, a former congresswoman, won in a state particularly sensitive to Trump’s attempts to downsize the federal government, and highlighted the economic argument that Democrats are likely to employ when voters decide control of the US House and Senate in 2026. Both are currently, narrowly, controlled by Republicans.\n“Tonight, we sent a message,” Spanberger told supporters in Richmond. “We sent a message to every corner of the commonwealth, a message to our neighbors and our fellow Americans across the country. We sent a message to the whole world that in 2025 Virginia chose pragmatism over partisanship. We chose our commonwealth over chaos.”\nAn Associated Press poll of voters in Virginia and New Jersey found that about six in 10 said they’re “angry” or “dissatisfied” with the way things are going in the country today. Only a third said they are “enthusiastic” or “satisfied.” A separate poll by CNN found that more than half of voters said they intended to send a message to Trump with their vote.\nEarly voting was high across all the major races — especially in New York City, which saw its highest voter turnout in decades.\nWhile candidates were largely focused around the same message of the economy and affordability, the elections are exposing an ideological fracture in the party.\nSpanberger and Sherrill are considered center-left Democrats. But in New York City, voters picked Mamdani, who has promised a rent freeze and free buses while maintaining that billionaires shouldn’t exist.\nSpanberger, a former CIA officer, focused her campaign on the state’s economy and the month-long federal government shutdown that’s left thousands of Virginia’s federal workers without pay. Her opponent, Republican Lieutenant Governor Winsome Earle-Sears emphasized immigration and parental rights, an issue that helped term-limited Governor Glenn Youngkin win four years ago.\nIn New Jersey, Democrats extended their hold on the governorship in a state that routinely votes blue for president but drifted toward Republicans in the last presidential election. Sherrill, a congresswoman, Navy veteran and former prosecutor, faced former Assemblyman Jack Ciattarelli — who nearly unseated Democratic Governor Phil Murphy in 2021.\nThe New Jersey race was an early signal of whether Trump’s coalition, which made inroads with White working-class voters in the state, will stick with the GOP when he’s not on the ballot. Trump endorsed Ciattarelli, who has campaigned on cutting taxes and energy costs, while Sherrill emphasized transit funding and child care.\nIn New York City, Mamdani, a 34-year-old assemblyman and self-described democratic socialist, won the mayoralty after defeating former Governor Andrew Cuomo in the Democratic primary. Cuomo ran again as an independent in the general election, while Republican Curtis Sliwa remained a distant third.\nMamdani becomes the city’s first Muslim and South Asian mayor. His rise — built on a campaign centered on housing costs and economic inequality — has alarmed Wall Street and divided Democratic leaders. Mamdani delivered a fiery victory speech in which he laced into the president, who had railed against Mamdani in the closing days of the race and endorsed his opponent, Cuomo.\nFor both parties, the warm-ups to the 2026 midterms are as much about messages as about math. Democrats, backed by former President Barack Obama’s return to the campaign trail, are framing the contests as a check on Trump’s power and a referendum on rising prices.\nTrump himself had been largely invisible in the races, with the exception of frequent barbs directed at Mamdani — who he called “a communist” and “a complete and total failure.”\nThe votes come as Washington remains paralyzed by a government shutdown entering its sixth week — now the longest in US history. Trump’s effort to pare back federal spending has idled hundreds of thousands of workers and slowed economic data releases, a drag on growth that economists say could echo through the year if the impasse continues.\nKansas Governor Laura Kelly, head of the Democratic Governors Association, said in a statement that the Virginia win marked “a resounding rejection of Donald Trump’s chaos and a warning sign to all Republican politicians running in 2026 who continue to rubber stamp his failed economic policies.”\nAnd in New Jersey, Kelly labeled Sherrill’s win a roadmap showing how Democrats can “win in deeply competitive races when we stay laser-focused on our positive vision to address the biggest issues impacting families in their daily lives.”\nObama lauded his party’s candidates.\n“It’s a reminder that when we come together around strong, forward-looking leaders who care about the issues that matter, we can win,” he said in a social media post. “We’ve still got plenty of work to do, but the future looks a little bit brighter.”\n--With assistance from Alicia Diaz, Skylar Woodhouse, Ted Mann, Eliyahu Kamisher and Romy Varghese.\n(Updates with details throughout.)\nMost Read from Bloomberg Businessweek\nA Wave of US Layoffs Flash Early Warning Sign for Job Market\nMen’s Groups (Not ‘Boys Clubs’) Quietly Emerge in Big Business\nPortugal Has Plenty of Tourists. Now It Wants Data Centers\nNew York’s Golden Handcuffs: Why the City Has a Special Hold on the Rich\nAllow Zohran Mamdani to Reintroduce Himself\n©2025 Bloomberg L.P.",
    "tags": []
}