{
    "title": "Wall Street's 2026 forecasts are rolling in — and some see the S&P 500 hitting 8,000",
    "url": "https://finance.yahoo.com/news/wall-streets-2026-forecasts-are-rolling-in--and-some-see-the-sp-500-hitting-8000-110002501.html",
    "date": "2025-11-27T11:00:02.000Z",
    "author": "Allie Canal",
    "source": "finance.yahoo.com",
    "content_snippet": "The boldest stock market calls for 2026 are starting to hit Wall Street — and some of them include a run to 8,000 for the S&P 500 (^GSPC) as the AI boom continues reshaping the economy and financial m...",
    "full_content": "The boldest stock market calls for 2026 are starting to hit Wall Street — and some of them include a run to 8,000 for the S&P 500 (^GSPC) as the AI boom continues reshaping the economy and financial markets.\nDeutsche Bank set a year-end 2026 price target of 8,000 for the benchmark index in a new outlook published on Tuesday, calling for \"mid-teens returns\" driven by stronger inflows, buybacks,and continued momentum in earnings, which have been especially strong so far in 2025.\nS&P 500 companies grew earnings by 13.4% in the third quarter, according to FactSet.\n\"In 2026, we see robust earnings growth and equity valuations remaining elevated,\" Deutsche Bank's equities strategy team, led by Binky Chadha, wrote in the report.\nThat view sits at the upper end of Wall Street's expectations for next year. HSBC, for example,has a 2026 target of 7,500,while JPMorgan is calling forthe S&P 500 to reach 7,500 with upside to 8,000if the Fed continues to cut rates.\nMorgan Stanley also expects a strong year, forecasting the index will finish 2026 at 7,800 amid what strategist Mike Wilson calls a \"new bull market,\"arguing in a report last weekthat a rolling recession ended earlier this year and that policy support and earnings strength will continue into next year.\nAnd more firms are leaning into the idea that the next phase of the bull market still has room to run.\nWells Fargo is in that camp, calling for a double-digit move higher in stocks over the next 12 months and a year-end 2026 target of 7,800. The bank expects a two-stage rally next year as the market shifts from a \"reflation hope\" trade in the first half to a stronger AI-driven surge in the second.\nRead more:How to protect your portfolio from an AI bubble\nWhile Wells Fargo sees the AI boom echoing past periods of tech-led growth, it also cautions that the tradecould become a bubble. The firm argues that policy and liquidity should keep the backdrop supportive heading into the midterm election cycle, but notes the marketis becoming increasingly intertwinedwith the broader economy.\n\"AK-shaped economyled by wealth effect means a bear market could trigger an economic downturn, which neither the Fed nor the Gov't can afford especially into midterms,\" the bank's equity strategy team, led by Ohsung Kwon, wrote. The firm noted that equity gains have become increasingly tied to household wealth as the economy splits between the \"haves\" and the \"have-nots.\"\nJPMorgan lands in a similar place. The bank's baseline call for 2026 is a run toward 7,500, but it sees a path above 8,000 if an improved inflation outlook prompts the Fed to cut rates more aggressively. For now, JPMorgan expects two additional cuts before the central bank pauses.\nMarkets are currently pricing in an 83% chance that the central bank cuts interest rates by the end of its December meeting in two weeks, up from a roughly 30% chance seen just last week,according to the CME FedWatch Tool.\n\"Despite AI bubble and valuation concerns, we see current elevated multiples correctly anticipating above-trend earnings growth, an AI capex boom, rising shareholder payouts, and easier fiscal policy (i.e. [One Big Beautiful Bill Act]),\" JPMorgan lead equity strategist Dubravko Lakos-Bujas wrote.\n\"More so, the earnings benefit tied to deregulation and broadening AI-related productivity gains remain underappreciated,\" Lakos-Bujas added, projecting earnings growth of 13% to 15% over the next two years.\nThat boom, however, isn't unfolding in a vacuum. JPMorgan, like other firms, notes the AI shift is happening againsta polarized economic backdrop: \"This disruption is unfolding within an already unhealthy K-shaped economy, with AI expected to amplify this polarization even further.\"\nHSBC is also leaning on that theme,initiating coverage on 2026 with a 7,500 price targetthat suggests \"another year of double-digit gains mirroring the late 1990s equity boom.\"\nLike JPMorgan, the bank expects the AI investment cycle to continue supporting earnings, even as lower-income consumers remain under pressure.\n\"While 2025 was marked by the policy fallout from Liberation Day tariffs, stricter immigration policy, and overall elevated uncertainty from trade to geopolitics to Fed independence, we expect 2026 to be marked by a two speed economy/market,\" the bank said.\nAllie Canalis a Senior Reporter at Yahoo Finance. Follow her on X@allie_canal,LinkedIn,and email her at alexandra.canal@yahoofinance.com.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "ACR:Fed",
        "ACR:S&P",
        "GSPC",
        "PCT:13",
        "PCT:13.4",
        "PCT:15",
        "PCT:30",
        "PCT:83"
    ]
}