{
    "title": "SoftBank Sells Nvidia Stake for $5.8 Billion to Fund AI Bets",
    "url": "https://finance.yahoo.com/news/softbank-unloads-nvidia-stake-5-065809827.html",
    "date": "2025-11-11T15:02:41.000Z",
    "author": "Min Jeong Lee",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --SoftBank Group Corp. sold its entire stake in Nvidia Corp. for $5.83 billion to help bankroll AI investments, even as investors question the amount of capital pouring into a technology w...",
    "full_content": "(Bloomberg) --SoftBank Group Corp. sold its entire stake in Nvidia Corp. for $5.83 billion to help bankroll AI investments, even as investors question the amount of capital pouring into a technology with uncertain returns.\nFounder Masayoshi Son has been unwinding positions to pay for a plethora of AI projects, from Stargate data centers with OpenAI and Oracle Corp. to robot manufacturing sites in the US. The Nvidia exit coincides with a growing debate about whether spending by big tech firms like Meta Platforms Inc. and Alphabet Inc. — expected to surpass $1 trillion in coming years — will produce commensurate returns.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nSoftBank’s US depositary receipts rose as much as 7.2%. Nvidia’s stock slid as much as 3.3% in US trading.\nSoftBank is keen to become a leading player in that growing ecosystem, with plans to leverage stakes in sector linchpins from OpenAI to US chip designer Ampere Computing LLC. On Tuesday, SoftBank executives sidestepped questions about whether the industry is fomenting an AI investment bubble, and said the sale had nothing to do with Nvidia itself but was a necessary financing measure.\n“I can’t say if we’re in an AI bubble or not,” Chief Financial Officer Yoshimitsu Goto said during an earnings conference Tuesday. SoftBank sold Nvidia “so that the capital can be utilized for our financing,” he added, without elaborating.\nSoftBank has sold out of Nvidia once before, in 2019. The company resumed buying small stakes in Nvidia in 2020 — two years before the advent of ChatGPT ignited a historic rally. It disclosed that it increased its stake in the US chipmaker to around $3 billion at the end of March. It’s done well just on that measure: Nvidia has gained more than $2 trillion of market value since.\nThat rally, along with its investment in OpenAI, helped prop up SoftBank’s bottom line. The Japanese company reported a surprise net income of ¥2.5 trillion ($16.2 billion) in its fiscal second quarter, far outrunning the average of analyst estimates of ¥418.2 billion. OpenAI’s value has risen $14.6 billion since SoftBank invested, Goto said.\nSoftBank is on track to report its highest annual profit since 2020, Bloomberg Intelligence analyst Kirk Boodry said. “The sale of $5.8 billion in Nvidia shares highlights the company’s access to liquidity as it continues its AI investment program,” he added.\nSon’s initiatives — which include the Stargate data center rollout as well as a $1 trillion AI manufacturing hub in Arizona — have seen the billionaire court US President Donald Trump, as well as the chiefs of Taiwan Semiconductor Manufacturing Co. and South Korean conglomerates. SoftBank even explored a takeover of US chipmaker Marvell Technology Inc. earlier this year.\nSon’s company now boasts a portfolio that includes some of the world’s most sought-after names in AI, including OpenAI, ByteDance Ltd. and Perplexity AI Inc. Those stakes boosted SoftBank’s paper gains and helped drive a 78% surge in its share price over the three months ending in September — its best such performance since the December quarter of 2005.\nThe company also announced a 4-for-1 stock split that will take place Jan. 1, a move that helps make its stock accessible to Japanese retail investors.\nThe challenge will be to balance the financing behind a flurry of deals it’s signed, as well as any new initiatives Son may take on in coming months.\nThrough its Vision Fund 2, SoftBank will now invest the full $22.5 billion it’s promised OpenAI in December and remove the preconditions it had previously set. SoftBank has plans to acquire US chip designer Ampere Computing LLC for $6.5 billion and has agreed to buy ABB Ltd.’s robotics arm for $5.4 billion.\nThe company expanded a margin loan using its Arm Holdings Plc shares to $20 billion from $13.5 billion, of which $11.5 billion remains available. It’s also obtained a bridge loan of $8.5 billion to fund its injection into OpenAI, as well as another bridge loan for the Ampere deal, it said.\n“The simple trade was to buy SoftBank for cheap exposure to Arm shares and a broader AI and tech mix. That idea has more than delivered – the stock’s more than doubled, far outpacing the modest rise in NAV,” according to a Finimize Research note published on Smartkarma ahead of the earnings release, referring to SoftBank’s net asset value.\n“But now the discount’s mostly closed, so SoftBank isn’t a ‘cheap’ way in anymore. So on that basis, it’s likely a good time to sell and take your profits,” it said.\n--With assistance from Vlad Savov, Peter Elstrom and Mark Anderson.\n(Updates with shares from the third paragraph.)\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nHow an $11 Billion Beauty Company Built a Suburban Empire\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\n©2025 Bloomberg L.P.",
    "tags": [
        "NVDA",
        "OPAI",
        "PCT:3.3",
        "PCT:7.2",
        "PCT:78",
        "PVT",
        "SFTBF",
        "SFTBY",
        "T",
        "USD:$5.83"
    ]
}