{
    "title": "Arrivederci, Spaghetti? US Plans Massive 107% Tariff on Italian Pasta",
    "url": "https://finance.yahoo.com/news/arrivederci-spaghetti-us-plans-massive-100100275.html",
    "date": "2025-11-11T10:01:00.000Z",
    "author": "Stacey Leasca",
    "source": "finance.yahoo.com",
    "content_snippet": "MARCO BERTORELLO/AFP via Getty Images\nItalian pasta imports are facing a massive 91.74% tariff as part of an anti-dumping investigation by the U.S. Commerce Department, following complaints from Ameri...",
    "full_content": "MARCO BERTORELLO/AFP via Getty Images\nItalian pasta imports are facing a massive 91.74% tariff as part of an anti-dumping investigation by the U.S. Commerce Department, following complaints from American producers.\nThe new duties could double the cost of pasta for American consumers and significantly affect major Italian exporters such as Pasta Garofalo, La Molisana, and Rummo.\nItalian officials and industry leaders are calling the measures unfair, warning that they could lead to a halt in exports and an increase in imitation “Italian-sounding” products in the U.S.\nThat penne, spaghetti, and rigatoni fresh from Italy that you love so much? You're probably going to need to spend a lot more to get it in the U.S.\nPresident Donald Trump's decision to raise tariffs on imported goods worldwide has wreaked havoc on grocery store aisles, with prices for everything from coffee to herbs fluctuating depending on the President's mood toward any particular world leader that day. And,as The Washington Postrecently reported, even Trump's seemingly close allies, like Italy's Prime Minister Giorgia Meloni, aren't immune from these fluctuations.\nAs the paper explained, the U.S. has already applied a 15% tariff on goods exported from the European Union to the U.S. Now, Italian pasta makers are facing a new 91.74% tariff, all because of a concept known as \"dumping.\" Altogether, the total tariff rate is an astonishing 106.7%.\nAccording toTime, \"dumping\" is when an exporter sends its product to a foreign market at a price lower than it sells domestically, which experts consider unfair because it undercuts local competition. Time noted that the U.S. isn't alone in punishing dumping, with the EU outlining its own anti-dumping measures. \"These measures are usually in the form of an 'ad valorem' duty,\" theEuropean Commissionexplained. \"Other measures that can be applied include a fixed or specific amount of duty or, in some cases, a minimum import price.\"\nThis embedded content is not available in your region.\nThis isn't the first time Italian pasta companies have been accused of dumping in the U.S. TheWall Street Journalexplained that this has been happening regularly since the mid-'90s. So much so that Italian pasta makers have simply considered it a part of doing business with the U.S. However, what's different now is the potential added cost, with tariffs historically in the single or low double digits.\nAnd now, the U.S. Commerce Department is investigating more than a dozen of Italy's largest pasta producers for dumping, following a request from two U.S. manufacturers for a review. According to Time, this includes Pasta Garofalo and La Molisana, the two largest Italian pasta exporters. While their information was compulsory, the department also reviewed sales information voluntarily provided by 11 other companies: Agritalia, Aldino, Antiche Tradizioni Di Gragnano, Barilla, Gruppo Milo, Pastificio Artigiano Cav. Giuseppe Cocco, Pasta Rummo, Pastificio Chiavenna, Pastificio Liguori, Pastificio Sgambaro, and Pastificio Tamma.\nRelated:Experts Say Trump’s Tariffs Could Put Healthy Eating Out of Reach for Many Americans\nIn September, the department released its preliminary results, noting that neither of the two major pasta makers provided the \"information requested by Commerce,\" and that they were therefore deemed \"to have been uncooperative,\" Time said (an allegation both companies deny). Both companies have denied the claim, and the Commerce Department has until January 2, 2026, to issue its final results.\nThough neither pasta company appears to be going down without a fight. \"Why don't they want Italian products to enter America?\" Cosimo Rummo, chief executive of Pasta Rummo, one of the companies also penalized, said during a World Pasta Day celebration, according to The Washington Post. \"I believe this is totally inappropriate because Italy and America are brothers. It is an excuse not to let Italian products in.\"\n\"We need help, because a large part of our companies are involved. With a duty so high, it means that all these companies will not export until the new review will be done,\" Margherita Mastromauro, president of Unione Italiana Food, additionally toldEuroNews.\nFor the average consumer, these new tariffs could cause the price of your pasta night to skyrocket. According to Italy's largest agricultural organization, Coldiretti, it would \"double the cost of a plate of pasta for American families,\" while also \"paving the way for 'Italian-sounding' products  and severely impacting Italian companies in the sector.\"\nColdiretti's president, Ettore Prandini,added in a statementthat pasta makers must \"defend and promote the pasta supply chain, both in the U.S. and in Italy.\" He added, \"Just as we demand a fair price for Italian wheat, we believe it is essential to guarantee a fair value for pasta. The American accusations of dumping are unacceptable and instrumental to Trump's plan to move production to the United States.\"\nRead the original article onFood & Wine",
    "tags": [
        "PCT:106.7",
        "PCT:15",
        "PCT:91.74"
    ]
}