{
    "title": "US Health Care Premium Spikes to Squeeze Main Street Businesses",
    "url": "https://finance.yahoo.com/news/us-health-care-premium-spikes-120000659.html",
    "date": "2025-11-11T17:22:21.000Z",
    "author": "Caitlin Reilly",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) — Gladys Harrison, owner of Big Mama’s Kitchen and Catering, was already struggling to cover rising food prices for ingredients at the Omaha restaurant that’s been in her family for two ge...",
    "full_content": "(Bloomberg) — Gladys Harrison, owner of Big Mama’s Kitchen and Catering, was already struggling to cover rising food prices for ingredients at the Omaha restaurant that’s been in her family for two generations. Then, she got notice last month that her health-care premiums will nearly quadruple next year.\n“It’s all of the things happening at once,” said Harrison, 58, one of 24 million Americans who rely on the Affordable Care Act marketplace for insurance. She’s considering picking up more shifts at the restaurant to cover her monthly premium — and may have to cut other employees’ hours to make ends meet in a tough economy.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nSmall business owners like Harrison, along with their workers and people who are self-employed, make up nearly half of those enrolled in ACA plans, according to KFF, a nonpartisan health research foundation. Premiums for those plans are expected to jump 114% on average in the new year, when covid-era tax credits expire.\nThe subsidies — which had been at the center of the fight over the US government shutdown — aren’t part of a deal winding through Congress to end the 42-day government shutdown. A faction of Senate Democrats broke ranks with the rest of the party to join Republicans to advance the bill to fund the government.\nIn exchange, they got the promise of a vote on legislation to renew the health-care tax subsidies stemming from former President Barack Obama’s signature health care law before they expire, but it’s far from certain that bill becomes law.\nAbsent action by Congress, Harrison will face a sharp spike in health care costs. She pays just $23 a month now, thanks to the expiring subsidies. After paying medical bills, a mortgage, car loan and covering everyday costs like groceries each month, there isn’t a lot left over. Tariffs have also increased the cost of ingredients for her business, whittling down her margins.\n“Four times that is a lot,” she said of her increased premium.\nSeveral small business owners said less affordable ACA plans will make it harder to compete for talent with larger companies that offer employer-provided health plans. The higher costs for them personally could also force them to hire fewer people, shrink their payroll or even consider shuttering their businesses entirely and seeking other employment themselves. A hit to the small business sector could echo across the economy.\nKerri VanMeveren, who owns Amazing Traditions, a government contracting business in Belton, Missouri, said her $129 monthly Obamacare premium will jump to about $700 a month next year. VanMeveren, who is in her 50s with a history of blood clots, said the ACA has been a lifeline for the 11 years she’s run her business.\n“If I don’t have health insurance come January 1 because I can’t afford the premiums, I may very well have to look at closing my business,” VanMeveren said. That would have consequences not only for VanMeveren, but also for the five to 30 people she employs, depending on the needs of government contracts she’s able to secure.\nJonathan Gruber, chairman of the Massachusetts Institute of Technology’s economics department, said a blow to the small business sector could have wider implications for the broader economy.\n“Part of the reason we like small, new entrepreneurial firms is because they’re engines of economic growth,” said Gruber, who helped design the ACA. Expensive Obamacare premiums could also discourage people from leaving bigger employers to start their own companies.\n“That’s costly for the economy,” he said.\nHarrison, who in 2020 ran in the Democratic primary for her Nebraska congressional district, sees an immediate impact on her business and the broader economy.\n“I can’t hire as many people as I would like to,” she said. “I have to cut folks’ hours. That’s less money coming in for their families.”\nJohn Arensmeyer, founder and CEO of the left-leaning Small Business Majority, said the expiration of the enhanced premium tax credits would have a major impact on small businesses. He estimated about a fifth of the approximately 60 million people tied to the sector, who either own or work for small businesses, are enrolled on ACA exchanges.\n“It’s another pressure on small businesses that may cause them to lose employees or go out of business or quit and do something else,” he said. “If you’re putting financial pressure on small businesses, it’s going to reduce their ability to contribute to the economy and to employ people.”\nThe expiring Covid-era subsidies cap premiums at 8.5% of household income for those making more than four times the poverty level. That annual income cutoff amounted to just under $63,000 for an individual and almost $129,000 for a family of four this year. People making less than that will continue to get the less generous subsidy in place before the pandemic.\nOf those who will entirely lose their subsidies, 38% are small business owners and self-employed people, a number that Cynthia Cox, a vice president at KFF, calls disproportionate to their share of the general population.\nIf they lose the tax credits and can no longer afford to purchase insurance for themselves, they have a few options. One is purchasing a small group health insurance plan for them and their employees, which can be expensive and “may or may not be possible,” she said.\n“The other option would be to leave their small business or their self-employment for a larger company,” Cox said.\nDespite the high stakes for the sector, small businesses say they’ve had a difficult time breaking through on this issue to Republicans in Congress. Many Republicans, who are traditionally in tune with the business sector, are critical of Obamacare and resistant to extending the subsidies.\nRhett Buttle, a senior adviser to the left-leaning Small Business for America’s Future, said one challenge facing the sector politically is that the impact of the expiring subsidies will vary by the size and type of the business, making it hard to speak with a unified voice in Washington.\nSmall retailers with slim margins are likely to feel the effects of disappearing premium subsidies more acutely than larger outfits, such as a manufacturer or consulting group, he said.\nMuch of the health care conversation has also focused on individual consumers.\n“I’m not sure we’ve done a good enough job of actually talking about the economic impact on small businesses,” Buttle added. “There’s more work to be done both on the Hill and the administration.”\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nHow an $11 Billion Beauty Company Built a Suburban Empire\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\n©2025 Bloomberg L.P.",
    "tags": [
        "ACR:CEO",
        "PCT:114",
        "PCT:38",
        "PCT:8.5"
    ]
}