{
    "title": "Layoffs are piling up, raising worker anxiety. Here are some companies that have cut jobs recently",
    "url": "https://finance.yahoo.com/news/layoffs-piling-raising-worker-anxiety-140614373.html",
    "date": "2025-11-27T09:28:45.000Z",
    "author": "WYATTE GRANTHAM-PHILIPS",
    "source": "finance.yahoo.com",
    "content_snippet": "NEW YORK (AP) — It’s a tough time to belooking for a job.\nAmid wider economic uncertainty, some analysts have said that businesses are at a“no-hire, no fire”standstill. That's caused manyto limit new ...",
    "full_content": "NEW YORK (AP) — It’s a tough time to belooking for a job.\nAmid wider economic uncertainty, some analysts have said that businesses are at a“no-hire, no fire”standstill. That's caused manyto limit new workto only a few specific roles, if not pause openings entirely. At the same time, sizable layoffs have continued to pile up — raising worker anxieties across sectors.\nSome companies have pointed to rising operational costs spanning from U.S. President Donald Trump's barrage of newtariffsand shifts in consumer spending. Others cite corporate restructuring more broadly — or are redirecting money toartificial intelligence.\nFederal employees have encountered additional doses of uncertainty, impacting worker sentiment around the job market overall. Shortly after Trump returned to office at the start of the year, federal jobs werecut by the thousands. And the record43-day government shutdownalso left manywithout paychecks.\nThe impasse put key economic data on hold, too. In a delayed report released last week, the Labor Department said U.S. employersadded a surprising 119,000 jobsin September. But unemployment rose to 4.4% — and other troubling details emerged, including revisions showing the economy actually lost 4,000 jobs in August. The shutdown also resulted in holes for more recent hiring numbers. The government says itwon’t releasea full jobs report for October.\nHere are some of the largest job cuts announced recently:\nIn November, HP (HP) said this week it expected to lay off between 4,000 and 6,000 employees. The cuts are part of a wider initiative from the computer maker to streamline operations, which includes adopting AI to increase productivity. The company aims to complete these actions by the end of the 2028 fiscal year.\nAlso in November, Verizon (VZ) beganlaying off more than 13,000 employees. In a staff memo announcing the cuts, CEO Dan Schulman said that the telecommunications giant needed to simplify operations and “reorient” the entire company.\nGeneral Motors (GM) willlay off about 1,700 workersacross manufacturing sites in Michigan and Ohio in late October, as the auto giant adjusts to slowing demand forelectric vehicles. Hundreds of additional employees arereportedlyslated for “temporary layoffs\" at the start of next year.\nIn long-awaited cuts just months after completingits $8 billion merger with Skydance, Paramount (PSKY) plans to lay off about 2,000 employees — about 10% of its workforce. Paramount initiatedroughly 1,000 of those layoffsin late October, according to a source familiar with the matter.\nIn November, Paramount also announced plans to eliminate 1,600 positions as part of divestitures of Televisión Federal in Argentina and Chilevision in Chile. And the company said another 600 employees had chosen voluntary severance packages as part of a coming push to return to the office full-time.\nAmazon (AMZN) said in October that it willcut about 14,000 corporate jobs, close to 4% of its workforce, as the online retail giant ramps up spending on AI while trimming costs elsewhere. A letter to employees said most workers would be given 90 days to look for a new position internally.\nUnited Parcel Service (UPS)has disclosed about 48,000 job cutsthis year as part of turnaround efforts, which arrive amid wider shifts in the company's shipping outputs. UPS also closed daily operations at 93 leased and owned buildings during the first nine months of this year.\nTarget (TGT) in October said it wouldeliminate about 1,800 corporate positions, or about 8% of its corporate workforce globally. The retailer said the cuts were part of wider streamlining efforts.\nIn mid-October, Nestlé (NESN.SW,NSRGY) said it would becutting 16,000 jobs globally— as part of wider cost cutting aimed at reviving its financial performance amid headwinds like rising commodity costs and U.S. imposedtariffs. The Swiss food giant said the layoffs would take place over the next two years.\nIn September, Lufthansa (LHA.DE) said it would shed 4,000 jobs by 2030 — pointing to the adoption ofartificial intelligence, digitalization and consolidating work among member airlines.\nAlso in September, Danish pharmaceutical company Novo Nordisk (NVO,NOVO-B.CO)said it would cut 9,000 jobs, about 11% of its workforce. The company — which makes drugs like Ozempic and Wegovy — said the layoffs were part of wider restructuring, as it works to sell more obesity and diabetes medications amid rising competition.\nOil giant ConocoPhillips (COP) announced plans in September tolay off up to a quarter of its workforce, as part of broader efforts from the company to cut costs. Between 2,600 and 3,250 workers were expected to be impacted, with most layoffs set to take place before the end of 2025.\nIntel (INTC) has moved to shed thousands of jobs — with the struggling chipmaker working to revive its business. In July, CEO Lip-Bu Tan said Intel expected toend the year with 75,000 “core” workers, excluding subsidiaries, through layoffs and attrition. That’s down from 99,500 core employees reported the end of last year. The company previously announced a15% workforce reduction.\nIn May,Microsoft(MSFT)began laying off about 6,000 workersacross its workforce. And just months later, the tech giant said it would becutting 9,000 positions— marking its biggest round of layoffs seen in more than two years. The company has cited “organizational changes,” but the labor reductions also arrive as the company spends heavily on AI.\nIn June, Procter & Gamble (PG) said it wouldcut up to 7,000 jobsover the next two years, 6% of the company’s global workforce. The maker of Tide detergent and Pampers diapers said the cuts were part of a wider restructuring — also arriving amid tariff pressures.",
    "tags": [
        "ACR:CEO",
        "HPQ",
        "MSFT",
        "NVO",
        "PCT:10",
        "PCT:11",
        "PCT:15",
        "PCT:4",
        "PCT:4.4",
        "PCT:6",
        "PCT:8",
        "PG",
        "UPS"
    ]
}