{
    "title": "BigBear (BBAI) Sheds Gains on Profit-Taking",
    "url": "https://finance.yahoo.com/news/bigbear-bbai-sheds-gains-profit-142317311.html",
    "date": "2025-11-27T14:23:17.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. BigBear.ai Holdings Inc. (NYSE:BBAI) is one of the worst-performing stocks on Wednesday.\nBigBear dropped its share prices by 2.75 ...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. BigBear.ai Holdings Inc. (NYSE:BBAI) is one of the worst-performing stocks on Wednesday.\nBigBear dropped its share prices by 2.75 percent on Wednesday to close at $6.02 apiece as investors continued to take profits following a double-digit surge earlier this week.\nWednesday’s session marked its second day of decline amid profit-taking, following an easy 16 percent gain on Monday over news that it was expanding its operations in Malaysia.\nAccording to BigBear.ai Holdings Inc. (NYSE:BBAI), it signed a memorandum of understanding with Pahang Aerospace City Development Berhad and its established partners, Easy Lease, and Vigilix Technology Investment LLC, to accelerate the development and integration of advanced technologies throughout the Pahang Aerospace City (PAC).\nBigBear.ai Holdings Inc. (NYSE:BBAI) will support the initiative through offering solutions on AI-driven border operations to help advance regional and international security.\n“By integrating mission-ready AI, predictive analytics, and secure orchestration technologies, together we can help Malaysia build a first-of-its-kind aviation, transit, and space ecosystem that strengthens both national economic growth and regional security,” said BigBear.ai Holdings Inc. (NYSE:BBAI) CEO Kevin McAleenan.\n“This collaboration represents an exciting step forward for innovation and for BigBear.ai’s engagement in Southeast Asia,” he added.\nPAC is a significant gateway for air, land, and sea passenger transport, and its development is expected to attract more domestic and foreign investments.\nWhile we acknowledge the potential of BBAI as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:CEO",
        "BBAI",
        "USD:$6.02"
    ]
}