{
    "title": "Russians Are Starting to Feel Real Economic Pain From Putin’s War",
    "url": "https://finance.yahoo.com/news/russians-starting-feel-real-economic-180000653.html",
    "date": "2025-11-27T08:04:37.000Z",
    "author": "Bloomberg News",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --As President Vladimir Putin’s war on Ukraine enters a fourth winter, Russians are having to come to grips with its growing impact on nearly every aspect of their daily lives.\nDozens of r...",
    "full_content": "(Bloomberg) --As President Vladimir Putin’s war on Ukraine enters a fourth winter, Russians are having to come to grips with its growing impact on nearly every aspect of their daily lives.\nDozens of regions in central and southern Russia are now feeling the war’s proximity as drones and sometimes missiles hit energy sites and residential buildings. Air raid sirens wail almost every night, offering a constant — and very public — reminder of how the conflict is encroaching.\nMost Read from Bloomberg\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nBeyond the front lines, the rest of Russia, Moscow included, has started to feel the economic toll. From households cutting back on food spending to struggling steel, mining and energy companies, the country’s economic engine is showing multiple fractures, and the earlier resilience spurred by massive fiscal stimulus and record energy revenues is being tested.\nThe degree of suffering is incomparable to that of Ukraine, and is in any case unlikely to prompt Putin to end the war, yet it underlines the ever-higher cost being extracted for his decision to launch the all-out invasion in February 2022.\nThe fallout is hitting just as the US applies pressure to curb oil and gas revenue flowing to Moscow as part of the Trump administration’s flurry of activity aimed at reaching a ceasefire. Momentum for a deal is growing, with talks shifting to Moscow and US-Russian negotiations known to have been working behind the scenes on a package that would give Kremlin the sanctions relief it wants.\n“Based on the overall economic indicators, it would be in Russia’s best interest to stop the war now,” said Alexander Gabuev, Berlin-based director of the Carnegie Russia Eurasia Center. “Still, to want to end the war, one must see the edge of the cliff. Russia is not there yet.”\nIn the absence of that realization, things are set to get worse for Russia’s population before they can hope to improve.\n“Prices are now rising faster than wages,” said Elena, 27, an event company manager from the Moscow region. Bloomberg withheld her surname to protect her identity in case of repercussions. She’s changed her shopping habits, buying fewer clothes and more domestic brands since imports have become too expensive.\nThat’s a sharp contrast with earlier in the war, when gross domestic product was expanding on the back of military-linked investments that drove an almost 20% growth in wages in 2024, boosting consumer demand though also contributing to inflation.\nRussia’s central bank hiked rates to a record 21% in October last year to cool inflation and slow an overheated economy, but even as borrowing costs have eased the economy is increasingly showing the delayed impact of monetary tightening. In the process, deeper imbalances have been exposed in a country that’s retooled for war while still supporting a civilian economic sector.\nInflation eased to about 6.8% in early November, but the key reason is weakening consumer demand, the Center for Macroeconomic Analysis and Short-Term Forecasting, headed by the brother of Russia’s defense minister, said in its latest report. Notably, Russians are cutting back on food, according to SberIndex, lender Sberbank’s open-data platform that tracks incomes, spending and business activity in real time.\n“The average bill for weekly grocery purchases has more than doubled in recent years,” said Denis, 40, a manager from Tambov, central Russia. Forced to reconsider spending, his family now buys fewer fruits and vegetables.\nSales of milk, pork, buckwheat and rice dropped by 8–10% in September and October, according to analysis by Kommersant newspaper. X5 Group, Russia’s largest grocery chain, posted increased revenue in the third quarter largely on the back of inflation, but its net income dropped by almost 20%, reflecting weaker demand and higher costs.\nRussia’s retail sector is undergoing a major shake-up. Fashion retailers made up 45% of all store closures in the third quarter, with nearly every second outlet shuttering, local media report. According to government-owned Rossiyskaya Gazeta newspaper, the electronics market is experiencing its sharpest drop in demand in 30 years as buyers postpone major purchases.\nCar sales shrank by almost a quarter in the first nine months of the year, hurt by high borrowing costs and increases in a state tax imposed for recycling, driving up prices especially for imported and electric vehicles as the government seeks to boost budget revenue and support domestic automakers.\nThen there’s the direct impact of Ukrainian military action. Ukrainian drones now strike oil refineries and ports from the Black Sea to the Baltic coast with seeming impunity, sometimes traveling as far as 2,000 miles deep into Russia to targets in Siberia.\nThose strikes have exacerbated a crisis in the domestic fuel market, leading to a spike in prices from the end of August. While gasoline prices inched lower in November, they remain high and shortages are still being felt in some regions.\nMany analysts still expect modest growth this year and next, but the Center for Strategic Research, a Moscow-based think tank, concluded on Nov. 18 that “there is almost no chance left to avoid a recession,” with output having declined in more than half Russian industries.\nThe steel industry is going through a crisis, with total consumption down 14% this year, according to top steelmaker Severstal PJSC. Demand for steel in construction declined 10%, while in machinery it slumped 32%. Coal mining is facing its worst situation in a decade with major companies cutting output.\nThe banking sector is faring little better: The share of troubled corporate debt rose to 10.4% in the second quarter to 9.1 trillion rubles ($112 billion), while in retail it grew to 12%, the Bank of Russia said in a report in September.\nEconomic growth slowed to 0.6% in the third quarter, missing estimates, while the budget deficit hit 1.9% of GDP in October and the Finance Ministry expects it to grow to 2.6% of GDP by year-end.\nAll-important oil and gas revenue dropped by over a fifth in January-October from the same period a year ago to 7.5 trillion rubles, according to Bloomberg calculations based on Finance Ministry data. Lower crude prices, sanctions and a stronger currency all meant that the nation’s producers received fewer rubles for every barrel of oil sold.\nThat was before the US, exasperated at Putin’s refusal to engage with peace efforts, unexpectedly moved in October to sanctioned Russia’s top oil producers, Rosneft PJSC and Lukoil PJSC.\nWhile the strains are unlikely to divert Putin from his war goals, he’s been actively trying to ensure that the US doesn’t increase the pressure on the Russian economy. In October, when President Donald Trump was mulling sending longer-range Tomahawk missiles to Kyiv and publicly voicing his frustrations with the Russian leader, Putin reached out to dangle the prospect of more peace negotiations. Indeed, he was encouraged and advised on that call by Trump’s own envoy, Steve Witkoff.\nAbsent a deal, Russian fuel shipments in the first half of November declined to the lowest since the invasion of Ukraine began. Meanwhile, even Russia’s trade boom with China has stalled.\n“The immunity of the Russian economy has been severely weakened,” said Oleg Buklemishev, head of the Center for Economic Policy Research at Lomonosov Moscow State University. “A systemic crisis may not occur in 2026, but a steady deterioration in economic conditions will continue.”\nAs the deficit widens, the government is increasing debt through expensive domestic sales. Russia’s Finance Ministry plans a debut yuan-denominated sovereign bond sale on the domestic market, with orders scheduled to open Dec. 2.\nValue-added tax is set to rise next year and apply to a broader base, affecting smaller businesses and ultimately consumers. That’s seen adding 1.2 trillion rubles to state coffers. A technology levy on electronic components and devices is coming, as is an increase of the tax due when buying a car.\nAfter Putin promised Russians no further tax increases in 2023, the Kremlin has instructed media not to mention his name in reports about the new levies, opposition outlet Meduza, which is banned in Russia, reported.\n“If Russian authorities want the economy to keep functioning normally, special military operations must be wound down,” said Buklemishev, using Putin’s term for the war. “The realization they need to make the choice has not fully come, but the warning bells are already ringing.”\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "ACR:GDP",
        "CL",
        "F",
        "LKOH.ME",
        "PCT:0.6",
        "PCT:1.9",
        "PCT:10",
        "PCT:10.4",
        "PCT:12",
        "PCT:14",
        "PCT:2.6",
        "PCT:20",
        "PCT:21",
        "PCT:32",
        "PCT:45",
        "PCT:6.8",
        "ROSN.ME",
        "SBER.ME"
    ]
}