{
    "title": "Gas prices fall below $3 per gallon in more than half of US states to kick off Thanksgiving holiday",
    "url": "https://finance.yahoo.com/news/gas-prices-fall-below-3-per-gallon-in-more-than-half-of-us-states-to-kick-off-thanksgiving-holiday-170628547.html",
    "date": "2025-11-27T12:14:23.000Z",
    "author": "Ines Ferré",
    "source": "finance.yahoo.com",
    "content_snippet": "Gasoline prices are easing as Thanksgiving arrives and travel for the holiday weekend underway.\nWhile the national average remains slightly above $3 per gallon, the average price per gallon in more th...",
    "full_content": "Gasoline prices are easing as Thanksgiving arrives and travel for the holiday weekend underway.\nWhile the national average remains slightly above $3 per gallon, the average price per gallon in more than half of US states now falls below that mark, and a handful of stations have even offered regular unleaded for $1.99.\nThe national price of gasoline sat just below $3.03 per gallon on Thursday, about 5 cents lower than one year ago,according to AAA data.\nCoastal states like California and Washington still carry prices above $4 per gallon, but more than 30 states — mostly the Midwest and Gulf Coast areas — are seeing prices average less than $3 per gallon.\nLower seasonal demand, less expensive winter blends, and falling oil prices are all expected to continue to put downward pressure on the cost of gasoline.\n\"I think it may take another week for us to get there, but when it does, we may [see] most of the rest of the year at or below that $3 per gallon mark with some of the lowest prices ... in the last four years,\" Patrick De Haan, head of petroleum analysis at GasBuddy, told Yahoo Finance.\nGasBuddy data recently spotted four stations in Midwest City, Oklahoma, where prices stood at $1.99 per gallon.\n\"It's the first time that we've seen what I'll call sustainable sub-$2 prices since 2021,\" De Haan said. \"That's a sign of what we could see more of. As we get closer to Christmas, I do expect the national average to continue falling in the weeks ahead.\"\nRead more:Find the best credit cards for gas in 2025\nCrude oil prices have been on a downward trend heading into the end of the year.\nFutures for Brent (BZ=F), the global oil benchmark, and West Texas Intermediate (CL=F) are on pace to book a fourth monthly decline in a row in November, for the longest losing run since 2023. In holiday trading on Thursday, crude prices were little changed with the focus on the weekend's OPEC+ meeting and a potential peace plan between Ukraine and Russia, a major oil producer.\n\"The next 40-80 days probably represent the most inhospitable climate for US gasoline prices of the season, and the ongoing peace initiative for Ukraine/Russia is leading to some liquidation in crude,\" Tom Kloza, chief oil analyst at Gulf Oil, told Yahoo Finance.\nBrent and WTI are both down more than 16% since the start of the year.\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on X at@ines_ferre.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "BZ",
        "CL",
        "F",
        "PCT:16",
        "RB",
        "USD:$1.99",
        "USD:$3.03"
    ]
}