{
    "title": "Prosper Stars & Stripes Closed Its Short Position in Grid Dynamics Holdings (GDYN) in Q3",
    "url": "https://finance.yahoo.com/news/prosper-stars-stripes-closed-short-142125055.html",
    "date": "2025-11-27T14:21:25.000Z",
    "author": "Soumya Eswaran",
    "source": "finance.yahoo.com",
    "content_snippet": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & S...",
    "full_content": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & Stripes achieved a net return of +9.8%. In comparison, its long/short equity hedge fund peer group, as indicated by the HFRX Equity Hedge (Total) Index (the “HFRX”), reported a total return of +3.8%. Additionally, the long-only small-cap Russell 2000 Index (the “Russell”) had a total return of +12.4%. Year to date, the fund returned +8.6% compared to a total return of +13.6% for the HFRI and +10.4% for the Russell. The Composite’s long book delivered strong performance in both the third quarter and year-to-date 2025. The short book detracted from performance both in the third quarter and year-to-date in 2025. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its third-quarter 2025 investor letter, Prosper Stars & Stripes highlighted stocks such as Grid Dynamics Holdings, Inc. (NASDAQ:GDYN). Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) is a technology company that provides technology consulting, platform and product engineering, and analytics services. The one-month return of Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) was 7.04%, and its shares lost 54.39% of their value over the last 52 weeks. On November 26, 2025, Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) stock closed at $8.67 per share, with a market capitalization of $735.261 million.\nProsper Stars & Stripes stated the following regarding Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) in its third quarter 2025 investor letter:\n\"Grid Dynamics Holdings, Inc.(NASDAQ:GDYN) was the second-best contributor in the short book during Q3 2025. The company provides IT consulting, platform and product engineering, and advanced analytics to Fortune 500 companies, supporting their digital transformations. Unsurprisingly, IT consulting has historically been a stable growth industry, with Consulting Quest estimating 5-8% CAGR pre-COVID. However, the advent of ChatGPT in late 2022 introduced a disruptive variable to this consistency. As part of our process, we look for structural changes in industries to identify short opportunities. We viewed Grid Dynamics as vulnerable to disruption – it was also trading at approximately 16x FY24 EBITDA. During the quarter, we believe several factors contributed to the stock’s weakness, including client spending apprehension amid tariff uncertainty and broader macro challenges. The most significant headwind in our view was the impact of Generative AI on client demand. Combined with customer concentration (top 10 customers account for 56% of revenue), these pressures drove a sharp decline in the stock price. We closed the position shortly after quarter-end.\"\nGrid Dynamics Holdings, Inc. (NASDAQ:GDYN) is not on our list of30 Most Popular Stocks Among Hedge Funds. According to our database, 12 hedge fund portfolios held Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) at the end of the second quarter, down from 20 in the previous quarter. Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) reported another all-time highrevenueof $104.2 million in the third quarter of 2025. While we acknowledge the potential of Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on thebest short-term AI stock.\nInanother article, we covered Grid Dynamics Holdings, Inc. (NASDAQ:GDYN) and shared Loomis Sayles Small Cap Growth Fund's views on the company in the previous quarter. In addition, please check out ourhedge fund investor letters Q3 2025page for more investor letters from hedge funds and other leading investors.\nREAD NEXT:The Best and Worst Dow Stocks for the Next 12 Monthsand10 Unstoppable Stocks That Could Double Your Money.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:EBITDA",
        "ACR:Q3",
        "GDYN",
        "PCT:+10.4",
        "PCT:+12.4",
        "PCT:+13.6",
        "PCT:+3.8",
        "PCT:+8.6",
        "PCT:+9.8",
        "PCT:-8",
        "PCT:54.39",
        "PCT:56",
        "PCT:7.04",
        "USD:$8.67"
    ]
}