{
    "title": "Toyota reports a drop in profit as Trump's taxes hurt Japanese automakers",
    "url": "https://finance.yahoo.com/news/japans-toyota-hurt-president-trumps-081538334.html",
    "date": "2025-11-05T08:15:38.000Z",
    "author": "YURI KAGEYAMA",
    "source": "finance.yahoo.com",
    "content_snippet": "TOKYO (AP) — Toyota (TM) reported a 7% year-on-year drop in profit for April-September on Wednesday, as U.S. President Donald Trump’stariffsslammed Japanese automakers.\nNet profit for the April-Septem...",
    "full_content": "TOKYO (AP) — Toyota (TM) reported a 7% year-on-year drop in profit for April-September on Wednesday, as U.S. President Donald Trump’stariffsslammed Japanese automakers.\nNet profit for the April-September period atToyota Motor Corp.totaled 1.77 trillion yen ($11.5 billion), down from 1.9 trillion yen a year earlier.\nBut the maker of the Camry sedan and Lexus luxury models lifted its profit forecast for the full fiscal year ending in March 2026 to 2.93 trillion yen ($19 billion), citing better vehicle sales and cost-cutting efforts.\nThe forecast would represent a 38.5% drop from the 4.77 trillion yen profit Toyota reported for the last fiscal year. It had earlier forecast 2.66 trillion yen ($17 billion) in profit for this year.\nAlthoughtariffs are hurting its business, Toyota said its sales grew in the U.S. and its home market of Japan.\nU.S. tariffs on Japanese automobiles and auto partsfell to 15% in September from the 27.5% rate Trump initially ordered after returning to the White House. That's much higher than the original 2.5%.\nJapan’s exports to the U.S., including vehicles,have plunged recently.\nBut Toyota said its efforts, such as bigger sales, better model mix and cost cuts, will add more than 900 billion yen ($5.8 billion) to the company’s bottom line in this fiscal year.\n“Despite the impact of U.S. tariffs, we have continued to build upon our improvement efforts such as increasing sales volume, improving costs and expanding value chain profits,” it said in a statement.\nDuring the six months through September, it sold more than 1.5 million vehicles in North America and 970,000 vehicles in Japan.\nFirst half sales grew 5.8% to 24.6 trillion yen ($160 billion). For the latest quarter through September, Toyota reported a 62% rise in profit to 932 billion yen ($6 billion) on 12.38 trillion yen ($80 billion ) in sales, up 8% on year.\n___\nYuri Kageyama is on Threads:https://www.threads.com/@yurikageyama",
    "tags": [
        "T"
    ]
}