{
    "title": "AI fueled the stock market rally. Earnings are now giving it staying power.",
    "url": "https://finance.yahoo.com/news/ai-fueled-the-stock-market-rally-earnings-are-now-giving-it-staying-power-110032880.html",
    "date": "2025-11-11T11:00:32.000Z",
    "author": "Allie Canal",
    "source": "finance.yahoo.com",
    "content_snippet": "After a yeardominated by artificial intelligenceheadlines, Wall Street’s bull case is shifting toward something more fundamental to stocks: earnings power that’s beginning to broaden beyond Big Tech.\n...",
    "full_content": "After a yeardominated by artificial intelligenceheadlines, Wall Street’s bull case is shifting toward something more fundamental to stocks: earnings power that’s beginning to broaden beyond Big Tech.\nMorgan Stanley, UBS, and other major firms are pointing to a clear throughline this earnings season: Profits are strong, margins are stabilizing, and growth,while still concentrated in AI-heavy tech, is beginning to spread.\n“There are clear signs that the earnings recovery is underway and pricing power is firming,” Morgan Stanley equity strategist Mike Wilson wrote in a client note on Monday.\nHis team’s data shows the so-calledMagnificent Sevenare expected to post 23% net income growth for the third quarter, compared with 12% for the rest of the index, but “we see incrementally positive developments for breadth to eventually improve” as revisions trend higher and revenue beats remain well above historical norms, he said.\nFactSet’slatest databacks that up. With more than 90% of S&P 500 (^GSPC) companies reporting, 82% have beaten earnings estimates, while overall profits rose 13.1% year over year. That marks the fourth straight quarter of double-digit growth.\nAdditionally, six of the index’s 11 sectors are posting year-over-year earnings gains, led by Technology (XLK), Financials (XLF), and Consumer Discretionary (XLY) — a modest but notable sign that strength is beginning to broaden.\nStill, some strategists warn that the trend will need to continue from here.\n“Earnings sentiment staged a partial comeback,” RBC Capital Markets strategist Lori Calvasina wrote in a note to clients, adding that while revisions have improved for two straight weeks, they remain “well below” summer highs.\nShe added that “earnings continue to provide a solid foundation for the US equity market due to the resiliency of the C-suite,\" but said the latest recovery “wasn’t enough to challenge the notion that earnings sentiment peaked over the summer.”\nThepullback in stocks last week, she wrote, was “the thunder that can be heard from a storm gathering in the distance” — a sign that investors remain uneasy even as profits hold up.\nThat uneven backdrop points to what Evercore ISI strategist Julian Emanuel called a “K-shaped stock market,” reflecting the outperformance of AI-linked and high-quality growth stocks relative to the broader S&P 500 index.\nStill, he noted, “Participation in the bull market has been solid. This is an important differentiator between today and the dot-com bubble, and a key to further upside.”\nEmanuel sees that dynamicsupporting his 7,750 S&P 500 price target by year-end 2026, arguing that while the top 10 stocks make up roughly 40% of the index, “their valuations are not stretched,” providing both “a backstop and path to further gains.”\nTo that point, UBS justraised its S&P 500 target to 7,500 by the end of 2026, forecasting 14.4% earnings growth that it expects to broaden beyond tech as capital investment “widens out of the narrow tech sector.\"\nThe bank called current AI spending “eye-watering,” comparing it to the mid-1990s buildout that “ushered in a roughly 10-year regime shift in productivity.”\nAllie Canalis a Senior Reporter at Yahoo Finance. Follow her on X@allie_canal,LinkedIn,and email her at alexandra.canal@yahoofinance.com.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "ACR:S&P",
        "GSPC",
        "PCT:12",
        "PCT:13.1",
        "PCT:14.4",
        "PCT:23",
        "PCT:40",
        "PCT:82",
        "PCT:90",
        "SPX"
    ]
}