{
    "title": "BellRing Brands (BRBR): Top Contributor in Stars & Stripes’ Short Book",
    "url": "https://finance.yahoo.com/news/bellring-brands-brbr-top-contributor-141530559.html",
    "date": "2025-11-27T14:15:30.000Z",
    "author": "Soumya Eswaran",
    "source": "finance.yahoo.com",
    "content_snippet": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & S...",
    "full_content": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & Stripes achieved a net return of +9.8%. In comparison, its long/short equity hedge fund peer group, as indicated by the HFRX Equity Hedge (Total) Index (the “HFRX”), reported a total return of +3.8%. Additionally, the long-only small-cap Russell 2000 Index (the “Russell”) had a total return of +12.4%. Year to date, the fund returned +8.6% compared to a total return of +13.6% for the HFRI and +10.4% for the Russell. The Composite’s long book delivered strong performance in both the third quarter and year-to-date 2025. The short book detracted from performance both in the third quarter and year-to-date in 2025. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its third-quarter 2025 investor letter, Prosper Stars & Stripes highlighted stocks such as BellRing Brands, Inc. (NYSE:BRBR). Headquartered in Saint Louis, Missouri, BellRing Brands, Inc. (NYSE:BRBR) provides various nutrition products. The one-month return of BellRing Brands, Inc. (NYSE:BRBR) was -0.81%, and its shares lost 60.36% of their value over the last 52 weeks. On October 28, 2025, BellRing Brands, Inc. (NYSE:BRBR) stock closed at $30.59 per share, with a market capitalization of $3.854 billion.\nProsper Stars & Stripes stated the following regarding BellRing Brands, Inc. (NYSE:BRBR) in its third quarter 2025 investor letter:\n\"BellRing Brands, Inc.(NYSE:BRBR) was the top contributor in the short book during the third quarter of 2025. BellRing is a leader in the convenient nutrition category through its Premier Protein brand. Ready-to-drink (“RTD”) protein shakes account for roughly 80% of BellRing’s sales. As of year-end 2024, Premier held a 23% share of the RTD protein shake market and achieved 21% household penetration, according to the company’s 2024 annual report. The shake category has grown at double-digit rates for the last four years. Further, the category has dependable growth drivers with as consumers seek out healthy food options and GLP-1 weight loss medication users seeking protein to mitigate muscle loss. The issue in our view is rising competition. Premier and its primary competitor Ensure have been around for 28 and 52 years, respectively. Premier’s packaging is dated. Big Consumer Packaged Goods Companies (“CPGs”) like Coca-Cola and PepsiCo are muscling their way into the category looking to capture some of the growth. When BRBR reported Q2 2025 results, the company hinted at rising competitive intensity. The company did not provide an outlook for FY26 further increasing investor fears about share loss. The stock declined a little over 30% on the day it reported. We exited our position shortly thereafter.\"\nBellRing Brands, Inc. (NYSE:BRBR) is not on our list of30 Most Popular Stocks Among Hedge Funds. According to our database, 45 hedge fund portfolios held BellRing Brands, Inc. (NYSE:BRBR) at the end of the second quarter, up from 43 in the previous quarter. While we acknowledge the potential of BellRing Brands, Inc. (NYSE:BRBR) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on thebest short-term AI stock.\nInanother article, we covered BellRing Brands, Inc. (NYSE:BRBR) and shared the list of cheap US stocks to buy according to analysts. In addition, please check out ourhedge fund investor letters Q3 2025page for more investor letters from hedge funds and other leading investors.\nREAD NEXT:The Best and Worst Dow Stocks for the Next 12 Monthsand10 Unstoppable Stocks That Could Double Your Money.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:Q2",
        "ACR:Q3",
        "BRBR",
        "PCT:+10.4",
        "PCT:+12.4",
        "PCT:+13.6",
        "PCT:+3.8",
        "PCT:+8.6",
        "PCT:+9.8",
        "PCT:-0.81",
        "PCT:21",
        "PCT:23",
        "PCT:30",
        "PCT:60.36",
        "PCT:80",
        "USD:$30.59"
    ]
}