{
    "title": "Why Gen Z Is Breaking the Mold on Holiday Spending by Choosing to Save",
    "url": "https://finance.yahoo.com/news/why-gen-z-breaking-mold-122600707.html",
    "date": "2025-11-27T12:26:00.000Z",
    "author": "Brian Acton",
    "source": "finance.yahoo.com",
    "content_snippet": "Gen Z plans to cut holiday spending this year, prioritizing essentials and secondhand goods over gifts.\nThis shift reflects broader financial stress and a growing focus on value-driven, practical spen...",
    "full_content": "Gen Z plans to cut holiday spending this year, prioritizing essentials and secondhand goods over gifts.\nThis shift reflects broader financial stress and a growing focus on value-driven, practical spending.\nGeneration Z shoppers arechanging how they spendthis holiday season. Rising inflation,tariffs, and tighter household budgets are making it harder to feel confident about money, according to recent consumer outlook reports.\nAs a result, many Gen Z consumers plan tospend less on non-essential items, shop secondhand, and spread out their purchases over time.\nGen Z is feelingmounting household financial pressuresgoing into this holiday season. Many report smaller income gains and are relying on their savings more often to cover everyday expenses. Additionally, 25% of Gen Z respondents say their financial situation has worsened compared to a year ago, according to PwC’s 2025 Holiday Outlook survey.\nGen Z's shift toward more cautious,value-focused spendingcouldinfluence holiday sales, product availability, and pricing trends—affecting how all generations shop this season. Understanding these changes can help you plan your budget and make smarter gift-buying decisions.\n“Consumer sentiment in the U.S. remains cautious, with inflation continuing to dominate as the top concern for many households. Rising prices are prompting significant shifts in consumer behavior,” said Kari Alldredge, leader of the consumer-growth network in North America at McKinsey.\nConcerns about money, rising tariffs, and overall financial health could lead Gen Z shoppers to pull back on holiday spending this year, said Allredge.\n“Holiday shopping, which traditionally leans heavily on discretionary spending, is evolving in response to current economic pressures,” she said. “While discretionary items will still play a role in gift-giving, we’re seeing a growing trend toward more practical gifts and essentials. Many consumers are cutting back on discretionary spending andtrading down to lower-cost options, signaling a more frugal and pragmatic approach to managing household budgets.”\nMultiple consumer outlook surveys support the idea that Gen Z’s frugal approach to their finances will influence retail sales this holiday season:\nSpending less.Gen Z consumers expect to reduce their holiday budgets by 23%. By contrast, millennial, Gen X, and baby boomer respondents expected to maintain or even increase holiday spending.\nFocusing on essentials.Over the next three months, Gen Z consumers plan to prioritize spending on essential items like groceries and gas, and cut back on apparel, shoes, and electronics spending.\nBuying secondhand.Gen Z is more likely than other generations to purchase secondhand items as a direct response to tariffs, which could lead to slower sales for retailers dealing in new merchandise.\n“These patterns point to a lasting cultural shift. Gen Z’s emphasis on immediacy, experiences, and value is reshaping not only holiday shopping but also broader consumer trends … [their] spending behavior reflects a careful balance between practicality and indulgence, driven by a strong focus on value-conscious decision-making,” Alldredge said.\nRead the original article onInvestopedia",
    "tags": [
        "PCT:23",
        "PCT:25"
    ]
}