{
    "title": "Rents are falling nationwide. That isn’t helping the sluggish sales market.",
    "url": "https://finance.yahoo.com/news/rents-are-falling-nationwide-that-isnt-helping-the-sluggish-sales-market-130026994.html",
    "date": "2025-11-27T12:59:52.000Z",
    "author": "Claire Boston",
    "source": "finance.yahoo.com",
    "content_snippet": "It hasn’t been easy to be a renter in the last five years. Rental prices surged in the aftermath of the pandemic, outstripping wage growth. But recently, renters have notched a small win: In much of t...",
    "full_content": "It hasn’t been easy to be a renter in the last five years. Rental prices surged in the aftermath of the pandemic, outstripping wage growth. But recently, renters have notched a small win: In much of the country, rents are falling.\nMedian monthly rent on units with up to two bedrooms fell 1.7% year-over-year in October to $1,696, according to Realtor.com. They’re now down about 3.6% from their 2022 peak.\nThose lower prices are a win for many renters, and in some cases, they’re an incentive to keep renting for longer. While rents are falling, the cost of homeownership has continued to climb. Mortgage rates above 6% and near-record high home prices have kept affordability strained, and the “hidden costs” of homeownership — taxes, insurance, and maintenance — are also growing.\nLearn more:Mortgage rate predictions over the next five years\nAn analysis from Zillow and Thumbtack estimated hidden costs alone have climbed to nearly $16,000 a year on average, or an additional $1,325 a month on top of a mortgage.\n“It’s very difficult to leave your rental situation for homeownership,” said Matt Vance, Americas Head of Multifamily Research for commercial real estate firm CBRE. “We’re seeing renewal rates rise as a result.”\nCBRE calculates the current median premium to own a home at 108% versus renting in a multifamily building, meaning the monthly costs of a mortgage payment, taxes, insurance, and maintenance are more than double the cost of renting, on average.\nLearn more:Is now a good time to buy a house?\nThat premium has fallen slightly from its late 2023 peak, but returning to pre-pandemic norms will likely be a years-long process and require a combination of lower mortgage rates, falling home prices, higher incomes, and a jump in rents.\nIn many metro areas, higher rents likely aren’t on the horizon anytime soon due to aggressive construction. Rents have dropped more than 5% in the last year in cities including Denver, Phoenix, Birmingham, Ala., and Jacksonville, Fla., all of which have added thousands of rental units in recent years.\nIn Denver,a boom in apartment constructionmeans many buildings compete to offer concessions, and sometimes outright rent cuts, to tenants new and old. Median rent in the Mile High City and its surrounding suburbs has dropped nearly 6% in the last year, one of the steepest declines in the nation.\n“People have more than enough options to choose from,” said Angie Navo, a real estate agent at Smart City, a Denver-based apartment locating company.\nNavo said that in her first few years in the leasing business, it was common to show clients a unit only for it to lease out to someone else by the end of the tour. That’s no longer the case.\nAs apartments linger on the market for longer, landlords are boosting incentives. Lately, offers of 12 weeks of free rent have been growing more common when eight weeks was once the usual maximum. Some Denverites who have become accustomed to relocating in pursuit of the best rent deals are now receiving offers of free weeks upon renewal as well.\nFree-week incentives, which lower rent on a “net effective” basis only, are the most common strategy for buildings to lure tenants, but Navo has seen some cut base rents outright too. One large building in the city that rented one-bedroom units for around $2,000 during the boom years now lists them for closer to $1,500.\nShe thinks cheaper rents coupled with the rapid run-up in home prices in the Denver region and economic uncertainty are encouraging many people to keep renting. She hears less clients saying they’re closely watching the purchase market or planning to buy in a few years.\n“I just don’t feel like people are super gung-ho at the thought of purchasing a home,” Navo said.\nUltimately, the decision to buy or rent is a complex one, and few people make their choice based solely on the math.\n“If you think about those first-time homebuyers making that buy versus rent decision, most markets are tipped very heavily in favor of renting,” said Danielle Hale, chief economist atRealtor.com. Even so, she said, buying can have its own advantages, like the peace of mind that comes with locking in a fixed monthly payment.\nLearn more:How to buy a house: A guide for first-time home buyers\nHistorically, rents have steadily increased. Even in light of the latest drops, median rents nationwide are up 16.9% from 2019. And they’re still rising in 2025 in a handful of high-demand, low-supply cities like New York and San Jose, Calif., as well as parts of the Midwest.\nIn recent years, no major metro area has seen rents fall as aggressively as Austin, Texas, where a construction boom collided with changing relocation patterns as the pandemic waned. This year alone, rents are down 7.9%.\nBetween April 2021 and mid-2022, when demand was stronger, the rent on Sarah Nazarie’s two-bed, one-bath home near the University of Texas climbed from $2,450 to $2,845. Happy with her location, she stomached the increases, but by last year, she was worried she was overpaying.\nHer first attempt to negotiate her rent down wasn’t successful, but she made another appeal to her landlord this year, armed with statistics showing that rents on comparable properties had dropped between 19% and 23% from peak prices. She proposed a rent decrease to $2,200, which was accepted.\n“They took pity on me, maybe,” said Nazarie, 33, who was unemployed at the time but will soon start a new job at a tech company. “But I think just being someone who’s been there so long, and they’ve never had to worry about me worked in my favor.”\nNegotiations played out similarly for Meagan McArthur, 29, and her husband, who moved to Austin in 2022, around when rental rates topped out. They initially paid $1,988 a month for their apartment in South Congress, along one of the city’s major thoroughfares.\nWhen their lease was up 15 months later, McArthur knew Austin’s rental market looked different, and she was ready to negotiate the $50 rent hike in her renewal offer. Scouring her building’s website, she could see vacancies were high, and her neighbor’s apartment — a mirrored, but otherwise identical, version of her floorplan — was listed for $1,770.\nHer initial proposal to stay put and pay the lower amount was also rebuffed, but things changed when she started the process of moving to the neighboring apartment. When her soon-to-be-vacant unit was listed for the same $1,770 a month, she appealed again and received approval to sign a new lease at the lower price, without needing to move.\nMcArthur, who works as a social media manager and content creator, credits her success to her market research and persistence, plus a history of paying rent on time.\n“The worst that they can say is no, so why not?” McArthur said. “I will try to take a mutually beneficial approach. If there are a lot of vacancies — which this complex at the time had — low occupancy is more negotiating power for you.”\nThis year, McArthur and her husband relocated out of state to be closer to family.\nHer building listed her old apartment for $1,352.\nRead more:Should you rent or buy a home? How to decide.\nClaire Bostonis a Senior Reporter for Yahoo Finance covering housing, mortgages, and home insurance.\nSign up for the Mind Your Money newsletter\nClick here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more\nRead the latest financial and business news from YahooFinance",
    "tags": [
        "CBRE",
        "PCT:1.7",
        "PCT:108",
        "PCT:16.9",
        "PCT:19",
        "PCT:23",
        "PCT:3.6",
        "PCT:5",
        "PCT:6",
        "PCT:7.9"
    ]
}