{
    "title": "Should You Hold Park Aerospace Corp. (PKE)?",
    "url": "https://finance.yahoo.com/news/hold-park-aerospace-corp-pke-141802765.html",
    "date": "2025-11-27T14:18:02.000Z",
    "author": "Soumya Eswaran",
    "source": "finance.yahoo.com",
    "content_snippet": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & S...",
    "full_content": "Prosper Stars & Stripes, a long/short equity fund, recently released its third-quarter 2025 investor letter. A copy of the letter can bedownloaded here. In the third quarter of 2025, Prosper Stars & Stripes achieved a net return of +9.8%. In comparison, its long/short equity hedge fund peer group, as indicated by the HFRX Equity Hedge (Total) Index (the “HFRX”), reported a total return of +3.8%. Additionally, the long-only small-cap Russell 2000 Index (the “Russell”) had a total return of +12.4%. Year to date, the fund returned +8.6% compared to a total return of +13.6% for the HFRI and +10.4% for the Russell. The Composite’s long book delivered strong performance in both the third quarter and year-to-date 2025. The short book detracted from performance both in the third quarter and year-to-date in 2025. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its third-quarter 2025 investor letter, Prosper Stars & Stripes highlighted stocks such as Park Aerospace Corp. (NYSE:PKE). Headquartered in Westbury, New York, Park Aerospace Corp. (NYSE:PKE) is an aerospace company. The one-month return of Park Aerospace Corp. (NYSE:PKE) was 2.78%, and its shares gained 28.52% of their value over the last 52 weeks. On November 26, 2025, Park Aerospace Corp. (NYSE:PKE) stock closed at $19.60 per share, with a market capitalization of $390.154 million.\nProsper Stars & Stripes stated the following regarding Park Aerospace Corp. (NYSE:PKE) in its third quarter 2025 investor letter:\n\"Park Aerospace Corp.(NYSE:PKE) was the second-best contributor in the long book during the third quarter of 2025. Park develops and manufactures hot-melt advanced composite materials used to produce composite structures for the aerospace and defense industries. The company’s operations are anchored by a long-term, sole sourced agreement to produce composite materials for engine nacelles and thrust reverses on the LEAP-1A engine. An engine nacelle houses the engine and provides structural, thermal, and acoustic qualities. The LEAP-1A powers approximately 60-70% of all A320 family of aircraft. Airbus wants to ramp up by building 78 planes per month compared to the current 50 per month average in 2024. Park also has exciting opportunities with Kratos for its Valkyrie loyal wingman program. Park also has a growing position in the aerospace and defense industries that historically has produced EBITDA margins north of 20%. Recently, the company announced a material investment for new capacity for expanded production of ablative compositive components, i.e. solid rocket motor nozzles and heat shields for the Patriot (“PAC-3”) missile systems. The US is down to 25% of their desired levels of supply5 adding to pressure to rapidly increase production. Park management confirmed this point on their last earnings call saying the US Army is looking to increase procurement by 4x. The company’s military sales represented 42% of FY25 sales and we expect this number to increase over the next few years. We valued PKE at 25x FY26 EBITDA which will drive the stock into the mid to high $20s over the next 12 months.\"\nPark Aerospace Corp. (NYSE:PKE) is not on our list of30 Most Popular Stocks Among Hedge Funds. As per our database, 11 hedge fund portfolios held Park Aerospace Corp. (NYSE:PKE) at the end of the second quarter, the same as in the previous quarter. While we acknowledge the potential of Park Aerospace Corp. (NYSE:PKE) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on thebest short-term AI stock.\nIn addition, please check out ourhedge fund investor letters Q3 2025page for more investor letters from hedge funds and other leading investors.\nREAD NEXT:The Best and Worst Dow Stocks for the Next 12 Monthsand10 Unstoppable Stocks That Could Double Your Money.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:EBITDA",
        "ACR:Q3",
        "PCT:+10.4",
        "PCT:+12.4",
        "PCT:+13.6",
        "PCT:+3.8",
        "PCT:+8.6",
        "PCT:+9.8",
        "PCT:-70",
        "PCT:2.78",
        "PCT:20",
        "PCT:25",
        "PCT:28.52",
        "PCT:42",
        "PKE",
        "USD:$19.60"
    ]
}