{
    "title": "CoreWeave Drops After Lowering Outlook on Capacity Crunch",
    "url": "https://finance.yahoo.com/news/coreweave-cuts-forecast-delay-customer-145231611.html",
    "date": "2025-11-11T17:08:25.000Z",
    "author": "Dina Bass, Caroline Hyde and Ed Ludlow",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --CoreWeave Inc. shares tumbled after the company lowered its annual revenue forecast due to a delay in fulfilling a customer contract, a setback in its race to keep up with the artificial...",
    "full_content": "(Bloomberg) --CoreWeave Inc. shares tumbled after the company lowered its annual revenue forecast due to a delay in fulfilling a customer contract, a setback in its race to keep up with the artificial intelligence boom.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nSales in 2025 will be $5.05 billion to $5.15 billion, CoreWeave said Monday during a conference call after reporting third-quarter results. Its forecast range had previously been as high as $5.35 billion.\n“We are affected by temporary delays related to a third-party data center developer who is behind schedule,” Chief Executive Officer Michael Intrator said during the call. Though the fourth-quarter results will reflect the snag, the client affected by the delay has agreed to adjust delivery schedules so “we maintain the total value of the original contract,” he said.\nThe announcement underscored the challenges of meeting the insatiable demand for AI. CoreWeave shares, which have more than doubled this year, fell 13% to $92.03 at 11:47 a.m. in New York, the biggest intraday decline in three months.\nCoreWeave, which held its initial public offering in March, has attracted investors looking to bet on the explosion in artificial intelligence spending. The Livingston, New Jersey-based company is a close partner of AI chipmaker Nvidia Corp. and counts OpenAI and Microsoft Corp. among its customers.\nPart of a group of companies known as neoclouds, CoreWeave rents out access to powerful AI chips. High demand for its services has pushed CoreWeave to rapidly expand its data centers and equip them with the latest gear. It’s also sought to diversify its customer base after years of depending heavily on Microsoft.\nWatch: CoreWeave Deal Spree Goes on After Core Scientific Snub (Video)\nDelays getting more AI computing capacity online are persistent across the industry, Intrator said in an interview. And while CoreWeave was able to preserve the value of the contract, no one is happy about it.\n“Everybody is frustrated — the data center provider is frustrated, we’re frustrated, the client is frustrated,” he said, while declining to name the parties involved. “For that matter, people who are waiting for the next iteration of AI are frustrated.”\nThe company is trying to make sure it has the right staff on site at various projects to catch issues early, Intrator said. “We’re doing all the right things. It’s just a challenging environment.”\nIntrator, who has declined to name either the customer impacted or the supplier facing delays, told Bloomberg Television on Tuesday that the data center supplier is “a good partner” that CoreWeave has worked with since 2018.\n“There’s a stumble, there’s an issue,” he said. “The issue is going to be cleaned up rapidly.” More broadly, CoreWeave is working to diversify suppliers to lessen the impact of any such issues in the future, he said.\nAs the AI data center industry faces constraints on energy, chips and available facilities, the company would also like to see the US government assist in speeding permitting and getting infrastructure hooked up to the power grid, Intrator said in the BTV interview.\nIn its quarterly results, CoreWeave reported that operating income margin was 4%. That missed an average analyst estimate of 6.5% and was lower than in the year-earlier period.\nThe tighter margins were a weak spot in an otherwise upbeat report. Revenue rose to $1.36 billion in the quarter, topping the $1.29 billion estimate. CoreWeave reported a loss of 22 cents a share, compared with a 57-cent loss projected by Wall Street .\nThe company said that its revenue backlog — a measure of future sales — stood at $55.6 billion at the close of the quarter. That was almost twice the level of the previous period.\nIn September, CoreWeave announced an agreement to sell as much as $14.2 billion in computing power to Meta Platforms Inc., the owner of Facebook and Instagram. Microsoft had accounted for 71% of CoreWeave’s revenue in the quarter that ended in June.\nCoreWeave also made a recent attempt to acquire Core Scientific Inc., a partner and fellow data center operator. That bid was rejected by Core Scientific shareholders last month over concerns that the offer undervalued the business.\nCoreWeave said it would move forward without making the purchase and even announced a different, smaller acquisition within minutes of the deal failing.\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nHow an $11 Billion Beauty Company Built a Suburban Empire\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\n©2025 Bloomberg L.P.",
    "tags": [
        "CRWV",
        "PCT:13",
        "PCT:4",
        "PCT:6.5",
        "PCT:71",
        "USD:$1.29",
        "USD:$1.36",
        "USD:$5.05",
        "USD:$5.15",
        "USD:$5.35",
        "USD:$92.03"
    ]
}