{
    "title": "Nutanix (NTNX) Nosedives 17.7% on Bleak Outlook",
    "url": "https://finance.yahoo.com/news/nutanix-ntnx-nosedives-17-7-142153188.html",
    "date": "2025-11-27T14:21:53.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Nutanix Inc. (NASDAQ:NTNX) is one of the worst-performing stocks on Wednesday.\nNutanix fell by 17.75 percent on Wednesday to close...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Nutanix Inc. (NASDAQ:NTNX) is one of the worst-performing stocks on Wednesday.\nNutanix fell by 17.75 percent on Wednesday to close at $48.34 apiece as investor sentiment was dampened by a cautious outlook after a sudden revenue shift in the latter part of the first quarter of fiscal year 2026.\nIn an updated report, Nutanix Inc. (NASDAQ:NTNX) said it grew its revenues for the first quarter of the fiscal year ending October 31, 2025, by 13 percent to $670.6 million from $591 million in the same period last year. Annual recurring revenues jumped by 18 percent to $2.28 billion from $1.94 billion year-on-year.\n“Bookings in our first quarter were slightly higher than expected. However, late in the quarter, we saw some revenue shift from Q1 into future periods. We expect that the revenue over time remains unchanged,” said Nutanix Inc. (NASDAQ:NTNX) Chief Finance Officer Rukmini Sivaraman.\n“We expect this dynamic to continue and have factored it in our Q2 and updated full-year revenue guidance,” she noted.\nFor the second quarter alone, the company expects revenues to reach $705 million to $715 million, while non-GAAP operating margin is targeted at 20.5 percent to 21.5 percent.\nFor the full fiscal year, Nutanix Inc. (NASDAQ:NTNX) targets revenues between $2.82 billion and $2.86 billion.\nWhile we acknowledge the potential of NTNX as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:Q1",
        "ACR:Q2",
        "NTNX",
        "USD:$1.94",
        "USD:$2.28",
        "USD:$2.82",
        "USD:$2.86",
        "USD:$48.34"
    ]
}