{
    "title": "Gold Rebounds on Haven Demand as Risk-Off Mood Rattles Markets",
    "url": "https://finance.yahoo.com/news/gold-holds-drop-investors-weigh-002839440.html",
    "date": "2025-11-05T04:27:22.000Z",
    "author": "Yihui Xie",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Gold rebounded as investors sought safety following a slump in global stocks due to concerns around elevated valuations.\nSpot bullion rose toward $4,000 an ounce, after falling almost 2%...",
    "full_content": "(Bloomberg) --Gold rebounded as investors sought safety following a slump in global stocks due to concerns around elevated valuations.\nSpot bullion rose toward $4,000 an ounce, after falling almost 2% in the previous session as a gauge of the US currency advanced for a fifth day. Global stocks were lower on Wednesday after suffering the steepest drop in nearly a month. Treasuries also rallied on haven demand.\nMost Read from Bloomberg\nTrump’s 90,000-Square-Foot Ballroom Plan Puzzles the Experts\nCan Anyone Save Gary, Indiana?\nBoston’s South Station Gets a Towering Makeover\nIn Vancouver, A Court Ruling on Indigenous Land Triggers Real Estate Angst\nColorado Ski Haven Asks Voters If It Can Borrow More for Housing\nGold’s drop on Tuesday came as a trio of Federal Reserve policymakers stopped short of supporting an additional interest-rate cut in December as they weighed competing risks from inflation and a softer labor market. Investors will have an opportunity to hear more viewpoints this week, including from St. Louis Fed President Alberto Musalem.\nGold is about 50% higher year-to-date, with prices touching a record last month before retracing some gains. The pullback — which followed a slew of signals that the ascent had been too rapid — was accompanied by withdrawals from bullion-backed exchange-traded funds. Traders are now trying to assess whether the metal’s drop has run its course.\n“It should not be a big surprise to see the yellow metal consolidate in a lower, $3,800-to-$4,050-an-ounce trading range,” TD Securities strategist Bart Melek said in a note, citing factors including ambiguities over the outlook for Federal Reserve rate cuts, as well as concerns over retail buying in China.\nStill, the factors that contributed to gold’s gains this year are still mostly intact, and elevated official-sector buying and strong demand from private investors should send prices back up after the consolidation phase, he added.\nGold rose  to $ an ounce as of 12:27 p.m. in Singapore. The Bloomberg Dollar Spot Index was steady after closing at the highest level since mid-May. Silver was up , while palladium edged higher.\nMost Read from Bloomberg Businessweek\nA Wave of US Layoffs Flash Early Warning Sign for Job Market\nMen’s Groups (Not ‘Boys Clubs’) Quietly Emerge in Big Business\nPortugal Has Plenty of Tourists. Now It Wants Data Centers\nNew York’s Golden Handcuffs: Why the City Has a Special Hold on the Rich\nAllow Zohran Mamdani to Reintroduce Himself\n©2025 Bloomberg L.P.",
    "tags": [
        "F",
        "GC"
    ]
}