{
    "title": "Stock market today: S&P 500, Nasdaq slip as Nvidia slides after SoftBank share sale",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-slip-as-nvidia-slides-after-softbank-share-sale-235106694.html",
    "date": "2025-11-11T17:19:07.000Z",
    "author": "Rian Howlett",
    "source": "finance.yahoo.com",
    "content_snippet": "US stocks traded mixed on Tuesday, as faltering techs hit pause on arally fueled by optimismthat Washington may soon end the record-breaking government shutdown.\nThe S&P 500 (^GSPC) fell roughly 0.2%,...",
    "full_content": "US stocks traded mixed on Tuesday, as faltering techs hit pause on arally fueled by optimismthat Washington may soon end the record-breaking government shutdown.\nThe S&P 500 (^GSPC) fell roughly 0.2%, and the Nasdaq Composite (^IXIC) dropped 0.7%. The Dow Jones Industrial Average (^DJI), which includes fewer tech stocks, added 0.5%. The moves follow aroaring startto the week for stocks as hopes for the AI trade revived.\nTesting that faith, SoftBank Group (SFTBY) said Tuesday itsold its entire stakein chipmaker Nvidia (NVDA) to fund its own investments in AI development. The move comes at a time that Wall Street is questioning whether the AI spending spree will pay off amid lofty valuations for related stocks. Shares of Nvidia dropped more than 3%.\nElsewhere in tech, CoreWeave (CRWV) trimmed its full-year revenue forecast, taking the shine off itsstrong quarterly earnings. Its stock fell around 14% after the Nvidia-backed AI infrastructure provider flagged a delay by a data center partner.\nThose concerns weighed on markets, despite growing hopes that the 41-day US shutdown could soon end. The push to reopen government took another step forward as the Senate on Monday eveningpassed a funding measure, advancing it to the House for a vote.\nA reopening would lead to the release of economic data delayed by the stoppage, giving markets better insight into the likely path of interest rates. But fresh datacould take a whileto arrive, even if the shutdown ends this week.\nUS companies shed 11,250 jobs a week during October, ADP's private-sector payrolls report out Tuesdayshowed— an example of the private data filling the public vacuum. Its figures suggest a slowing in the labor market.\nOn the trade front, doubts about the lasting power of the US-China tariff truce resurfaced around the crucial issue of rare-earth supplies. The Wall Street Journal reported thatBeijing plans to keepits exports of the minerals out of US military hands, even as it speeds up flows to other American buyers.\nYahoo Finance's David Hollerith reports:\nRead more here.\nThe market is expected to see a large influx of new iron ore supply as the newly renovated Morebaya port in Guinea opens today, signaling the start of shipments from the largest-ever mining project in Africa.\nThe Morebaya port on the coast of West Africa will connect the global market to the Simandou mountain range in Guinea, where British-Australian mining conglomerate Rio Tinto Plc (RIO) and a series of Chinese companies have been mining one of the world's largest iron ore deposits. First shipments are expected by the end of the year.\nShares in Rio Tinto held roughly flat after a five-day run-up of around 3.5%.\nThe $23 billion Simandou project is expected to hold at least three billion tons of iron ore, thesecond commodity in the world by valueafter only oil. Once the Morebaya port reaches full operation, it isexpected to ship out 120 million tons per yearof the steel feedstock, according to Bloomberg.\nChina isthe world's largest importer of iron ore. As Beijing has been jostling for more control over iron ore prices, Simandou — where Chinese companies control roughly three-quarters of the mining project — gives China a powerful new source of supply.\nNot only does the mine break China's dependence on foreign companies such as Rio Tinto and Australian mining giant BHP Group (BHP) for imports of the material. It also adds iron ore to the list of metals over which Beijing has a high level of supply and pricing control — like the rare earth minerals that were the central talking point of the recent October sit-down between President Trump and his Chinese counterpart Xi Jinping.\nNvidia (NVDA) led a decline in Big Tech stocks on Tuesday.\nShares in the AI chipmaker sank more than 3%. Tesla (TSLA) stock fell over 2%, while Broadcom (AVGO) and Meta (META) shares dropped more than 1%. Alphabet (GOOGL,GOOG) and Microsoft (MSFT) slipped fractionally, while Amazon (AMZN) hovered around the flat line.\nApple (AAPL) shares, meanwhile, rose nearly 2%.\nNvidia's drop on Tuesday comes as financial updatesfrom CoreWeave (CRWV) and TSMC (TSM) cast doubt on the AI boom. AI data center and cloud provider CoreWeave is backed by Nvidia and a major customer for its chips, while semiconductor manufacturer TSMC (TSM) is akey partnerfor its flagship Blackwell product.\nThe biggest driver of the drop, however, appeared to be SoftBank's (SFTBY,9984.T)surprise moveto divest its entire Nvidia stake.\nNvidia's stock is still up more than 40% for the year to date.\nCoreWeave's (CRWV) stock sank more than 9% after the Nvidia-backed (NVDA) company trimmed its full-year revenue forecast.\nThe AI data center and cloud provider lowered its 2025 revenue guidance to a range of $5.05 billion to $5.15 billion. Its prior range was $5.15 billion to $5.35 billion.\nCoreWeave also slashed its capital expenditure forecast, as one of its third-party data center developers fell behind schedule, affecting its ability to bring computing capacity online.\nBank of America (BAC) analyst Brad Sills lowered his price outlook on CoreWeave shares to $140 from $168 apiece, following the results released after market close on Monday.\nMeanwhile, the company's adjusted operating income — a measure of how much profit CoreWeave makes from its core operations — was $217 million, below its interest expense of $311 million, noted DA Davidson analyst Gil Luria.\n\"We continue to believe this business is not worth scaling,\" Luria wrote in a note to clients.\nCoreWeave relies on debt borrowed at high interest rates against its massive store of Nvidia chips — a deteriorating asset — to buy more Nvidia chips to rent out to customers.\nIts customers are also some of Nvidia's biggest customers: Microsoft (MSFT) makes up the overwhelming majority of CoreWeave's revenue, raising fears that CoreWeave could go bust once major hyperscalers finish building out AI data centers and as they could eventuallyrely on their own custom chipsrather than Nvidia's.\nNvidia's entangled relationship with CoreWeave has raised eyebrows on Wall Street as analystsbegin to question the circular dynamicin AI dealmaking. Nvidia is a major investor in CoreWeave, its biggest supplier, and its customer. The AI chipmaker also has a multibillion-dollaragreementto purchase unsold capacity from the cloud provider.\nAmazon (AMZN) Prime Video's ad-supported streaming service now reaches more than 315 million viewers worldwide each month, the company said on Tuesday. That's a jump from the 200 million figure the tech megacap shared in April.\nAmazon entered the spacein January 2024, when it began making all of its Prime Video subscriptions ad-supported by default. It's seen as a key growth engine, as more viewers and streaming platformsfrom Netflix(NFLX) to Disney (DIS) embrace ad-supported tiers.\nSince that time, Amazon has launched advertising for the streaming service in 16 countries, which now include the US, UK, Germany, Japan, and India.\nAccording to Amazon, the 315 million figure represents an unduplicated average monthly active ad-supported audience across its originals; licensed films and series; live sports and events; and free ad-supported channels. The estimate is based on internal data collected from September 2024 to August 2025, with some regional variations due to launch dates.\nThe milestone \"demonstrates our customer-obsessed approach to enhancing the viewing experience while delivering powerful opportunities for brands,\" said Jeremy Helfand, vice president of Prime Video advertising.\nTech dragged US stocks down on Tuesday at the open amid renewed fears of an AI bubble.\nThe Nasdaq Composite (^IXIC) dropped roughly 0.5%, and the S&P 500 (^GSPC) fell below the flat line. The Dow Jones Industrial Average (^DJI), which includes fewer tech stocks, inched up 0.2%.\nThe market action comes after SoftBank Group (SFTBY) sold its Nvidia (NVDA) stake, and as financial updates from AI chip manufacturer TSMC (TSM) and data center provider CoreWeave (CRWV) disappointed investors.\nYahoo Finance'sAllie Canalreports:\nAfter a yeardominated by artificial intelligenceheadlines, Wall Street’s bull case is shifting toward something more fundamental to stocks: earnings power that’s beginning to broaden beyond Big Tech.\nMorgan Stanley, UBS, and other major firms are pointing to a clear throughline this earnings season: Profits are strong, margins are stabilizing, and growth,while still concentrated in AI-heavy tech, is beginning to spread.\n“There are clear signs that the earnings recovery is underway and pricing power is firming,” Morgan Stanley equity strategist Mike Wilson wrote in a client note on Monday. ...\nFactSet’slatest databacks that up. With more than 90% of S&P 500 (^GSPC)companies reporting, 82% have beaten earnings estimates, while overall profits rose 13.1% year over year. That marks the fourth straight quarter of double-digit growth. ...\nStill, some strategists warn that the trend will need to continue from here.\n“Earnings sentiment staged a partial comeback,” RBC Capital Markets strategist Lori Calvasina wrote in a note to clients, adding that while revisions have improved for two straight weeks, they remain “well below” summer highs.\nRead more here.\nYahoo Finance'sHamza Shabanreports:\nRead more herein the takeaway from today's Morning Brief.\nEconomic data:NFIB small business optimism (Oct.)\nEarnings calendar:Sony(SONY), Sea Limited (SE), Alcon (ALC), AngloGold Ashanti (AU), Vodafone Group (VOD), Oklo (OKLO), Fermi (FRMI)\nHere are some of the biggest stories you may have missed overnight and early this morning:\nThe bull case for stocks is broadening beyond AI\nSoftBank unloads Nvidia stake for $5.8 billion in surprise move\nCoreWeave trims sales outlook on data center delay; stock falls\nThe bowl crisis indicator flashes red\nDemocrats trade election euphoria for angst over shutdown deal\nChina plans to keep its rare earths out of US military hands\nMeta chief AI scientist Yann LeCun plans to exit, launch own start-up\nIntel CEO to oversee AI efforts after its head quits for OpenAI\nSony ups profit forecast as it dials back tariff hit view\nXpeng stock jumps amid progress on human-like robots\nMeta (META)stock fell 1% before the bell on Tuesday. The drop in share price follows the news that Meta's chief artificial intelligence scientist Yann LeCun isplanning to leavethe social media giant to found his own start-up.\nBeyond Meat (BYND)stock fell 5% in premarket trading on Tuesday after releasing its delayed earnings report Monday's closing bell.\nSony (SONY)shares rose 5% before the bell after raising its earnings forecast after a stronger than expected second quarter.\nParamount Skydance (PSKY) shares rose about 5% in premarket trading on Tuesday as investors digested its third quarter earnings.\nQuarterly revenue came in just below Wall Street expectations in the results, released in after hours on Monday. But the company struck an upbeat tone for what lies ahead, raising its cost-savings target, projecting stronger streaming profits, and signaling upcoming price hikes for Paramount+.\nRevenue totaled $6.7 billion for the quarter ended in September, slightly shy of analysts’ $7 billion estimate, in the company’s first earnings release since completing its merger with Skydance in August.\nParamount Skydance CEO David Ellison said the company now expects $30 billion in total revenue and $3.5 billion in adjusted OIBDA for 2026, driven by a “healthy acceleration” in streaming. The company also expects Paramount+ to be profitable this year and to grow that profitability in 2026.\nDirect-to-consumer revenue jumped 17% year over year, while weakness in TV Media offset those gains. Paramount+ revenue climbed 24%, with total subscribers reaching 79.1 million.\nAcross the full quarter, Paramount reported $324 million in operating income and a net loss of about $257 million, though pre- and post-merger results aren’t directly comparable.\nEllison said the newly combined company has taken “meaningful steps” to streamline operations, including a reduction of 1,000 employees from its workforce and plans to cut an additional 1,600 employees.\nParamount also raised its efficiency-savings target to $3 billion, up from $2 billion previously.\nOn top of its efficiency goals, the company also plans to raise prices for Paramount+ early next year in the US, part of a broader push to boost profitability and fund new content and technology investments.\nThe company recently announced upcoming price increases in both Canada and Australia.\nShares of Nvidia (NVDA) fell around 1.5% in early trading after SoftBank (SFTBY,9984.T) offloaded its entire holding in the AI chip giant.\nBloomberg reports:\nSoftBank Group Corp. sold its entire stake in Nvidia Corp, pocketing $5.8 billion ahead of a rash of planned investments by founder Masayoshi Son to build his own sphere of influence supporting artificial intelligence.\nThe Tokyo-based company had raised its stake in Nvidia to about $3 billion by the end of March. That stake and a windfall at the Vision Fund startup investment unit helped SoftBank report a surprise net income of ¥2.5 trillion ($16.2 billion) in its fiscal second quarter, far outrunning the average of analyst estimates of ¥418.2 billion. ...\nSon’s company now boasts a portfolio that includes some of the world’s most sought-after names in AI: OpenAI (OPAI.PVT) and Oracle Corp. (ORCL). Those stakes boosted SoftBank’s paper gains and helped drive a 78% surge in its share price over the three months ending in September — its best such performance since the December quarter of 2005.\nThe number of bets from which SoftBank is successfully recouping its investment has increased, “so we raise our forecasts,” Citigroup analyst Keiichi Yoneshima wrote in a note ahead of the earnings release. The analyst set his target price for SoftBank’s stock at ¥27,100, linking his calculations with OpenAI’s valuation and assuming a future valuation range of $500 billion to $1 trillion for the ChatGPT operator.\nRead more here.\nBloomberg reports:\nRead more here.",
    "tags": [
        "ACR:CEO",
        "ACR:S&P",
        "CRWV",
        "DJI",
        "GSPC",
        "NVDA",
        "PCT:0.2",
        "PCT:0.5",
        "PCT:0.7",
        "PCT:1",
        "PCT:1.5",
        "PCT:13.1",
        "PCT:14",
        "PCT:17",
        "PCT:2",
        "PCT:24",
        "PCT:3",
        "PCT:3.5",
        "PCT:40",
        "PCT:5",
        "PCT:78",
        "PCT:82",
        "PCT:9",
        "PCT:90",
        "T",
        "USD:$5.05",
        "USD:$5.15",
        "USD:$5.35"
    ]
}