{
    "title": "Switzerland Moves Close to Improved 15% US Tariff Deal",
    "url": "https://finance.yahoo.com/news/switzerland-moves-close-securing-improved-170354494.html",
    "date": "2025-11-11T17:10:01.000Z",
    "author": "Hugo Miller, Bastian Benrath-Wright and Fabienne Kinzelmann",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Switzerland is close to securing a 15% tariff on its exports to the US, in what would be a relief for the country after it was hit with a punishing 39% levy in August, according to peopl...",
    "full_content": "(Bloomberg) --Switzerland is close to securing a 15% tariff on its exports to the US, in what would be a relief for the country after it was hit with a punishing 39% levy in August, according to people familiar with the matter.\nA deal may be concluded within the next two weeks, said the people, who declined to be identified discussing ongoing negotiations. They also warned that nothing is finalized and the talks could still come undone, as happened during discussions between US and Swiss trade negotiators in late July.\nMost Read from Bloomberg\nCan a Waterfront Park Wake Up Downtown Seattle?\nStefanik Challenges Hochul for NY Governor After Mamdani Victory\nWill the YIMBY ‘Holy Grail’ Deliver an LA Building Boom?\nRepublicans Fight Over California Seats in Redistricting Fallout\nElection Shocks Underscore Power Bills as New Political Risk\nUS President Donald Trump later confirmed his administration was “working on a deal to get their tariffs a little bit lower.”\n“I haven’t said any number,” he added when asked about a 15% rate. “But we’re going to be working on something to help Switzerland along. We hit Switzerland very hard. We want Switzerland to remain successful.”\nA spokesperson for the Swiss government declined to comment.\nThe Swiss Market Index rose 1% as of 10:45 a.m. Zurich time, led by stocks including luxury goods giant Richemont, contract manufacturer Lonza Group AG and private equity firm Partners Group Holding AG. The Swiss franc strengthened against the dollar and the euro.\nSummer Shock\nThe previous negotiations ended with Switzerland being hit with the highest tariff rate the US imposed on any developed nation. Since then, the country has been trying to secure better terms, an effort that gained momentum last week when a group of Swiss billionaires and corporate executives met Trump at the Oval Office.\nRichemont Chairman Johann Rupert and Partners Group billionaire founder Alfred Gantner were among the business leaders who met with Trump. The meeting went so well that Trump subsequently ordered Trade Representative Jamieson Greer to step up direct negotiations, which he did with Swiss counterparts on Friday.\nA deal would mark the successful culmination of weeks of shuttle diplomacy to Washington by Switzerland’s top trade diplomat, Helene Budliger Artieda, combined with the Swiss corporate charm offensive. A 15% rate would match the tariff on the neighboring European Union and be a vast improvement on the 39% bombshell that Trump announced on Aug. 1, Switzerland’s national holiday.\nThe initial punitive tariff has been linked to Trump’s view of a perceived trade imbalance between the two countries, specifically a near $40 billion US goods deficit. Switzerland had tried to counter that this was offset by imports of services.\nWhat made the Aug. 1 announcement worse was that senior Swiss officials believed they had successfully negotiated a better deal with their US counterparts, which only needed sign-off from Trump.\nSwitzerland can’t afford to lose too much time in its bid to get the levy reduced, as there are emerging signs of the damage caused by tariffs. The economy likely shrank in the third quarter, and the country’s central bank says the outlook “has deteriorated due to significantly higher US tariffs.” Unemployment is also rising, albeit from a low level, and is at the highest in four years.\n--With assistance from Josh Wingrove, Catherine Lucey and Levin Stamm.\n(Corrects title of Richemont’s Rupert in eighth paragraph.)\nMost Read from Bloomberg Businessweek\nSex, Power and the Downfall of the Orgasmic Meditation Cult\nThe Silicon Valley Beauty Brand Biohackers Are Obsessed With\nHow an $11 Billion Beauty Company Built a Suburban Empire\nKPop Demon Hunters Is Netflix’s Biggest Hit Ever. Where Are the Toys?\nWill Men’s Makeup Ever Go Mainstream?\n©2025 Bloomberg L.P.",
    "tags": [
        "PCT:1",
        "PCT:15",
        "PCT:39"
    ]
}