{
    "title": "What bubble? The analysts and investors making the bull case for AI",
    "url": "https://finance.yahoo.com/news/bubble-analysts-investors-making-bull-123059949.html",
    "date": "2025-11-27T12:30:59.000Z",
    "author": "Hadas Gold",
    "source": "finance.yahoo.com",
    "content_snippet": "Chipmaker Nvidia (NVDA) posted yet another blockbuster earnings report this month.\nThe stock fell anyway, as many investors worry that the market is in the middle of an about-to-burst AI bubble.\nBut f...",
    "full_content": "Chipmaker Nvidia (NVDA) posted yet another blockbuster earnings report this month.\nThe stock fell anyway, as many investors worry that the market is in the middle of an about-to-burst AI bubble.\nBut for AI’s biggest believers, the report was just another sign that the industry’s train isn’t running out of steam anytime soon.\n“Fears of an AI Bubble are way overstated in our view,” Wedbush analyst Dan Ives wrote in a note last week. The Nvidia earnings report “is another validation point for the AI Revolution and (in) our view we are in the Top of the 3rd inning of this AI game .”\nThe possibility of an AI bubble has loomed over the tech industry and Wall Street for years, but worries have ramped up sharply this year. Massive AI infrastructure spending, a string of circular deals among a few key big tech companies and seemingly endless rhetoric about AI’s world-changing potential – with little profit to show for it – have sparked concerns that we’re in for another dot-com-style bubble bursting.\nAbout forty percent of the S&P 500 (^GSPC) isnow made up of 10 tech companies, including Nvidia, Amazon, (AMZN) Meta (META), Oracle (ORCL), Alphabet (GOOG,GOOGL) and Microsoft (MSFT) – all of which are betting big on an AI revolution.\nThere’s a lot at stake: The bursting of the dot-com bubble helped cause the 2001 recession and led theNasdaq to lose over 75% of its valueby late 2002.\nBut some analysts say investors should actually keep piling into AI. They argue there’s a big difference between AI and the dot-com era, when many early internet companies failed to find lucrative and steady business models, with notable exceptions like Amazon and eBay. AI companies, on the other hand, already have healthy business models or viable paths to profitability, they argue.\n“The lesson of the dot com era is there was a bubble, it burst. We don’t think we’re in one now for AI,” Bob Michele, JP Morgan’s chief investment officer and head of the global fixed income, currency and commodities group,” said on CNBC last week.\nAnd AI has far more potential to make money, Ravi Mhatre, co-founder of Lightspeed Venture Partners, told CNN. LSVP is a major backer of AI company Anthropic.\n“The scale of revenue growth happening in this cycle is exponentially greater than prior cycles,” he said.\nRapid advancements in AI models also mean more uses are regularly popping up for the technology, Mhatre said.\nTech companies are already seeing increased cloud demand and productivity gains, especially in areas like coding and advertising. And there are plenty of growth markets geared to consumers – ChatGPT recently addeda new toolto help shoppers research purchases, for example. But whether that growth will outpace costs, especially for smaller companies, remains a big question.\nSome investors believe the AI industry is at the beginning of a “super cycle” decade (or more) of innovation, investment and revenue. That could mean a global economy dominated and fundamentally changed by AI, they say.\n“I tend to believe that the AI super cycle is real, that it is going to have a pretty profound impact on the economy, but you have to make room for the full range of outcomes when we price these things,” Marta Norton, Empower’s chief investment strategist, told Bloomberg Television last week.\nMhatre said there’s a bubble in that a rush of investments is chasing momentum that may not prove successful. But the industry itself might not be in a bubble.\n“I do think both things are true. We’re in a hype cycle,” Mhatre said. “On the other hand, this kind of scale and speed with which value is getting created is also radically different than the prior cycles, where I just think the time that it took people to build technology and for it to be diffused was longer.”\nFor more CNN news and newsletters create an account atCNN.com",
    "tags": [
        "ACR:S&P",
        "NVDA",
        "PCT:75"
    ]
}