{
    "title": "Novo Nordisk lowers full-year profit guidance as sales slow",
    "url": "https://finance.yahoo.com/news/novo-nordisk-lowers-full-profit-075535147.html",
    "date": "2025-11-05T07:55:35.000Z",
    "author": "By Jacob Gronholt-Pedersen and Maggie Fick",
    "source": "finance.yahoo.com",
    "content_snippet": "COPENHAGEN (Reuters) -Wegovy-maker Novo Nordisk (NVO,NOVO-B.CO) lowered its full-year profit and sales forecast on Wednesday in an early blow to the Danish drugmaker's new CEO while it strives to claw...",
    "full_content": "COPENHAGEN (Reuters) -Wegovy-maker Novo Nordisk (NVO,NOVO-B.CO) lowered its full-year profit and sales forecast on Wednesday in an early blow to the Danish drugmaker's new CEO while it strives to claw back lost ground in a fierce obesity drug market battle.\nThe Danish drugmaker is going through a tumultuous period marked by a sharp share price plunge and slowing sales growth, which have prompted a change of CEO and a board shake-up.\nShares rose over 2% in Copenhagen and in New York before the bell on Wednesday.\nFuelled by rapid sales growth of its blockbuster obesity drug Wegovy, Novo became Europe's most valuable firm last year, but sales growth has slowed this year.\nIt now expects full-year operating profit - measured in local currencies - to grow between 4% and 7% in 2025, compared with its earlier forecast of between 4% and 10%, Novo Nordisk said on Wednesday.\nCEO Mike Doustdar, who took the helm in August, said the lower guidance was due to \"the lower growth expectations for our GLP-1 treatments,\" referring to the company's best-selling weight management and diabetes medications.\n\"We aim to accelerate on all fronts to be able to compete better in dynamic and increasingly competitive markets,\" Doustdar said in a statement.\nDoustdar, who presents his first quarterly results as CEO, is facing intense scrutiny from investors who have seen Novo's stock slide 50% this year under pressure from competition from U.S. rival Eli Lilly and compounded copycat drugs custom-made from the same ingredients as branded drugs.\nThe company warned on Wednesday that \"unsafe and unlawful mass compounding has continued\" in the third quarter.\nThe company expects sales growth in local currencies of between 8% and 11% this year, compared with its previous 8%-14% range, it said.\nThird-quarter sales of Wegovy rose by 18% to 20.4 billion crowns globally from a year ago, compared with the 20.9 billion that analysts expected. Its total sales in the quarter rose 5% to 75.0 billion Danish crowns ($11.71 billion), compared with 76.2 billion forecast by analysts in a company-compiled poll.\nSales grew 11% measured in local currencies, which eliminates exchange rate fluctuations, compared with 11.4% growth expected by analysts in a company-compiled consensus.\nOperating profit fell 30% to 23.7 billion crowns in the quarter, below the 24.6 billion crowns expected by analysts.\n($1 = 6.4029 Danish crowns)\n(Reporting by Jacob Gronholt-Pedersen and Maggie Fick, editing by Terje Solsvik and Tomasz Janowski)",
    "tags": [
        "B.CO",
        "LLY",
        "NONOF",
        "NOVO",
        "NVO"
    ]
}