{
    "title": "Redditors Are Recommending This Small-Cap Stock These Days",
    "url": "https://finance.yahoo.com/news/redditors-recommending-small-cap-stock-142037440.html",
    "date": "2025-11-27T14:20:37.000Z",
    "author": "Fahad Saleem",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. EZCORP, Inc. (NASDAQ:EZPW) is one of the best small-cap stocks to buy according t...",
    "full_content": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. EZCORP, Inc. (NASDAQ:EZPW) is one of the best small-cap stocks to buy according to Redditors.\nEZCORP Inc (NASDAQ:EZPW) is a Texas-based pawn shop operator. Redditors like the stock due to the business’s appeal amid rising inflation and difficulties in security credit in the US. The stock is up 48% so far this year.\nThe company recently posted better-than-expected quarterly results. Pawn revenue in the US saw double-digit growth. It has grown its footprint across over 1,300 locations across five countries. The company also highlighted digital initiatives, omnichannel expansion, and inventory efficiency improvements that are likely to drive future growth.\nWasatch Micro-Cap Fund stated the following regarding EZCORP, Inc. (NASDAQ:EZPW) in itsQ1 2025 investor letter:\n“Another contributor to performance wasEZCORP, Inc.(NASDAQ:EZPW), a provider of pawn services and loans in the U.S. and Latin America. As a defensive stock, EZCORP was one that investors gravitated toward given its counter cyclical demand. As discretionary income shrinks, EZCORP can be source of consumer credit. Additionally, the company recently announced the issuance of convertible senior notes in order to more favorably restructure its balance sheet.”\nWhile we acknowledge the potential of EZPW as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "EZPW",
        "PCT:48"
    ]
}