{
    "title": "Zscaler (ZS) Slashes 13% on Profit-Taking",
    "url": "https://finance.yahoo.com/news/zscaler-zs-slashes-13-profit-142207164.html",
    "date": "2025-11-27T14:22:07.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Zscaler, Inc. (NASDAQ:ZS) is one of the worst-performing stocks on Wednesday.\nZscaler snapped two straight days of gains on Wednes...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Zscaler, Inc. (NASDAQ:ZS) is one of the worst-performing stocks on Wednesday.\nZscaler snapped two straight days of gains on Wednesday, declining 13.03 percent to close at $251.97 apiece as investors appeared to have priced in a strong earnings performance for the first quarter of fiscal year 2026 and resorted to profit-taking ahead of the Thanksgiving holiday.\nIn an updated report, Zscaler, Inc. (NASDAQ:ZS) said it narrowed its net loss by 3.7 percent to $11.6 million from $12.05 million in the same period last year. Revenues jumped by 25 percent to $788 million from $627.9 million year-on-year.\nLooking ahead, Zscaler, Inc. (NASDAQ:ZS) expects the full fiscal year to generate revenues of $3.282 billion to $3.301 billion, as well as annual recurring revenues between $3.698 billion and $3.718 billion.\nIt also targets non-GAAP operating income of $732 million to $740 million, and earnings per share (EPS) of $3.78 to $3.82.\nFor the second quarter, revenues are expected to end at $797 million to $799 million, while non-GAAP income from operations is targeted at $172 million to $174 million. EPS is projected at $0.89 to $0.90.\n“Our outstanding Q1 results demonstrate the strong demand we are experiencing for our Zero Trust and AI Security platform. With over $3.2 billion in Annual Recurring Revenue, growing over 25 percent year-over-year, and Rule-of-78 performance, I’m very pleased to share that an increasing number of customers are relying on our platform for better security, lower operational costs, and reduced IT complexity,” said Zscaler, Inc. (NASDAQ:ZS) Chairman and CEO Jay Chaudhry.\n“Zero Trust security is the linchpin for AI-Security, and Zscaler pioneered Zero Trust security with our cloud-native switchboard architecture. By integrating the recently acquired SPLX technology with our comprehensive AI Security offerings, we are expanding our best-in-class AI Security solutions to solve emerging security challenges,” he noted.\nWhile we acknowledge the potential of ZS as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:CEO",
        "ACR:EPS",
        "ACR:Q1",
        "USD:$0.89",
        "USD:$0.90",
        "USD:$12.05",
        "USD:$251.97",
        "USD:$3.78",
        "USD:$3.82",
        "ZS"
    ]
}