{
    "title": "Redditors Say IRadimed (IRMD) is Among The Best Small-Cap Stocks to Buy – Here’s Why",
    "url": "https://finance.yahoo.com/news/redditors-iradimed-irmd-among-best-140533553.html",
    "date": "2025-11-27T14:05:33.000Z",
    "author": "Fahad Saleem",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. IRadimed Corporation (NASDAQ:IRMD) is among the best small-cap stocks to buy acco...",
    "full_content": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. IRadimed Corporation (NASDAQ:IRMD) is among the best small-cap stocks to buy according to Redditors.\nIradimed makes magnetic resonance imaging (MRI) compatible medical devices. The company recently reported strong quarterly results, posting year-over-year revenue growth of about 15%. Redditors like the stock because they believe it is among the few companies making MRI-compatible devices in the US. The stock is up 64% year to date.\nThe company’s MRI-compatible IV infusion pumps and patient vital signs monitoring systems are seeing double-digit revenue growth. Analysts have high expectations for the commercial launch of the new 3870 MRI IV pump, which would have a relatively higher price target. The company recently raised its full-year outlook, and management highlighted strong demand and stable pricing trends.\nConestoga Capital Advisors Micro Cap Strategy stated the following regarding IRadimed Corporation (NASDAQ:IRMD) in itsfourth quarter 2023 investor letter:\n“IRadimed Corporation(NASDAQ:IRMD): IRMD is a commercial stage medical technology company focused on innovating MRI patient care. The company’s three main products include an MRI compatible patient monitor, an MRI compatible IV infusion pump, and a smart ferrous metal detector. The company has three revenue line items, including devices, disposables, and services. We believe a recent competitive landscape change favoring IRMD will fuel a new leg of durable growth and impressive profitability. Primary competitor Invivo, owned by Philips is pulling back from the market, and we expect IRMD to be the primary beneficiary.”\nWhile we acknowledge the potential of IRMD as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "IRMD",
        "PCT:15",
        "PCT:64"
    ]
}