{
    "title": "Crypto Markets Today: Bitcoin Leads Broad Recovery as Traders Eye Possible Santa Rally",
    "url": "https://finance.yahoo.com/news/crypto-markets-today-bitcoin-leads-113000200.html",
    "date": "2025-11-27T11:30:00.000Z",
    "author": "Oliver Knight",
    "source": "finance.yahoo.com",
    "content_snippet": "The crypto market enjoyed a much-needed boost on Thursday as the two largest tokens rallied, with the bitcoin (BTC-USD) price rising to $91,700 and ether (ETH-USD) to $3,030.\nThe gains followed Wednes...",
    "full_content": "The crypto market enjoyed a much-needed boost on Thursday as the two largest tokens rallied, with the bitcoin (BTC-USD) price rising to $91,700 and ether (ETH-USD) to $3,030.\nThe gains followed Wednesday'sstrong recovery in equities. That was led by tech stocks like Alphabet (GOOG) and Nvidia (NVDA), with the Nasdaq Composite (^IXIC) posting itsbest four-day streaksince May.\nTraders remain focused on bitcoin as opposed to lower liquidity altcoins. BTC's 5.4% gain over the past 24 hours outperformed 18 of the 20 largest crypto tokens by market cap.\nThis was reflected in CoinMarketCap's\"altcoin season\" indicator, which remains at a lowly 22/100, down considerably from October's high of 67/100.\nBitcoin's 30-day implied volatility index, BVIV, dropped further back to 50%, almost entirely retracing last week's spike to 65%, TradingViewdata shows.\nTraders piled into a bullish year-end call-condor structure, ranging between $100,000 and $118,000 strikes, worth $6.5 million in premium, according toDeribit Insights.\nThis signals expectations for a potential “Santa rally,” even as steady call overwriting around $100,000 and easing downside hedging kept implied volatility subdued.\nOpen interest for bitcoin remained consistent with the past 24 hours' price gains, indicating that the move was spurred by spot buying rather than futures activity.\nAltcoin derivatives painted a different story: Open interest for ether (ETH), solana (SOL) and particularly zcash (ZEC) rose disproportionately to suggest that traders are flocking to the risk-taking approach of buying with leverage, according toCoinalyze.\nWednesday's total trading volume mirrored Tuesday's, and a slight lull going into Thursday can be attributed to the Thanksgiving holiday in the U.S.\nThe altcoin market, while in general lagging behind bitcoin, showed signs of strength on Thursday.\nThe SKY token, previously MKR, rose by 10% as it began to show signs of a reversal from last week's low of $0.041.\nThere were also gains for DASH, ETHFI and AVAX, all of which rose by between 6.7% and 7.7%.\nThe optimism wasn't correlated across the entire market: Ethena (ENA) and bittensor (TAO) both dropped by more than 2%, suggesting the optimism wasn't unanimous across the board.\nThe crypto market's averagerelative strength index(RSI) shows it is edging toward \"overbought\" territory, with tokens like AVAX, SPX and PENDLE firmly in the overbought zone, suggesting that a pullback may be on the cards moving into Friday unless meaningful demand and volume can be sustained.\nThe altcoin market ultimately depends on bitcoin's next move. If bitcoin can begin to break the downtrend that started in October and push back toward $100,000, altcoins will likely follow. However, if it gives back this week's gains and begins to fall into trouble at the low $80,000 level, altcoins will underperform and potentially break their own levels of support due to alow liquidity environment.",
    "tags": [
        "BTC",
        "ETH",
        "GOOG",
        "IXIC",
        "NVDA",
        "PCT:10",
        "PCT:2",
        "PCT:5.4",
        "PCT:50",
        "PCT:6.7",
        "PCT:65",
        "PCT:7.7",
        "USD"
    ]
}