{
    "title": "Seasonal hiring offers little reprieve for labor market woes",
    "url": "https://finance.yahoo.com/news/seasonal-hiring-offers-little-reprieve-for-labor-market-woes-110044972.html",
    "date": "2025-11-27T11:00:44.000Z",
    "author": "Emma Ockerman",
    "source": "finance.yahoo.com",
    "content_snippet": "Plenty of Americans are expected to pour into stores and fill online carts this holiday shopping season. Fewer may be able to pick up seasonal work to support that bonanza.\nAslayoff announcements make...",
    "full_content": "Plenty of Americans are expected to pour into stores and fill online carts this holiday shopping season. Fewer may be able to pick up seasonal work to support that bonanza.\nAslayoff announcements make wavesand the unemployment rate creeps up, the usual holiday hiring spree appears muted this year, with data from multiple sources suggesting that hiring plans may be at their lowest levels in over a decade.\nChallenger, Gray & Christmas saidin its most recent labor reportthat seasonal hiring plans through October were at their lowest since the global outplacement firm began tracking them in 2012.\nThe National Retail Federation, a trade group, also said in a press call earlier this month that while strong consumer spending was expected to persist through the holiday season, plans to bring on extra staff could be at “the lowest level in more than 15 years.” Retailers were expected to bring on 265,000 to 365,000 seasonal workers, compared to 442,000 in 2024.\nRead more:Why you should think twice about using buy now, pay later to cover holiday expenses\nInterest in seasonal work, though, remains plenty high —up 27% at the end of September compared to a year earlier— as Americans struggle to find employment across the board, according to Cory Stahle, a senior economist at the Indeed Hiring Lab.\nJob seekers are competing for listings that are up just 2.7% from a year ago, and still below pre-pandemic levels. (Indeed’s hiring data tracks seasonal positions overall, such as in accounting and ski resorts, rather than restricting seasonal hires strictly to retail, Stahle said.)\n“I think it’s very telling that we’re still well below where we were in those seasonal jobs a couple of years ago,” Stahle said. “There are clearly just a lot fewer opportunities overall.”\nRetail especially has “just really pulled back,” he said.\nThe most recent federal jobs data from September showed that the economy unexpectedlyadded 119,000 positions that month, though that was before big companies like Amazon announced major cuts. The gains were concentrated in sectors like healthcare, food services and drinking places, and social assistance, andthe retail sector was roughly flatcompared to a month prior.\nYahoo Finance reached out to multiple big retailers about their hiring plans.Targethas been quiet about exactly how many extra seasonal workers it intends to bring on this year.\nA spokesperson for Walmart in a statement said that the company would be taking its usual approach, saying, “For the past few years, we’ve taken the extra hours available during the holidays and made them available to our current associates. It’s worked very well for us and the feedback from customers and associates has been overwhelmingly positive.”\nThough holiday spending is expected tohold steady this year,some retailers have undoubtedly struggledas consumers hunt for deals in a K-shaped economy. Arecent survey of 1,048 small businessesconducted by the coalition group Small Business for America’s Future found that 68% of owners reported their customers had less to spend this year, while 59% anticipated worse holiday sales compared to last year. Just 5% of respondents were actively hiring or expanding, while 16% were scaling back, the survey found.\nRead more:What is a 'K-shaped economy,' and what's causing the divide?\nThe majority expected tariffs to have a negative impact on holiday spending.\nStahle said all that uncertainty is translating to muted seasonal hiring.\n“Employers aren’t quite sure as to the way that tariffs are ultimately going to come through, or to the degree in which people are going to spend, and so I think some of it is also just the broader uncertainty that companies are seeing,” Stahle said.\nEmma Ockermanis a reporter covering the economy and labor for Yahoo Finance. You can reach her atemma.ockerman@yahooinc.com.\nSign up for the Mind Your Money newsletter\nClick here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "AMZN",
        "PCT:16",
        "PCT:2.7",
        "PCT:27",
        "PCT:5",
        "PCT:59",
        "PCT:68",
        "TGT",
        "WMT"
    ]
}