{
    "title": "This Biotech Stock Is Up 50% in 2025, But Redditors Say It Has More Upside – Here’s Why",
    "url": "https://finance.yahoo.com/news/biotech-stock-50-2025-redditors-140738545.html",
    "date": "2025-11-27T14:07:38.000Z",
    "author": "Fahad Saleem",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. Halozyme Therapeutics, Inc. (NASDAQ:HALO) is among the best small-cap stocks to b...",
    "full_content": "We recently published10 Best Small-Cap Stocks With Huge Potential According to Reddit as Market Looks Beyond AI Trade. Halozyme Therapeutics, Inc. (NASDAQ:HALO) is among the best small-cap stocks to buy according to Redditors.\nHalozyme Therapeutics, Inc. (NASDAQ:HALO) is one of the best small-cap stocks with huge upside potential according to Redditors. The company is working on oncology therapies designed to target the tumor microenvironment. The company recently announced to acquire Elektrofi, which can expand its drug delivery capabilities into high-concentration biologic formulations. The stock has gained about 54% so far this year.\nThe FDA recently approved Darzalex Faspro, an injectable version of the multiple myeloma therapy daratumumab, developed by J&J and Halozyme Therapeutics (HALO). The product was approved as a front-line option for light chain (AL) amyloidosis, a rare blood cell disorder.\nEarlier in November, the company posted strong quarterly results, indicating revenue growth of 22% year over year, while royalty revenue increased 52%.\nArtisan Small Cap Fund stated the following regarding Halozyme Therapeutics, Inc. (NASDAQ:HALO) in itssecond quarter 2025 investor letter:\n“Among the detractors in Q2 wereHalozyme Therapeutics, Inc.(NASDAQ:HALO), Clearwater Analytics and Lattice Semiconductor. Halozyme provides a unique technology platform (ENHANZE®) that converts biologics and small molecule drugs administered intravenously into a subcutaneous formulation. The company reported strong earnings and raised its full-year guidance in May, but shares were negatively impacted by uncertainty surrounding new draft guidance from the Centers for Medicare and Medicaid Services (CMS) on drug pricing and potential delays in launching new products. We trimmed our position as we await final guidance from CMS.”\nWhile we acknowledge the potential of HALO as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ACR:Q2",
        "HALO",
        "JNJ",
        "PCT:22",
        "PCT:52",
        "PCT:54"
    ]
}