{
    "title": "fuboTV (FUBO) Drops on End of NBCUniversal Deal",
    "url": "https://finance.yahoo.com/news/fubotv-fubo-drops-end-nbcuniversal-142301808.html",
    "date": "2025-11-27T14:23:01.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. fuboTV Inc. (NYSE:FUBO) is one of the worst-performing stocks on Wednesday.\nfuboTV dropped its share prices by 3.22 percent on Wed...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. fuboTV Inc. (NYSE:FUBO) is one of the worst-performing stocks on Wednesday.\nfuboTV dropped its share prices by 3.22 percent on Wednesday to end at $3.01 apiece as investors sold off positions after NBCUniversal terminated its partnership with the company a few days before Thanksgiving.\nIn a statement, fuboTV Inc. (NYSE:FUBO) said the withdrawal stemmed from recent negotiations that it did not agree to, as it would allegedly result in higher subscription costs to its customers.\nAccording to fuboTV Inc. (NYSE:FUBO), NBCUniversal explained that it would spin off some of its cable networks into a new company called Versant by January 1, 2026, and that it wanted to renew and extend the deal well past the time that its assets would be owned by a separate company. However, the proposal would result in higher pass-on charges to consumers.\nfuboTV Inc. (NYSE:FUBO) also claimed that it experienced discrimination from NBCUniversal after the latter refused to provide the company the same rights for Peacock as with YouTube TV and Amazon Prime.\n“Fubo’s goal is to make Peacock available directly in our channel store so subscribers can access all of their content in one place and seamlessly pay on one bill,” it said.\n“Fubo is committed to bringing its subscribers a premium, competitively-priced live TV streaming experience with the content they love. That includes multiple content options, including a sports-focused service, that can be accessed directly from the Fubo app. We hope NBCU reconsiders their stance, or we’ll be forced to move forward without them,” it added.\nNCBUniversal has yet to issue its side as of this writing.\nWhile we acknowledge the potential of FUBO as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "FUBO",
        "USD:$3.01"
    ]
}