{
    "title": "Google Clears DOJ Antitrust Hurdle for $32 Billion Wiz Deal",
    "url": "https://finance.yahoo.com/news/google-clears-doj-antitrust-hurdle-072231203.html",
    "date": "2025-11-05T07:22:31.000Z",
    "author": "Josh Sisco",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) — Alphabet Inc.’s (GOOG,GOOGL) Google and cybersecurity company Wiz Inc. cleared a key hurdle to closing their $32 billion deal, with the US government saying it would wrap up its investig...",
    "full_content": "(Bloomberg) — Alphabet Inc.’s (GOOG,GOOGL) Google and cybersecurity company Wiz Inc. cleared a key hurdle to closing their $32 billion deal, with the US government saying it would wrap up its investigation of the acquisition.\nAfter the companies first announced their tie-up in March, the Justice Department opened up an in-depth probe of the deal, Bloomberg reported in June. The decision to close the review, pursuant to so-called early termination, is dated Oct. 24 on the website of the Federal Trade Commission.\nMost Read from Bloomberg\nTrump’s 90,000-Square-Foot Ballroom Plan Puzzles the Experts\nCan Anyone Save Gary, Indiana?\nBoston’s South Station Gets a Towering Makeover\nIn Vancouver, A Court Ruling on Indigenous Land Triggers Real Estate Angst\nColorado Ski Haven Asks Voters If It Can Borrow More for Housing\nWiz Chief Executive Officer Assaf Rappaport confirmed at a Wall Street Journal event on Tuesday that the DOJ concluded its review, but the deal is still under scrutiny by other antitrust regulators.\nA Google spokesperson didn’t immediately respond outside regular business hours to a request for comment.\nIn granting early termination, US antitrust agencies signal that their review is no longer an impediment to companies closing a merger.\nThe timing however is unusual, since the FTC said it wouldn’t grant early termination during the US government shutdown. The FTC handles the process for itself and the Justice Department. On Friday, the FTC also granted early termination for an acquisition by Pfizer Inc. While the notice for the Google-Wiz deal is dated earlier, it was posted to the FTC website after the notice for the Pfizer (PFE) deal.\nThe DOJ’s move to end its review of the Wiz takeover marks a reprieve for Google while it has been under antitrust scrutiny around the world. After two separate trials, US judges have ruled that the tech giant has illegally monopolized the markets for online search and display advertising technology. A federal judge in Virginia will soon decide whether to force the sale of some of Google’s ad tech business.\nMost Read from Bloomberg Businessweek\nA Wave of US Layoffs Flash Early Warning Sign for Job Market\nMen’s Groups (Not ‘Boys Clubs’) Quietly Emerge in Big Business\nPortugal Has Plenty of Tourists. Now It Wants Data Centers\nNew York’s Golden Handcuffs: Why the City Has a Special Hold on the Rich\nAllow Zohran Mamdani to Reintroduce Himself\n©2025 Bloomberg L.P.",
    "tags": [
        "GOOG",
        "GOOGL",
        "PFE"
    ]
}