{
    "title": "Baidu cuts jobs across the board, restructures AI teams after loss-making quarter",
    "url": "https://finance.yahoo.com/news/baidu-cuts-jobs-across-board-093000939.html",
    "date": "2025-11-27T14:49:44.000Z",
    "author": "South China Morning Post",
    "source": "finance.yahoo.com",
    "content_snippet": "Chinese tech giant Baidu (BIDU,9888.HK) is cutting an undisclosed number of jobs across major divisions and restructuring artificial intelligence teams, as the company moves to streamline operations f...",
    "full_content": "Chinese tech giant Baidu (BIDU,9888.HK) is cutting an undisclosed number of jobs across major divisions and restructuring artificial intelligence teams, as the company moves to streamline operations following a loss-making quarter, according to multiple sources.\nBaidu has axed staff in Beijing, Shanghai and Guangzhou, affecting multiple major business units from its mobile ecosystem group, which includes its bread-and-butter search business, to intelligent cloud and technology platform groups, according to employees affected by the move.\nOne Beijing-based employee in the mobile ecosystems unit said four of the nine people on his team received severance notices in separate meetings with human resource managers this week, and were expected to leave in December.\nThe affected employees were given compensation packages that included one month's pay for each year of service, and between one and three months of additional salary, according to one employee, who added that it was the largest lay-off at Baidu in recent years.\nAnother employee in Guangzhou said he signed the severance agreement, despite an initial hesitance, because the compensation package was reasonable.\nIt was not immediately known how many employees would be laid off. Baidu did not respond to multiple requests for comment on Thursday.\nThe Beijing-based company has been downsizing its payroll in recent years. It had 35,900 employees at the end of 2024, a drop of 9.8 per cent from the previous year.\nBaidu's job cuts come after the company posted a third-quarter loss in spite of a50 per cent jump in AI-related revenuein the three months ended September 30.\nHowever, the AI surge did not offset a lacklustre quarter as revenue for the period declined 7 per cent year on year, owing to sluggish demand in its advertising business amid slower overall economic growth.\nFor the quarter, the company reported an 11.2 billion yuan (US$1.6 billion) loss on asset write-downs during the period.\nBaidu also restructured its AI model development by establishing two separate units for foundational models and application models, according to a Wednesday report by local media outlet Jiemian.\nThe new units, reporting directly to founder and CEO Robin Li Yanhong, will be responsible for the company's Ernie AI model series. Responsibility for the company's flagship AI model has been handed to a younger cohort of managers, mirroring a strategy seen at DeepSeek and ByteDance, where rising talent is being pushed to the forefront of AI research.\nBaidu also replaced Xue Su as head of its ChatGPT-like Ernie bot app, known as Wenxin in China, according to one source familiar with the matter.\nThe company, which was among the first in China to launch a challenger to OpenAI's ChatGPT, was also losing chatbot users.\nErnie was ranked the ninth most popular AI chatbot by monthly active users in September, trailing the top three of ByteDance's Doubao, DeepSeek's namesake chat app and Tencent Holding's (0700.HK,TCEHY) Yuanbao, according to data published last month by analytics firm QuestMobile.\nBaidu was also facing stiff competition from other AI models in the Chinese market, said Wang Kai, senior equity analyst at investment consultancy Morningstar.\n\"The company is trying to be as flexible as possible given that large language models are increasingly becoming more commoditised,\" Wang said.\nThis article originally appeared in theSouth China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore theSCMP appor visit the SCMP'sFacebookandTwitterpages. Copyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.\nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved.",
    "tags": [
        "ACR:CEO",
        "BAIDF",
        "BIDU",
        "TCEHY",
        "TCTZF"
    ]
}