{
    "title": "Trump floats $2,000 tariff rebate checks. What you need to know",
    "url": "https://finance.yahoo.com/news/trump-floats-2-000-tariff-162212508.html",
    "date": "2025-11-11T16:35:08.000Z",
    "author": "David Goldman, Elisabeth Buchwald, CNN",
    "source": "finance.yahoo.com",
    "content_snippet": "President Donald Trump, embattled by America’s growingaffordability problems, has once again floated a unique solution: Sending Americans rebate checks for the tariffs that his administration has coll...",
    "full_content": "President Donald Trump, embattled by America’s growingaffordability problems, has once again floated a unique solution: Sending Americans rebate checks for the tariffs that his administration has collected.\n“People that are against Tariffs are FOOLS!” Trumpposted on Truth SocialSunday. “A dividend of at least $2000 a person (not including high income people!) will be paid to everyone.”\nIt’s a bold promise with several significant complications.\nTrump has frequently floated the idea of tariff rebate checks. Prior to this weekend’s proposal, Trump in August had said Americans couldreceive a portion of the tariff revenue.\n“We’re taking in so much money that we may very well make a dividend to the people of America,” Trump said at the time.\nWhile American importers foot the initial tariff bill, they’ve been passing along some of those added costs to consumers, meaning Americans are indirectly paying for tariffs, too.\nThe idea sounds similar to stimulus checks that went out in the wake of the pandemic recession — once towards the end of Trump’s first term, in 2020; and again in 2021 when former President Joe Biden was in office. But Trump suggested that these tariff rebate checks could be funded not by a general pool of taxpayer funds but instead from the money collected by US importers who pay the historic tariffs Trump has imposed on a vast number of goods from overseas.\nTrump’s top economic adviser threw some cold water on the rebate checks.\nTreasury Secretary Scott Bessent was noncommittal about the proposal on Sunday in an interview with ABC’s “This Week.” Bessent said no formal proposals have been made to distribute tariff revenue and suggested Trump’s mention of a $2,000 payment “could come in lots of forms,” including making up for lost revenue from not taxing tips, overtime and Social Security payments.\nThe Trump administration has collected more than $220 billion in tariff revenue, which includes a mix of various tariffs Trump has imposed and previous tariffs that were in place before Trump took office, according to the US Treasury.\nMore than 163 million Americans filed tax returns in 2024, theIRS said.\nSo a back-of-the-envelope calculation would put $2,000 stimulus checks at a total cost of about $326 billion. That’s more than the tariff revenue America has collected since Trump’s second term began.\nTrump said he would exclude wealthy Americans, but it’s not clear where the cut-off would be and whether that could make up for the difference.\nEven with an income threshold of $100,000 — far from the highest income tax bracket — around 150 million adults would qualify. That would cost the administration roughly $300 billion, wrote Erica York, vice president of federal tax policy at the Tax Foundation, in a post on X.\nAccording to a Monday morning social media post, the president seems to think there would be enough money left after tariff rebate checks are doled out to help pay down the nation’s nearly $40 trillion in debt.\n“All money left over from the $2000 payments made to low and middle income USA Citizens, from the massive Tariff Income pouring into our Country from foreign countries, which will be substantial, will be used to SUBSTANTIALLY PAY DOWN NATIONAL DEBT,” Trump wrote on Truth Social.\nA White House official didn’t specify what requirements would need to be met to qualify for a check. “The Administration is committed to putting this money to good use for the American people,” the official told CNN.\nAnother complicating factor: TheSupreme Court appears skepticalof the Trump administration’s use of emergency powers to impose tariffs. About $100 billion of the total tariff revenue so far has been collected through this method.\nIf the court rules against the Trump administration, it may have toreturn that money to businesses, which would significantly reduce the amount of tariff money available as a rebate for American households.\nIt could also complicate the process of refunding businesses if money has already been distributed to individuals.\nAlmost certainly not.\nCongress maintains the power of the purse, and past stimulus checks have required Congressional approval, and it’s unclear if Trump has enough support to pass something like this.\nAlthough stimulus checks have proven politically popular in the past, they have come almost exclusively during recessions or emergencies. The American economy is in neither at the moment.\nRebate checks could exacerbate rising prices at a time when Americans sayinflation and affordabilityare their top concern. Sending out checks could give America’s economy a sugar rush at the worst possible time and could ultimately ding American households if the Federal Reserve needs to hike its benchmark interest rate to counteract rising prices.\nThat could lose Trump some key votes among fiscal conservatives in his own party.\nEven if the rebate checks get approval, don’t hold your breath.\nDuring the pandemic, Americans who elected to receive direct deposit checks had the money in their bank accounts within about a week of the first stimulus package passing. Where it got much more dicey was for the Americans who elected to receive paper checks. That process took around 20 weeks.\nFor more CNN news and newsletters create an account atCNN.com",
    "tags": []
}