{
    "title": "Oil Stalls as Traders Await Next Steps on Ukraine, OPEC+ Meeting",
    "url": "https://finance.yahoo.com/news/oil-edges-lower-traders-put-003728931.html",
    "date": "2025-11-27T14:05:45.000Z",
    "author": "Alex Longley",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) --Oil was nearly flat as investors await the next steps in US-led efforts to end the war in Ukraine, while looking ahead to an OPEC+ gathering this weekend.\nBrent was near $63 a barrel, ma...",
    "full_content": "(Bloomberg) --Oil was nearly flat as investors await the next steps in US-led efforts to end the war in Ukraine, while looking ahead to an OPEC+ gathering this weekend.\nBrent was near $63 a barrel, marginally higher for the week, in a session where trading is likely to be thin due to the Thanksgiving holiday in the US. Prices swung in the past two sessions as investors weighed White House optimism over a peace deal — and potential implication for Russian supplies — against familiar quandaries that led past attempts to fail.\nMost Read from Bloomberg\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nWith presidential envoy Steve Witkoff set to lead an American delegation to Moscow next week, the picture remains blurred for now. Russia’s Vladimir Putin said Thursday the US plan could prove the basis for a deal, but that some points require discussion.\nAlmost 20 oil traders and investors interviewed by Bloomberg said they either weren’t expecting a peace deal at all, or if one did materialize, it would take time to boost flows of Russian barrels.\nOPEC and its allies, meanwhile, are set to meet Nov. 30. Eight of the group’s members decided earlier this month to pause further output increases in the first quarter of next year, after ramping up supplies at speed over 2025.\nCrude is on track to register a fourth monthly drop in November, the longest losing run since 2023. Prices have been tugged lower by prospects for a surplus, as supplies run ahead of demand, and more recently, the diplomacy over Ukraine.\n“Geopolitical volatility continues and hopes of a potential ceasefire between Russia and Ukraine have neutralized the supply concerns arising from new US sanctions on key Russian producers,” Barclays analyst Amarpreet Singh wrote in a note. “Even if there was a diplomatic breakthrough, it would be unlikely to lead to a material increase in Russian output in 2026.”\n--With assistance from Charlie Zhu and Sarah Chen.\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "BZ",
        "CL",
        "F"
    ]
}