{
    "title": "Wacker Chemie Becomes Latest German Company to Cut Jobs in Ailing Labor Market",
    "url": "https://finance.yahoo.com/news/wacker-chemie-becomes-latest-german-121000609.html",
    "date": "2025-11-27T12:10:00.000Z",
    "author": "Adam Whittaker and Joshua Kirby",
    "source": "finance.yahoo.com",
    "content_snippet": "Wacker Chemie plans to cut more than 1,500 jobs in a move to reduce costs and boost its edge against Chinese competition, delivering a new blow to a German labor market battling joblessness.\nThe Munic...",
    "full_content": "Wacker Chemie plans to cut more than 1,500 jobs in a move to reduce costs and boost its edge against Chinese competition, delivering a new blow to a German labor market battling joblessness.\nThe Munich-based chemicals maker aims to save some 150 million euros ($173.9 million) a year by shrinking its workforce by about 9% through 2027, with most of the job losses coming domestically. That will make up half of a targeted 300 million euros in annual savings, mostly from lower fixed production costs, Wacker said.\nThe Untold Story of Charlie Munger’s Final Years\nHere’s What’s Really in a Can of Campbell’s Chicken Soup\nCampbell’s Fires Executive Behind Recording That Disparaged Its Food\nCorporate Dealmaking Is Getting Bigger and Bolder Under Trump\nTodd Boehly Makes a Play for International Assets of Russia’s Lukoil\nThe company has roughly 16,400 employees, according to its website.\n“The aim is to reduce our costs to a competitive level through savings,” Chief Executive Christian Hartel said.\nThe layoffs add Wacker to a long list of German employers cutting labor costs in response to economic headwinds. Pressures on German industry range from anemic domestic investment to high energy costs and the growing challenge to exporters from China and other economies. Higher barriers to the key U.S. market due to President Trump’s trade tariffs have also hit the country’s key export sector.\n“Germany has lost international competitiveness as a result of long-term underinvestment, a portion of naivety and arrogance, and China’s rise from export destination to system rival,” ING economist Carsten Brzeski wrote in a recent note.\nAuto giant Volkswagen, long a mainstay of Europe’s largest economy, has cut thousands of jobs since the end of last year and plans to close some plants for the first time in its history. Competitor Ford is also cutting thousands of positions in Germany and other parts of Europe due to a weaker market for electric vehicles. Fading EV demand has also led Porsche to ditch plans to make its own battery cells, forcing cuts at its battery-making subsidiary in southwestern Germany. Supplier Bosch plans to shrink its workforce by 13,000 over the next five years.\nIn other sectors, chemicals distributor Brenntag, Wacker peers Ineos and Solvay, sportswear maker Puma and airline group Lufthansa have all recently announced job cuts in Germany.\nThe layoffs underscore stagnation in the German economy and has contributed to the number of jobseekers in the country topping 3 million this summer. That level has since eased, though there is “little sign of outright improvement,” economists at consultancy Pantheon Macroeconomics wrote to clients.\nWacker cited high energy prices and bureaucratic red tape in Germany as obstacles to growth, fuelling its move to cut jobs. The company last month said it expects to swing to a net loss this year, pointing to a “persistently weak” market for chemicals.\n“The market environment is changing, and competitive pressure is high, especially from China,” Hartel said at the time.\nWrite to Adam Whittaker atadam.whittaker@wsj.comand to Joshua Kirby atjoshua.kirby@wsj.com\nFive Key Takeaways From the Fed’s Economic Survey\nIt Really Is Possible to Spend Too Much on AI\nHoward Lutnick’s Former Wall Street Firm Is Having Its Best Year Ever\nDeere Warns of Tough Year Ahead as Earnings, Sales Fall\nChicago Business Activity Slumps Unexpectedly",
    "tags": [
        "ACR:Fed",
        "PCT:9",
        "WKCMF"
    ]
}