{
    "title": "Don't panic yet, investors say, as high-flying AI stocks tumble",
    "url": "https://finance.yahoo.com/news/dont-panic-yet-investors-high-081528938.html",
    "date": "2025-11-05T08:15:28.000Z",
    "author": "Ankur Banerjee",
    "source": "finance.yahoo.com",
    "content_snippet": "By Ankur Banerjee\nSINGAPORE (Reuters) -Sharp falls in technology stock prices are cause for caution but not panic yet, say brokers and investors who have been riding a runaway market to record highs a...",
    "full_content": "By Ankur Banerjee\nSINGAPORE (Reuters) -Sharp falls in technology stock prices are cause for caution but not panic yet, say brokers and investors who have been riding a runaway market to record highs and some stretched valuations.\nSelling extended into a second day on Wednesday to leave bourses in Seoul and Tokyo around 5% beneath peaks on Tuesday morning. Nasdaq futures were down 0.2% after a 2% fall for the index on Tuesday.\nHardest hit have been the biggest winners of a rally that has vaulted chipmaker,Nvidia, from a niche player to the most valuable company on earth. For now, it's the speed and not markets' faith inartificial intelligencethat is in question.\n\"The selloff appears to be largely positioning-driven, with recent outperforming names taking the worst of the move,\" said Jon Withaar, senior portfolio manager at Pictet Asset Management in Singapore.\nThere was no obvious trigger for the pullback, but it began with an unexpectedly negative reaction to strong financial results at Silicon Valley data and artificial intelligence firm Palantir Technologies.\nShares in the market darling finished down nearly 8% on Tuesday, and fell a further 3% in extended trade.\nOn Tuesday, Nvidia shares fell nearly 4% on Wall Street to be down about 7% from last month's peak while suppliers, competitors and firms up and down the AI supply chain came in for a beating in Asia on Wednesday.\n\"It's fairly blanket selling in the risk-leverage part of the market which to us looks like short-term profit taking,\" said Angus McGeoch, Barrenjoey's head of equities distribution for Asia in Hong Kong.\nHe said fund managers with an eye on their 2025 results would be quick to duck out of downdrafts at this time of year, but not yet looking for a wholesale exit.\n\"Obviously (they) don't want to give up a lot, given the year's been kind... but if the market looks like it wants to go again, then I don't think it would take much to get people back involved.\"\n'A WOBBLE'\nMarkets have for months marched past worries from elevated interest rates, stubborn inflation, trade turmoil, and a patchy global economy leading to questions about whether the artificial intelligence boom is a bubble waiting to burst.\nTo be sure, Tuesday's 2% drop in the Nasdaq follows a rise of more than 50% from April lows.\nYet Wall Street chiefs Ted Pick of Morgan Stanley and David Solomon of Goldman Sachs gave voice to some of the unease in markets and raised the prospect of a pullback at an investment summit in Hong Kong.\nMoreover, South Korea's stock exchange cautioned on investing in chipmaker SK Hynix - a routine warning for the stock which had tripled in 12 months but enough to trigger a 6% two-day fall.\n\"It's a classic position-unwind and profit-taking day,\" Saxo Chief Investment Strategist Charu Chanana said, adding such moves are \"healthy\" and do not suggest panic.\nMatthew Haupt, lead portfolio manager at Wilson Asset Management in Sydney viewed the downturn as investors taking money off the table ahead of Wednesday's U.S. Supreme Court hearing on the legality of tariffs.\n\"I've been buying today,\" he said. \"I hope I'm right.\"\n(Reporting by Ankur Banerjee, additional reporting and writing by Tom Westbrook)",
    "tags": [
        "IXIC",
        "KS",
        "NVDA",
        "PLTR"
    ]
}