{
    "title": "Morgan Stanley Warns Oracle Credit Protection Nearing Record High",
    "url": "https://finance.yahoo.com/news/morgan-stanley-warns-oracle-credit-215223845.html",
    "date": "2025-11-27T10:30:48.000Z",
    "author": "Caleb Mutua",
    "source": "finance.yahoo.com",
    "content_snippet": "(Bloomberg) — A gauge of risk on Oracle Corp.’s (ORCL) debt reached a three-year high in November, and things are only going to get worse in 2026 unless the database giant is able to assuage investor ...",
    "full_content": "(Bloomberg) — A gauge of risk on Oracle Corp.’s (ORCL) debt reached a three-year high in November, and things are only going to get worse in 2026 unless the database giant is able to assuage investor anxiety about a massive artificial intelligence spending spree, according to Morgan Stanley.\nA funding gap, swelling balance sheet and obsolescence risk are just some of the hazards Oracle is facing, according to Lindsay Tyler and David Hamburger, credit analysts at the brokerage. The cost of insuring Oracle Corp.’s debt against default over the next five years rose to 1.25 percentage point a year on Tuesday, according to ICE Data Services.\nMost Read from Bloomberg\nDespite Star Architect’s Alleged Misconduct, New Harlem and Princeton Museums Shine\nHigh-Rises Are Changing the Slovak Capital of Bratislava Beyond Recognition\nBikeshare Shouldn’t Kick Tourists to the Curb\nDC Mayor Bowser Won’t Seek Reelection in 2026\nThe price on the five-year credit default swaps is at risk of toppling a record set in 2008 as concerns over the company’s borrowing binge to finance its AI ambitions continue to spur heavy hedging by banks and investors, they warned in a note Wednesday.\nThe CDS could break through 1.5 percentage point in the near term and could approach 2 percentage points if communication around its financing strategy remains limited as the new year progresses, the analysts wrote. Oracle CDS hit a record 1.98 percentage point in 2008, ICE Data Services shows.\nA representative for Oracle declined to comment.\nOracle is among firms taking part in an artificial intelligence spending race, which has quickly made the data center giant the credit market’s barometer for AI risk. The company borrowed $18 billion in the US high-grade market in September. Then in early November, a group of about 20 banks arranged a roughly $18 billion project finance loan to construct a data center campus in New Mexico, which Oracle will take over as tenant.\nBanks are also providing a separate $38 billion loan package to help finance the construction of data centers in Texas and Wisconsin developed by Vantage Data Centers, Bloomberg reported last month. Lenders involved in these construction loans linked to Oracle are likely a key driver of the surge in trading volume on the Oracle’s CDS recently, a trend that may persist, according to Morgan Stanley.\n“Over the past two months, it has become more apparent that reported construction loans in the works, for sites where Oracle is the future tenant, may be an even greater driver of hedging of late and going forward,” wrote the analysts.\nThere is a risk that some hedges by banks could unwind if and when banks distribute these loans to other parties, they wrote. Still, other parties may also hedge at some point even if down the road plus the construction debt funding needs don’t stop after the Vantage sites and the New Mexico site.\nLast month, the analysts said they expect near-term credit deterioration and uncertainty to drive further hedging by bondholders, lenders and thematic players.\n“The bondholder hedging dynamic and also the thematic hedging dynamic could both grow in importance down the road,” they added.\nOracle CDS have underperformed the broader investment-grade CDX index and Oracle corporate bonds have underperformed the Bloomberg high-grade index amid the jump in hedging demand and the weakening sentiment. Concerns have also started to weigh on Oracle’s stock, which the analysts said may incentivize management to outline a financing plan on the upcoming earnings call, including details on Stargate, data centers and capital spending.\nThe analysts had previously been recommending investors buy Oracle bonds and CDS in what is known as a basis trade, to profit from their expectation that credit derivatives would widen more than the bonds. Now they’re saying it’s a cleaner trade to just buy the CDS outright.\n“Therefore, we are closing the ‘buy bond’ part of the basis trade, and keeping the ‘buy CDS protection’ leg of it,” they wrote. “We think a trade in CDS outright is cleaner right now and will result in a greater spread move.”\nMost Read from Bloomberg Businessweek\nPulte’s Move to Fix Credit Scores Is Bad News for Homebuyers\nThe AI Industry Is Built on a Big Unproven Assumption\nTarget Needs More Than a Vibe Shift to Turn Its Business Around\nThe Dirty Secret of Biodegradable Plastic\nPermabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End\n©2025 Bloomberg L.P.",
    "tags": [
        "ORCL"
    ]
}