{
    "title": "Avadel (AVDL) Drops 6.7% on Lack of Leads",
    "url": "https://finance.yahoo.com/news/avadel-avdl-drops-6-7-142238493.html",
    "date": "2025-11-27T14:22:38.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Avadel Pharmaceuticals plc (NASDAQ:AVDL) is one of the worst-performing stocks on Wednesday.\nAvadel declined by 6.67 percent on We...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. Avadel Pharmaceuticals plc (NASDAQ:AVDL) is one of the worst-performing stocks on Wednesday.\nAvadel declined by 6.67 percent on Wednesday to end at $21.40 apiece as investors sold off positions amid the lack of fresh catalysts to boost buying.\nIn recent developments, Avadel Pharmaceuticals plc (NASDAQ:AVDL) reached an updated agreement with Alkermes PLC for their proposed merger, after the latter raised its acquisition offer that would value the company worth $2.37 billion.\nUnder the updated offer, Alkermes would acquire shares of Avadel Pharmaceuticals plc (NASDAQ:AVDL) at a price of $22.50 apiece, consisting of $21 in cash and one non-transferrable contingent value right of $1.50 per share upon the Food and Drug Administration’s (FDA) approval of Lumryz.\nThe offer was markedly higher than its $20 initial offer submitted last October.\nAlkermes’ revision followed H. Lundbeck A/S own bid to acquire Avadel Pharmaceuticals plc (NASDAQ:AVDL) for $23, comprising of $21 in cash and $2 non-transferrable contingent value rights (CVR) upon the achievement of two annual sales milestones for Lumryz and valiloxybate. Lundbeck’s proposal remained higher by 50 cents each.\nAvadel and Alkermes’ initial agreement allowed for the former to talk and share information with another prospective buyer, but it cannot break the agreement it signed with the latter.\nWhile we acknowledge the potential of AVDL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "ALKS",
        "AVDL",
        "USD:$1.50",
        "USD:$2.37",
        "USD:$21.40",
        "USD:$22.50"
    ]
}