{
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures take a breath after tech selloff",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-take-a-breath-after-tech-selloff-235720689.html",
    "date": "2025-11-05T09:49:12.000Z",
    "author": "Rian Howlett",
    "source": "finance.yahoo.com",
    "content_snippet": "US stock futures struggled on Wednesday following a rough trading session that saw Wall Street equity markets close deep in the red.\nDow Jones Industrial Average futures(YM=F)hovered just above the fl...",
    "full_content": "US stock futures struggled on Wednesday following a rough trading session that saw Wall Street equity markets close deep in the red.\nDow Jones Industrial Average futures(YM=F)hovered just above the flat line, while S&P 500 futures(ES=F)dropped 0.1%. Contracts on the tech-heavy Nasdaq 100(NQ=F)fell 0.2%, as shares of AI chipmaker AMD (AMD) slid after its earningsbeat estimatesbut nevertheless underwhelmed.\nDuring regular tradingon Tuesday, the Nasdaq Composite (^IXIC) led a steep stock slide, falling over 2%. The pullback followed a sharp selloff in tech names, led by Palantir (PLTR), whichfell nearly 8% despite topping third-quarter expectations.\nThe stock’s lofty valuation has some investors questioning whether theAI-fueled rally has left fundamentals behind. Fears of an AI-fueled bubble are beginning to mount, spurred by investorMichael Burry's puts against both Palantir and Nvidia(NVDA). AMD's underwhelming earnings reveal could add more fuel to that fire.\nIn Wednesday's earnings lineup,McDonald’s(MCD),Qualcomm(QCOM), Robinhood (HOOD), and Toyota (TM) are among the highlights.\nOn the data front, traders will look to the ADP private payrolls report on Wednesday for clues about the labor market, alongside updates on mortgage applications and ISM services activity. The government shutdown continues to stall economic releases, and on Wednesday will be the longest in history by Wednesday. In the latest development, the Trump administration is warning of \"mass chaos\" for travellers as officials look at closing airports.\nMeanwhile,President Trump's tariffsface a key test on Wednesday when the Supreme Court hears arguments in a casequestioning his legal authority to impose his most sweeping duties. The high court's decision could have significant reverberations for the global economy.\nNovo Nordisk (NVO,NOVO-B.CO) cut its forecasts for full-year profit and sales on Wednesday, as its new CEO drives a push to regain ground lost amid fierce competition in the weight-loss drug market.\nUS-listed shares in the Ozempic and Wegovy maker rose almost 3% in premarket as investors digested the Danish drugmaker's quarterly earnings release.\nReuters reported:\nRead more here.\nAsian markets fell in tandem with US gauges as the global market followed a tech sell-off trend. Investor appetite for sky-high AI spend appears to have hit a ceiling as fears of over-inflated AI valuations spread.\nSouth Korea’s Kospi (^KS11) fell over 6% before pulling back to a 3% drop.\nJapan’s benchmark, the Nikkei 225 (^N225) levelled off at losses of 2.8%\nHong Kong’s Hang Seng index (^HSI) slipped 0.5%.\nThe fall came following a day of heavy losses for major American gauges as AI tech darlings like Palantir fell despite solid earnings reports.\nGold (GC=F) continues to struggle around the $4,000 mark following a record-setting run, as a strong dollar, combined with the Fed's rate cuts, has dampened haven demand.\nBloomberg reports:\nRead more here.",
    "tags": [
        "ES",
        "F",
        "GSPC",
        "IXIC",
        "NQ",
        "YM"
    ]
}