{
    "title": "Bank of America: Nearly one-third of low-income US households are living paycheck to paycheck",
    "url": "https://finance.yahoo.com/news/bank-of-america-nearly-one-third-of-low-income-us-households-are-living-paycheck-to-paycheck-155736389.html",
    "date": "2025-11-11T15:57:36.000Z",
    "author": "Ines Ferré",
    "source": "finance.yahoo.com",
    "content_snippet": "More Americans are living paycheck to paycheck, largely because lower-income earners spend most of their money to cover essentials like housing, gasoline, and groceries, according to new data from Ban...",
    "full_content": "More Americans are living paycheck to paycheck, largely because lower-income earners spend most of their money to cover essentials like housing, gasoline, and groceries, according to new data from Bank of America.\nThe study, released Tuesday, found that nearly 24% of all households are classified as living paycheck to paycheck this year, meaning their immediate earnings go toward basic necessities. That share is slightly higher than last year, but the rate has slowed year over year.\nThe reason for the slowdown: Financial strains are becoming increasingly concentrated among lower-income earners. \"The number of lower-income households (especially Millennials and Gen X) living paycheck to paycheck continues to rise while there is almost no increase in the number of higher- and middle-income households,\" per the BofA study.\nThe data shows 29% of lower-income households are living paycheck to paycheck, up from 28.6% in 2024 and 27.1% in 2023. However, there has been little to no increase in the share of middle- or higher-income households using their immediate income to cover only basic expenses. \"Why are we only seeing an increase in lower-income households? In our view, it’s likely due to slowing wage growth for this cohort,\" the study authors wrote.\nBofA pointed out that wages for lower-income earners have been lagging relative to their higher-income counterparts since the beginning of 2025.\nRead more:6 Gen Z savings strategies that can work for anyone\nBy age, BofA data shows that more middle-aged households, such as millennials and Gen X, have been living paycheck to paycheck since last year.\nMeanwhile, higher-income millennial households have seen their average wages grow five percentage points faster than the wages of lower-income households in the same generation.\nThe data reflects the \"K-shaped economy\" strategists have pointed out, with higher-income asset holders driving the bulk of consumer spending and faring better than lower-income households. \"It's very bifurcated, and I think that's reflective of what we're seeing in the economy and consumers in general,\" B. Riley Wealth chief market strategist Art Hogan told Yahoo Finance on Monday.\nConsumer Staples (XLP) companies and fast food restaurants ranging from Chipotle (CMG) to McDonald's (MCD) have warned of the bifurcated consumer trend and pressures facing lower-income earners.\n\"Think about the low-income consumer and ... the pressures that they face ... rents are at pretty high levels ... food prices, whether it's in restaurants or grocery ... childcare is high,\" McDonald's CEO Chris Kempczinski said last week.\nChipotle CEO Scott Boatwright noted after the company's latest earnings call that a pullback in all income cohorts seen earlier this year has now widened, \"with low- to middle-income guests further reducing frequency.\"\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on X at@ines_ferre.\nClick here for the latest cryptocurrency news, prices, updates, and more\nRead the latest financial and business news from Yahoo Finance",
    "tags": [
        "ACR:CEO",
        "BAC",
        "CMG",
        "MCD",
        "PCT:24",
        "PCT:27.1",
        "PCT:28.6",
        "PCT:29",
        "XLP"
    ]
}