{
    "title": "Looking to experts for how the Supreme Court will rule on tariffs? They aren't sure either.",
    "url": "https://finance.yahoo.com/news/looking-to-experts-for-how-the-supreme-court-will-rule-on-tariffs-they-arent-sure-either-141959943.html",
    "date": "2025-11-04T23:11:34.000Z",
    "author": "Ben Werschkul",
    "source": "finance.yahoo.com",
    "content_snippet": "Tariff watchers have had this Wednesday circled on their calendars for weeks now, as the Supreme Court is set to hear arguments on the legality of the authority President Trump has used to impose the ...",
    "full_content": "Tariff watchers have had this Wednesday circled on their calendars for weeks now, as the Supreme Court is set to hear arguments on the legality of the authority President Trump has used to impose the lion's share of his tariffs.\nThat's in part because observers are split about how things will play out once deliberations begin and ahead of a decision that could come before the end of the year.\nThe case — formally knownas Learning Resources, Inc. v. Trump— is one that experts in both the legal and trade space are calling a toss-up. And it's made all the more fraught by Trump's keen personal interest in the outcome and a White House public pressure campaign already in evidence.\nAs for the projections, the odds are notable in how little confidence there is in any outcome.\nIn Yahoo Finance interviews recently,both Raymond James managing director Ed MillsandVeda Partners managing partner Henrietta Treyzfloated coin-flip level 50% odds, with Treyz adding a base case from \"50% to 65% odds that the Supreme Court will side with two lower courts and say the president doesn't have this authority.\"\nTerry Haines of Pangaea Policy leans the other direction and told clients this week he thinks a pro-tariff decision is slightly more likely, \"but the case isn't a slam dunk either way, and may well not yield a simple binary yes/no result on tariffs.\"\nThe case centers on a 1977 law called the International Emergency Economic Powers Act (IEEPA), which gives the president the ability to declare an economic emergency and take action but doesn't specifically outline tariffs as a remedy.\nTrump and his team have seized on the law to declare a variety of economic emergencies — over issues from fentanyl to trade imbalances and more — and then impose blanket tariffs on the world in response.\nRead more:What Trump's tariffs mean for the economy and your wallet\nThe plaintiffs in the case say the president has gone too far, and some have even floated the chance that the Trump administration may need to refund the tariffs if a decision doesn't go his way.\nMeanwhile, other Trump tariff authorities — such as the so-called Section 232 tariffs that have allowed sector-specific duties on goods like automobiles and steel — are not up for debate this week.\nOn Tuesday afternoon, White House press secretary Karoline Leavitt allowed that \"the White House is always preparing for Plan B\" in case the ruling doesn't go Trump's way, but maintained that \"we are confident and hopeful that the Supreme Court will do the right thing.\"\nInan already volatile week for stocks, markets will likely have only the tone and tenor of the justices' questions to go on.\n\"Beware of any overreaction,\" Brian Gardner, Stifel's chief Washington policy strategist, warned investors in his own note. His expectation is that markets are pricing in a likely victory for Trump's side but that the back-and-forth could upset expectations.\nAt least some of the intensity of this week subsided when Trump opted not to attend Wednesday's arguments in person as he'd suggested he might. However, the spotlight remains on Treasury Secretary Scott Bessent, set to attend instead.\nBessent saidMonday on Fox Newsthat he planned to have \"a ringside seat\" as he predicted a good outcome for the administration.\nThe uncertainty over Trump's tariffs at the court mirrors a larger question about whether his party may be readying a pushback to his tariff approach.\nLast week, the Senate voted toterminate Trump's tariffs on goods from Braziland fromCanada, with Sens. Lisa Murkowski of Alaska, Susan Collins of Maine, Mitch McConnell of Kentucky, and Rand Paul of Kentucky all joining with Democrats in a rare rebuke to Trump.\nRead more:The latest news and updates on Trump's tariffs\nThose measures may end up being largely symbolic — with House Speaker Mike Johnson likely able to block the House from ever taking up these resolutions — but they represent a pushback Trump hasn't seen so far in his second term and one he's clearly worried about coming in a more fulsome way from the Supreme Court.\nThat has upped the stakes, with Trump himselfsaying in recent daysthat this is \"the most important subject discussed by the Supreme Court in 100 years\" and that the economy \"will go to hell\" if the ruling isn't in his favor.\nThe eventual decision will come after the court's six conservative justices have often ruled in Trump's favor. Those decisions, however — on issues from spending authority to his immigration policies — have been temporary wins for Trump, allowing his policies to continue for the time being.\nThe tariff decision — whichever way it goes — is likely to have a much longer-lasting impact.\n\"The stakes of this case reach far beyond trade policy,\" Elizabeth Goitein, senior director at the nonpartisan Brennan Center,recently wrote, adding that this \"decision could shape whether the use of emergency powers to bypass Congress becomes a tool of routine governance.\"\nThis story has been updated with additional developments.\nBen Werschkul is a Washington correspondent for Yahoo Finance.\nClick here for political news related to business and money policies that will shape tomorrow's stock prices\nRead the latest financial and business news from Yahoo Finance",
    "tags": []
}