{
    "title": "CNH Industrial (CNH) Tumbles, Nears 52-Week Low",
    "url": "https://finance.yahoo.com/news/cnh-industrial-cnh-tumbles-nears-142253025.html",
    "date": "2025-11-27T14:22:53.000Z",
    "author": "Angelica Ballesteros",
    "source": "finance.yahoo.com",
    "content_snippet": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. CNH Industrial N.V. (NYSE:CNH) is one of the worst-performing stocks on Wednesday.\nCNH Industrial dropped its share prices by 3.29...",
    "full_content": "We recently published10 Stocks Losing Their Bite Before Thanksgiving. CNH Industrial N.V. (NYSE:CNH) is one of the worst-performing stocks on Wednesday.\nCNH Industrial dropped its share prices by 3.29 percent on Wednesday to close at $9.40 apiece—just 4 percent shy of its 52-week low—as investors unloaded portfolios amid the lack of fresh catalysts to spark buying appetite.\nAt intra-day trading, the stock dropped to its lowest price of $9.36, before recouping a few cents toward the close.\nIn recent news, CNH Industrial N.V. (NYSE:CNH) announced that its subsidiary, CNH Industrial Finance Europe SA, would redeem early all of the outstanding notes due January 19, 2026.\nThe notes have a coupon rate of 1.875 percent and will be redeemed on December 29, 2025, at their principal amount, alongside accrued but unpaid interest.\nEarlier this month, CNH Industrial N.V. (NYSE:CNH) saw its net income in the third quarter of the year dwindle by 78 percent to $67 million from $310 million in the same period last year.\nConsolidated revenues dipped by 5 percent to $4.399 billion from $4.654 billion year-on-year, as net sales from industrial activities dropped 7 percent to $3.7 billion from $3.997 billion.\nFollowing the results, CNH Industrial N.V. (NYSE:CNH) provided a bleak outlook for the full-year 2025, with net sales from agriculture operations expected to drop by 11 to 13 percent, and the construction segment to decline by 3 to 5 percent.\nWhile we acknowledge the potential of CNH as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on thebest short-term AI stock.\nREAD NEXT:30 Stocks That Should Double in 3 Yearsand11 Hidden AI Stocks to Buy Right Now.\nDisclosure: None. This article is originally published atInsider Monkey.",
    "tags": [
        "CNH",
        "USD:$9.36",
        "USD:$9.40"
    ]
}